[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:24:13
 
     public bool IsClientSecretHeaderValid()
     {
-        if (string.IsNullOrWhiteSpace(_cypressTestSecret) || _isLiveEnvironment)
+        if (string.IsNullOrWhiteSpace(_cypressTestSecret) && _isLiveEnvironment)
             return false;
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:24:13
 
     public bool IsClientSecretHeaderValid()
     {
-        if (string.IsNullOrWhiteSpace(_cypressTestSecret) || _isLiveEnvironment)
+        if (!(string.IsNullOrWhiteSpace(_cypressTestSecret) || _isLiveEnvironment))
             return false;
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:25:20
     public bool IsClientSecretHeaderValid()
     {
         if (string.IsNullOrWhiteSpace(_cypressTestSecret) || _isLiveEnvironment)
-            return false;
+            return true;
 
         var requestHeader = httpContextAccessor.HttpContext?.Request.Headers[HeaderNames.Authorization];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:28:13
             return false;
 
         var requestHeader = httpContextAccessor.HttpContext?.Request.Headers[HeaderNames.Authorization];
-        if (string.IsNullOrWhiteSpace(requestHeader))
+        if (!(string.IsNullOrWhiteSpace(requestHeader)))
             return false;
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:29:20
 
         var requestHeader = httpContextAccessor.HttpContext?.Request.Headers[HeaderNames.Authorization];
         if (string.IsNullOrWhiteSpace(requestHeader))
-            return false;
+            return true;
 
         var authHeader = requestHeader.Value.ToString().Replace("Bearer ", string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.ClientSecretHeaderValid_should_return_false_if_no_auth_header_provided

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:33:16
 
         var authHeader = requestHeader.Value.ToString().Replace("Bearer ", string.Empty);
 
-        return authHeader == _cypressTestSecret;
+        return authHeader != _cypressTestSecret;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:40:25
     {
         var identity = new ClaimsIdentity(new List<Claim>
         {
-            new("name", "Automation User - name"),
+            new("name", ""),
             new("preferred_username", "Automation User - email")
         });
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.SetupAutomationUser_sets_correct_claims

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:40:17
     {
         var identity = new ClaimsIdentity(new List<Claim>
         {
-            new("name", "Automation User - name"),
+            new("", "Automation User - name"),
             new("preferred_username", "Automation User - email")
         });
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.SetupAutomationUser_sets_correct_claims

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:41:39
         var identity = new ClaimsIdentity(new List<Claim>
         {
             new("name", "Automation User - name"),
-            new("preferred_username", "Automation User - email")
+            new("preferred_username", "")
         });
         var user = new ClaimsPrincipal(identity);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.SetupAutomationUser_sets_correct_claims

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Authorization/AutomationAuthorizationHandler.cs:41:17
         var identity = new ClaimsIdentity(new List<Claim>
         {
             new("name", "Automation User - name"),
-            new("preferred_username", "Automation User - email")
+            new("", "Automation User - email")
         });
         var user = new ClaimsPrincipal(identity);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.SetupAutomationUser_sets_correct_claims
