[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/CookiesHelper.cs:20:13
     /// <returns></returns>
     public static bool OptionalCookiesAreAccepted(HttpContext context, ITempDataDictionary tempData)
     {
-        if (tempData[DeleteCookieTempDataName] is not null)
+        if (tempData[DeleteCookieTempDataName] is null)
         {
             return false;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.OptionalCookiesAreAccepted_is_false_when_DeleteCookieTempData_exists; DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.OptionalCookiesAreAccepted_is_true_when_Accepted_cookie_exists; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value

[Killed] Logical mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/CookiesHelper.cs:25:16
             return false;
         }
 
-        return context.Request.Cookies.ContainsKey(FiatCookies.CookieConsent) &&
-               bool.Parse(context.Request.Cookies[FiatCookies.CookieConsent]!);
+        return context.Request.Cookies.ContainsKey(FiatCookies.CookieConsent) ||
+               bool.Parse(context.Request.Cookies[FiatCookies.CookieConsent]!);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.OptionalCookiesAreAccepted_is_false_when_neither_Cookie_or_TempData_exists; DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.OptionalCookiesAreAccepted_is_false_when_Rejected_cookie_exists; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/CookiesHelper.cs:31:16
 
     public static string ReturnPath(HttpContext context)
     {
-        return string.IsNullOrWhiteSpace(context.Request.Query[ReturnPathQuery])
-            ? context.Request.Path + context.Request.QueryString
-            : context.Request.Query[ReturnPathQuery].ToString();
+        return (false?context.Request.Path + context.Request.QueryString
+:context.Request.Query[ReturnPathQuery].ToString());
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.If_ReturnPath_does_not_exist_in_query_then_ReturnPath_function_always_returns_the_original_path_and_query

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/CookiesHelper.cs:31:16
 
     public static string ReturnPath(HttpContext context)
     {
-        return string.IsNullOrWhiteSpace(context.Request.Query[ReturnPathQuery])
-            ? context.Request.Path + context.Request.QueryString
-            : context.Request.Query[ReturnPathQuery].ToString();
+        return (true?context.Request.Path + context.Request.QueryString
+:context.Request.Query[ReturnPathQuery].ToString());
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.If_ReturnPath_Exists_in_query_then_ReturnPath_function_always_returns_it

[Killed] Logical mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/CookiesHelper.cs:38:16
 
     public static bool ShowCookieBanner(HttpContext context, ITempDataDictionary tempData)
     {
-        return !context.Request.Cookies.ContainsKey(FiatCookies.CookieConsent) &&
-               tempData[DeleteCookieTempDataName] is null;
+        return !context.Request.Cookies.ContainsKey(FiatCookies.CookieConsent) ||
+               tempData[DeleteCookieTempDataName] is null;
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.ShowCookieBanner_is_false_when_consent_cookie_exists_and_temp_data_does_not_exist; DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.ShowCookieBanner_is_false_when_consent_cookie_exists_and_temp_data_does_not_exist; DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.ShowCookieBanner_is_false_when_consent_cookie_does_not_exist_and_temp_data_exists

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/CookiesHelper.cs:38:16
 
     public static bool ShowCookieBanner(HttpContext context, ITempDataDictionary tempData)
     {
-        return !context.Request.Cookies.ContainsKey(FiatCookies.CookieConsent) &&
+        return context.Request.Cookies.ContainsKey(FiatCookies.CookieConsent) &&
                tempData[DeleteCookieTempDataName] is null;
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.ShowCookieBanner_is_false_when_consent_cookie_exists_and_temp_data_does_not_exist; DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.ShowCookieBanner_is_false_when_consent_cookie_exists_and_temp_data_does_not_exist; DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.ShowCookieBanner_is_true_when_consent_cookie_does_not_exist_and_temp_data_does_not_exist

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/CookiesHelper.cs:39:16
     public static bool ShowCookieBanner(HttpContext context, ITempDataDictionary tempData)
     {
         return !context.Request.Cookies.ContainsKey(FiatCookies.CookieConsent) &&
-               tempData[DeleteCookieTempDataName] is null;
+               tempData[DeleteCookieTempDataName] is not null;
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.ShowCookieBanner_is_true_when_consent_cookie_does_not_exist_and_temp_data_does_not_exist; DfE.FindInformationAcademiesTrusts.UnitTests.CookiesHelperTests.ShowCookieBanner_is_false_when_consent_cookie_does_not_exist_and_temp_data_exists
