[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/AgeRangeExtensions.cs:14:16
 
     public static string ToTabularDisplayString(this AgeRange ageRange)
     {
-        return $"{ageRange.Minimum}-{ageRange.Maximum}";
+        return $"";
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.AgeRangeExtensionsTests.ToTabularDisplayString_should_use_min_and_max; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.AgeRangeExtensionsTests.ToTabularDisplayString_should_use_min_and_max; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.AgeRangeExtensionsTests.ToTabularDisplayString_should_use_min_and_max

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/AgeRangeExtensions.cs:19:16
 
     public static string ToDataSortValue(this AgeRange? ageRange)
     {
-        return ageRange is null ? "-1" : $"{ageRange.Minimum:D2}{ageRange.Maximum:D2}";
+        return ageRange is not null ? "-1" : $"{ageRange.Minimum:D2}{ageRange.Maximum:D2}";
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.AgeRangeExtensionsTests.ToDataSortValue_should_use_min_and_max; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.AgeRangeExtensionsTests.ToDataSortValue_should_use_min_and_max; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.AgeRangeExtensionsTests.ToDataSortValue_should_use_min_and_max

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/AgeRangeExtensions.cs:19:16
 
     public static string ToDataSortValue(this AgeRange? ageRange)
     {
-        return ageRange is null ? "-1" : $"{ageRange.Minimum:D2}{ageRange.Maximum:D2}";
+        return (false?"-1" :$"{ageRange.Minimum:D2}{ageRange.Maximum:D2}");
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.AgeRangeExtensionsTests.ToDataSortValue_should_return_negative_1_when_null
