[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/BeforeOrAfterJoiningExtensions.cs:12:47
             return beforeOrAfterJoining switch
             {
                 BeforeOrAfterJoining.Before => "Before joining",
-                BeforeOrAfterJoining.After => "After joining",
+                BeforeOrAfterJoining.After => "",
                 _ => "Unknown"
             };
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.TagLabel_should_return_expected_label_for_BeforeOrAfterJoining; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.BeforeOrAfterJoiningExtensionsTests.ToDisplayString_ReturnsCorrectString_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync
