[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/CategoriesOfConcernExtensions.cs:8:5
 public static class CategoriesOfConcernExtensions
 {
     public static string ToDataSortValue(this CategoriesOfConcern rating)
-    {
-        return rating.ToDisplayString().ToLowerInvariant().Trim();
-    }
+    {}
 
     public static string ToDisplayString(this CategoriesOfConcern rating)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.CategoriesOfConcernExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.CategoriesOfConcernExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.CategoriesOfConcernExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/CategoriesOfConcernExtensions.cs:18:52
         {
             CategoriesOfConcern.NoConcerns => "None",
             CategoriesOfConcern.SpecialMeasures => "Special measures",
-            CategoriesOfConcern.SeriousWeakness => "Serious weakness",
+            CategoriesOfConcern.SeriousWeakness => "",
             CategoriesOfConcern.NoticeToImprove => "Notice to improve",
             CategoriesOfConcern.NotInspected => "Not yet inspected",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.CategoriesOfConcernExtensionsTests.ToDisplayString_ReturnsCorrectString_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.CategoriesOfConcernExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/CategoriesOfConcernExtensions.cs:19:52
             CategoriesOfConcern.NoConcerns => "None",
             CategoriesOfConcern.SpecialMeasures => "Special measures",
             CategoriesOfConcern.SeriousWeakness => "Serious weakness",
-            CategoriesOfConcern.NoticeToImprove => "Notice to improve",
+            CategoriesOfConcern.NoticeToImprove => "",
             CategoriesOfConcern.NotInspected => "Not yet inspected",
             CategoriesOfConcern.DoesNotApply => "Does not apply",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.CategoriesOfConcernExtensionsTests.ToDisplayString_ReturnsCorrectString_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.CategoriesOfConcernExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues
