[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/DateTimeExtensions.cs:10:13
     public static string ShowDateStringOrReplaceWithText(this DateTime? date,
         string replacementText = ViewConstants.NoDataText)
     {
-        if (date.HasValue)
+        if (!(date.HasValue))
         {
             return date.Value.ToString(StringFormatConstants.DisplayDateFormat);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.InspectionDateText_should_return_date_when_has_inspection; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ShowDateStringOrReplaceWithText_returns_NoData_WhenNull; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ShowDateStringOrReplaceWithText_ReturnsFormattedDate_WhenNotNull

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/DateTimeExtensions.cs:11:9
         string replacementText = ViewConstants.NoDataText)
     {
         if (date.HasValue)
-        {
-            return date.Value.ToString(StringFormatConstants.DisplayDateFormat);
-        }
+        {}
 
         return replacementText;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.InspectionDateText_should_return_date_when_has_inspection; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ShowDateStringOrReplaceWithText_ReturnsFormattedDate_WhenNotNull

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/DateTimeExtensions.cs:19:5
     }
 
     public static string ToDataSortValue(this DateTime date)
-    {
-        return date.ToString(StringFormatConstants.SortableDateFormat);
-    }
+    {}
 
     public static string ToDataSortValue(this DateTime? date)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ToDataSortValue_returns_numerical_representation_of_date; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ToDataSortValue_returns_numerical_representation_of_date; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ToDataSortValue_returns_numerical_representation_of_date

[Killed] Null coalescing mutation (remove left)
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/DateTimeExtensions.cs:25:16
 
     public static string ToDataSortValue(this DateTime? date)
     {
-        return date?.ToDataSortValue() ?? string.Empty;
+        return string.Empty;
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ToDataSortValue_nullable_returns_numerical_representation_of_date; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ToDataSortValue_nullable_returns_numerical_representation_of_date; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.DateTimeExtensionsTests.ToDataSortValue_nullable_returns_numerical_representation_of_date
