[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/EnvironmentExtensions.cs:10:5
     private const string TestEnvironmentName = "Test";
 
     public static bool IsLocalDevelopment(this IWebHostEnvironment env)
-    {
-        return env.IsEnvironment(LocalDevelopmentEnvironmentName);
-    }
+    {}
 
     public static bool IsContinuousIntegration(this IWebHostEnvironment env)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLocalDevelopment_should_return_true_when_given_local_development_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/EnvironmentExtensions.cs:15:5
     }
 
     public static bool IsContinuousIntegration(this IWebHostEnvironment env)
-    {
-        return env.IsEnvironment(ContinuousIntegrationEnvironmentName);
-    }
+    {}
 
     public static bool IsTest(this IWebHostEnvironment env)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsContinuousIntegration_should_return_true_when_given_CI_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/EnvironmentExtensions.cs:20:5
     }
 
     public static bool IsTest(this IWebHostEnvironment env)
-    {
-        return env.IsEnvironment(TestEnvironmentName);
-    }
+    {}
 
     public static bool IsLiveEnvironment(this IWebHostEnvironment env)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsTest_should_return_true_when_given_Test_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Authorization.AutomationAuthorizationHandlerTests.IsClientSecretHeaderValid_should_only_be_true_in_specified_environments

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/EnvironmentExtensions.cs:26:16
 
     public static bool IsLiveEnvironment(this IWebHostEnvironment env)
     {
-        return !env.IsLocalDevelopment() && !env.IsDevelopment() &&
-               !env.IsContinuousIntegration() && !env.IsTest();
+        return !env.IsLocalDevelopment() && !env.IsDevelopment() ||
+               !env.IsContinuousIntegration() && !env.IsTest();
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/EnvironmentExtensions.cs:26:16
 
     public static bool IsLiveEnvironment(this IWebHostEnvironment env)
     {
-        return !env.IsLocalDevelopment() && !env.IsDevelopment() &&
-               !env.IsContinuousIntegration() && !env.IsTest();
+        return !env.IsLocalDevelopment() && !env.IsDevelopment() &&
+               !env.IsContinuousIntegration() || !env.IsTest();
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/EnvironmentExtensions.cs:27:50
     public static bool IsLiveEnvironment(this IWebHostEnvironment env)
     {
         return !env.IsLocalDevelopment() && !env.IsDevelopment() &&
-               !env.IsContinuousIntegration() && !env.IsTest();
+               !env.IsContinuousIntegration() && env.IsTest();
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_default_To_true_when_given_production_or_unknown_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_default_To_true_when_given_production_or_unknown_environment

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/EnvironmentExtensions.cs:27:16
     public static bool IsLiveEnvironment(this IWebHostEnvironment env)
     {
         return !env.IsLocalDevelopment() && !env.IsDevelopment() &&
-               !env.IsContinuousIntegration() && !env.IsTest();
+               env.IsContinuousIntegration() && !env.IsTest();
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_return_false_when_given_specified_nonlive_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_default_To_true_when_given_production_or_unknown_environment; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.EnvironmentExtensionsTests.IsLiveEnvironment_should_default_To_true_when_given_production_or_unknown_environment
