[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/OfstedRatingScoreExtensions.cs:19:18
             OfstedRatingScore.SingleHeadlineGradeNotAvailable => 6,
             OfstedRatingScore.DoesNotApply => 7,
             OfstedRatingScore.NotInspected => 8,
-            _ => -1
+            _ => +1
         };
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDataSortValue_ReturnsUnknown_ForUndefinedEnumValue

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/OfstedRatingScoreExtensions.cs:29:59
         {
             (OfstedRatingScore.Outstanding, _) => "Outstanding",
             (OfstedRatingScore.Good, _) => "Good",
-            (OfstedRatingScore.RequiresImprovement, _) => "Requires improvement",
+            (OfstedRatingScore.RequiresImprovement, _) => "",
             (OfstedRatingScore.Inadequate, _) => "Inadequate",
             (OfstedRatingScore.InsufficientEvidence, _) => "Insufficient evidence",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/OfstedRatingScoreExtensions.cs:30:50
             (OfstedRatingScore.Outstanding, _) => "Outstanding",
             (OfstedRatingScore.Good, _) => "Good",
             (OfstedRatingScore.RequiresImprovement, _) => "Requires improvement",
-            (OfstedRatingScore.Inadequate, _) => "Inadequate",
+            (OfstedRatingScore.Inadequate, _) => "",
             (OfstedRatingScore.InsufficientEvidence, _) => "Insufficient evidence",
             (OfstedRatingScore.SingleHeadlineGradeNotAvailable, _) => "Not available",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/OfstedRatingScoreExtensions.cs:31:60
             (OfstedRatingScore.Good, _) => "Good",
             (OfstedRatingScore.RequiresImprovement, _) => "Requires improvement",
             (OfstedRatingScore.Inadequate, _) => "Inadequate",
-            (OfstedRatingScore.InsufficientEvidence, _) => "Insufficient evidence",
+            (OfstedRatingScore.InsufficientEvidence, _) => "",
             (OfstedRatingScore.SingleHeadlineGradeNotAvailable, _) => "Not available",
             (OfstedRatingScore.DoesNotApply, _) => "Does not apply",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/OfstedRatingScoreExtensions.cs:32:71
             (OfstedRatingScore.RequiresImprovement, _) => "Requires improvement",
             (OfstedRatingScore.Inadequate, _) => "Inadequate",
             (OfstedRatingScore.InsufficientEvidence, _) => "Insufficient evidence",
-            (OfstedRatingScore.SingleHeadlineGradeNotAvailable, _) => "Not available",
+            (OfstedRatingScore.SingleHeadlineGradeNotAvailable, _) => "",
             (OfstedRatingScore.DoesNotApply, _) => "Does not apply",
             (OfstedRatingScore.NotInspected, true) => "Not yet inspected",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/OfstedRatingScoreExtensions.cs:33:52
             (OfstedRatingScore.Inadequate, _) => "Inadequate",
             (OfstedRatingScore.InsufficientEvidence, _) => "Insufficient evidence",
             (OfstedRatingScore.SingleHeadlineGradeNotAvailable, _) => "Not available",
-            (OfstedRatingScore.DoesNotApply, _) => "Does not apply",
+            (OfstedRatingScore.DoesNotApply, _) => "",
             (OfstedRatingScore.NotInspected, true) => "Not yet inspected",
             (OfstedRatingScore.NotInspected, false) => "Not inspected",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.OfstedRatingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString
