[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/SafeguardingScoreExtensions.cs:8:5
 public static class SafeguardingScoreExtensions
 {
     public static string ToDataSortValue(this SafeguardingScore rating)
-    {
-        return rating.ToDisplayString().ToLowerInvariant().Trim();
-    }
+    {}
 
     public static string ToDisplayString(this SafeguardingScore score)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.SafeguardingScoreExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.SafeguardingScoreExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.SafeguardingScoreExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/SafeguardingScoreExtensions.cs:16:47
     {
         return score switch
         {
-            SafeguardingScore.NotInspected => "Not yet inspected",
+            SafeguardingScore.NotInspected => "",
             SafeguardingScore.Yes => "Yes",
             SafeguardingScore.No => "No",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.SafeguardingScoreExtensionsTests.ToDataSortValue_ReturnsCorrectValue_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.SafeguardingScoreExtensionsTests.ToDisplayString_ReturnsCorrectString_ForDefinedEnumValues; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync
