[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/SchoolCategoryExtensions.cs:12:39
         return type switch
         {
             SchoolCategory.LaMaintainedSchool => "School",
-            SchoolCategory.Academy => "Academy",
+            SchoolCategory.Academy => "",
             _ => throw new ArgumentOutOfRangeException(nameof(type), type, null)
         };
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuServiceNavTests.GetServiceNavLinks_should_set_hidden_text_to_school_type_on_contacts_page; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuServiceNavTests.GetServiceNavLinks_should_set_hidden_text_to_school_type_on_details_page; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.SchoolCategoryExtensionsTests.ToDisplayString_returns_expected_value
