[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/StringExtensions.cs:40:13
     {
         var textInfo = CultureInfo.CurrentCulture.TextInfo;
 
-        if (string.IsNullOrWhiteSpace(text)) return string.Empty;
+        if (!(string.IsNullOrWhiteSpace(text))) return string.Empty;
 
         return textInfo.ToTitleCase(textInfo.ToLower(text));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.StringExtensionsTest.ToTitleText_should_return_correct_string; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.StringExtensionsTest.ToTitleText_should_return_correct_string; DfE.FindInformationAcademiesTrusts.UnitTests.Extensions.StringExtensionsTest.ToTitleText_should_return_correct_string

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/StringExtensions.cs:47:16
 
     public static string DefaultIfNullOrWhiteSpace(this string? input, string defaultValue = ViewConstants.NoDataText)
     {
-        return string.IsNullOrWhiteSpace(input) ? defaultValue : input;
+        return (false?defaultValue :input);
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.DefaultIfNull_should_return_the_default_string_if_null

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Extensions/StringExtensions.cs:47:16
 
     public static string DefaultIfNullOrWhiteSpace(this string? input, string defaultValue = ViewConstants.NoDataText)
     {
-        return string.IsNullOrWhiteSpace(input) ? defaultValue : input;
+        return (true?defaultValue :input);
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.DefaultIfNull_should_return_the_string_if_not_null
