[Survived] Null coalescing mutation (remove right)
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/HttpContextUserDetailsProvider.cs:16:23
 {
     public (string Name, string Email) GetUserDetails()
     {
-        var context = httpContextAccessor.HttpContext ?? throw new InvalidOperationException();
+        var context = httpContextAccessor.HttpContext;
 
         var name = context.User.Claims.Single(c => c.Type == "name").Value;

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/HttpContextUserDetailsProvider.cs:18:52
     {
         var context = httpContextAccessor.HttpContext ?? throw new InvalidOperationException();
 
-        var name = context.User.Claims.Single(c => c.Type == "name").Value;
+        var name = context.User.Claims.Single(c => c.Type != "name").Value;
         var email = context.User.Claims.Single(c => c.Type == "preferred_username").Value;
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_set_name_from_user_claims; DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_set_name_from_user_claims; DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_set_name_from_user_claims

[Killed] Linq method mutation (Single() to SingleOrDefault())
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/HttpContextUserDetailsProvider.cs:18:20
     {
         var context = httpContextAccessor.HttpContext ?? throw new InvalidOperationException();
 
-        var name = context.User.Claims.Single(c => c.Type == "name").Value;
+        var name = context.User.Claims.SingleOrDefault(c => c.Type == "name").Value;
         var email = context.User.Claims.Single(c => c.Type == "preferred_username").Value;
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_throw_if_name_claim_is_missing; DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_throw_if_there_is_no_httpcontext

[Killed] Linq method mutation (Single() to SingleOrDefault())
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/HttpContextUserDetailsProvider.cs:19:21
         var context = httpContextAccessor.HttpContext ?? throw new InvalidOperationException();
 
         var name = context.User.Claims.Single(c => c.Type == "name").Value;
-        var email = context.User.Claims.Single(c => c.Type == "preferred_username").Value;
+        var email = context.User.Claims.SingleOrDefault(c => c.Type == "preferred_username").Value;
 
         var nameRegex = new Regex("^([^,]+), ([^,]+)$", RegexOptions.NonBacktracking);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_throw_if_preferred_username_claim_is_missing

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/HttpContextUserDetailsProvider.cs:19:53
         var context = httpContextAccessor.HttpContext ?? throw new InvalidOperationException();
 
         var name = context.User.Claims.Single(c => c.Type == "name").Value;
-        var email = context.User.Claims.Single(c => c.Type == "preferred_username").Value;
+        var email = context.User.Claims.Single(c => c.Type != "preferred_username").Value;
 
         var nameRegex = new Regex("^([^,]+), ([^,]+)$", RegexOptions.NonBacktracking);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_set_email_from_user_claims; DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_throw_if_preferred_username_claim_is_missing

[Killed] Negate expression
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/HttpContextUserDetailsProvider.cs:23:13
 
         var nameRegex = new Regex("^([^,]+), ([^,]+)$", RegexOptions.NonBacktracking);
 
-        if (nameRegex.IsMatch(name))
+        if (!(nameRegex.IsMatch(name)))
         {
             name = nameRegex.Replace(name, "$2 $1");
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_set_name_from_user_claims; DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_set_name_from_user_claims; DfE.FindInformationAcademiesTrusts.UnitTests.HttpContextUserDetailsProviderTests.GetUserDetails_should_set_name_from_user_claims
