[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:20:17
         set
         {
             // Sanitise to ensure malicious/bad urls can't be passed in and redirected to
-            if (string.IsNullOrWhiteSpace(value) || !Url.IsLocalUrl(value))
+            if (!(string.IsNullOrWhiteSpace(value) || !Url.IsLocalUrl(value)))
             {
                 // If it's not a valid local url it didn't come from us, treat it as incorrect and remove it
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.ReturnPath_should_default_to_home_when_set_to_invalid_value; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.ReturnPath_should_default_to_home_when_set_to_invalid_value; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.ReturnPath_should_default_to_home_when_set_to_invalid_value

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:20:53
         set
         {
             // Sanitise to ensure malicious/bad urls can't be passed in and redirected to
-            if (string.IsNullOrWhiteSpace(value) || !Url.IsLocalUrl(value))
+            if (string.IsNullOrWhiteSpace(value) || Url.IsLocalUrl(value))
             {
                 // If it's not a valid local url it didn't come from us, treat it as incorrect and remove it
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.ReturnPath_should_default_to_home_when_set_to_invalid_value; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.ReturnPath_should_default_to_home_when_set_to_invalid_value; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_redirects_to_return_url

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:26:13
                 _returnPath = "/";
             }
             else
-            {
-                _returnPath = value;
-            }
+            {}
         }
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_redirects_to_return_url; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_redirects_to_return_url; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_redirects_to_return_url

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:34:13
 
     public ActionResult OnGet()
     {
-        if (CookiesPreferencesHaveBeenSet())
+        if (!(CookiesPreferencesHaveBeenSet()))
         {
             Consent = CookiesHelper.OptionalCookiesAreAccepted(httpContextAccessor.HttpContext!, TempData);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:35:9
     public ActionResult OnGet()
     {
         if (CookiesPreferencesHaveBeenSet())
-        {
-            Consent = CookiesHelper.OptionalCookiesAreAccepted(httpContextAccessor.HttpContext!, TempData);
-        }
+        {}
 
         return Page();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:44:9
 
     public ActionResult OnPost()
     {
-        ApplyCookieConsent();
+        ;
 
         DisplayCookieChangedMessageOnCookiesPage = true;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:46:52
     {
         ApplyCookieConsent();
 
-        DisplayCookieChangedMessageOnCookiesPage = true;
+        DisplayCookieChangedMessageOnCookiesPage = false;
 
         return Page();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_DisplayCookieChangedMessageOnCookiesPage_should_always_be_true

[Killed] Null coalescing mutation (remove left)
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:55:30
     {
         ApplyCookieConsent();
 
-        return LocalRedirect(ReturnPath ?? "/");
+        return LocalRedirect("/");
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_redirects_to_return_url; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_redirects_to_return_url; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_redirects_to_return_url

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:55:44
     {
         ApplyCookieConsent();
 
-        return LocalRedirect(ReturnPath ?? "/");
+        return LocalRedirect(ReturnPath ?? "");
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_should_not_change_consent_when_it_is_provided; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_should_not_change_consent_when_it_is_provided; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_should_not_change_consent_when_it_is_provided

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:60:13
 
     private void ApplyCookieConsent()
     {
-        if (Consent.HasValue)
+        if (!(Consent.HasValue))
         {
             CookieOptions cookieOptions = new()
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_adds_consent_cookie_when_consent_is_given

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:63:84
         if (Consent.HasValue)
         {
             CookieOptions cookieOptions = new()
-                { Expires = DateTime.UtcNow.AddYears(1), Secure = true, HttpOnly = true };
+                { Expires = DateTime.UtcNow.AddYears(1), Secure = true, HttpOnly = false };
             httpContextAccessor.HttpContext!.Response.Cookies.Append(FiatCookies.CookieConsent,
                 Consent.Value.ToString(), cookieOptions);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_adds_consent_cookie_when_consent_is_given

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:63:67
         if (Consent.HasValue)
         {
             CookieOptions cookieOptions = new()
-                { Expires = DateTime.UtcNow.AddYears(1), Secure = true, HttpOnly = true };
+                { Expires = DateTime.UtcNow.AddYears(1), Secure = false, HttpOnly = true };
             httpContextAccessor.HttpContext!.Response.Cookies.Append(FiatCookies.CookieConsent,
                 Consent.Value.ToString(), cookieOptions);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_adds_consent_cookie_when_consent_is_given

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:64:13
         {
             CookieOptions cookieOptions = new()
                 { Expires = DateTime.UtcNow.AddYears(1), Secure = true, HttpOnly = true };
-            httpContextAccessor.HttpContext!.Response.Cookies.Append(FiatCookies.CookieConsent,
-                Consent.Value.ToString(), cookieOptions);
+            ;
             TempData[CookiesHelper.CookieChangedTempDataName] = true;
         }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_adds_consent_cookie_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_adds_consent_cookie_when_consent_is_given

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:66:65
                 { Expires = DateTime.UtcNow.AddYears(1), Secure = true, HttpOnly = true };
             httpContextAccessor.HttpContext!.Response.Cookies.Append(FiatCookies.CookieConsent,
                 Consent.Value.ToString(), cookieOptions);
-            TempData[CookiesHelper.CookieChangedTempDataName] = true;
+            TempData[CookiesHelper.CookieChangedTempDataName] = false;
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_sets_tempdata_cookie_changed_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_sets_tempdata_cookie_changed_when_consent_is_given; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_sets_tempdata_cookie_changed_when_consent_is_given

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:69:13
             TempData[CookiesHelper.CookieChangedTempDataName] = true;
         }
 
-        if (Consent is false)
+        if (Consent is not false)
         {
             DeleteAppInsightsCookies();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:69:24
             TempData[CookiesHelper.CookieChangedTempDataName] = true;
         }
 
-        if (Consent is false)
+        if (Consent is true)
         {
             DeleteAppInsightsCookies();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:71:13
 
         if (Consent is false)
         {
-            DeleteAppInsightsCookies();
+            ;
             DeleteGoogleAnalyticsCookies();
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_removes_optional_cookie_when_consent_is_false

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:72:13
         if (Consent is false)
         {
             DeleteAppInsightsCookies();
-            DeleteGoogleAnalyticsCookies();
+            ;
 
             TempData[CookiesHelper.DeleteCookieTempDataName] = true;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_removes_optional_cookie_when_consent_is_false

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:74:64
             DeleteAppInsightsCookies();
             DeleteGoogleAnalyticsCookies();
 
-            TempData[CookiesHelper.DeleteCookieTempDataName] = true;
+            TempData[CookiesHelper.DeleteCookieTempDataName] = false;
         }
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_sets_tempdata_cookie_deleted_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_sets_tempdata_cookie_deleted_when_consent_is_false

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:83:9
         var optionalCookiePrefixes = new[] { "ai_session", "ai_user", "ai_authUser" };
         var cookiesToDelete = GetMatchingCookies(optionalCookiePrefixes);
 
-        cookiesToDelete.ForEach(cookie => httpContextAccessor.HttpContext!.Response.Cookies.Delete(cookie));
+        ;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_removes_optional_cookie_when_consent_is_false

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:88:46
 
     private void DeleteGoogleAnalyticsCookies()
     {
-        var optionalCookiePrefixes = new[] { "_ga", "_gid" };
+        var optionalCookiePrefixes = new[] { "", "_gid" };
         var cookiesToDelete = GetMatchingCookies(optionalCookiePrefixes);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_does_not_remove_cookies_when_there_are_no_optional_cookies_to_remove

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:91:9
         var optionalCookiePrefixes = new[] { "_ga", "_gid" };
         var cookiesToDelete = GetMatchingCookies(optionalCookiePrefixes);
 
-        cookiesToDelete.ForEach(cookie =>
-        {
-            // Need to delete cookies that exists outside of our current host
-            // Can't delete cookies unless the domain is specified, by default it will be the current host
-            // Issue was it worked on localhost but not on dev, test or prod, because google analytics cookies are set on a different domain
-            httpContextAccessor.HttpContext!.Response.Cookies.Delete(cookie);
-            httpContextAccessor.HttpContext!.Response.Cookies.Delete(cookie,
-                new CookieOptions { Domain = ".education.gov.uk" });
-        });
+        ;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_removes_optional_cookie_when_consent_is_false

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:96:13
             // Need to delete cookies that exists outside of our current host
             // Can't delete cookies unless the domain is specified, by default it will be the current host
             // Issue was it worked on localhost but not on dev, test or prod, because google analytics cookies are set on a different domain
-            httpContextAccessor.HttpContext!.Response.Cookies.Delete(cookie);
+            ;
             httpContextAccessor.HttpContext!.Response.Cookies.Delete(cookie,
                 new CookieOptions { Domain = ".education.gov.uk" });
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPostFromBanner_removes_optional_cookie_when_consent_is_false

[Survived] Object initializer mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:98:17
             // Issue was it worked on localhost but not on dev, test or prod, because google analytics cookies are set on a different domain
             httpContextAccessor.HttpContext!.Response.Cookies.Delete(cookie);
             httpContextAccessor.HttpContext!.Response.Cookies.Delete(cookie,
-                new CookieOptions { Domain = ".education.gov.uk" });
+                new CookieOptions {});
         });
     }

[Killed] Linq method mutation (Any() to All())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:107:37
         var currentCookies = httpContextAccessor.HttpContext!.Request.Cookies.Keys;
 
         var cookiesToDelete = currentCookies
-            .Where(currentCookie => optionalCookiePrefixes.Any(prefix => currentCookie.StartsWith(prefix)))
+            .Where(currentCookie => optionalCookiePrefixes.All(prefix => currentCookie.StartsWith(prefix)))
             .ToList();
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnPost_removes_optional_cookie_when_consent_is_false

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Cookies.cshtml.cs:114:5
     }
 
     private bool CookiesPreferencesHaveBeenSet()
-    {
-        return httpContextAccessor.HttpContext!.Request.Cookies.ContainsKey(FiatCookies.CookieConsent);
-    }
+    {}
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.CookiesModelTests.OnGet_should_set_consent_to_current_cookie_value
