[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Error.cshtml.cs:13:13
 
     public void OnGet(string statusCode)
     {
-        if (statusCode == "404")
+        if (statusCode != "404")
         {
             Is404Result = true;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.ShowBreadcrumb_should_be_false_for; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.ShowBreadcrumb_should_be_false_for; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.Is404Result_should_be_true_if_404_Status_Code

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Error.cshtml.cs:13:27
 
     public void OnGet(string statusCode)
     {
-        if (statusCode == "404")
+        if (statusCode == "")
         {
             Is404Result = true;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.Is404Result_should_be_true_if_404_Status_Code; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.ShowBreadcrumb_should_be_true_for_404; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.OriginalPathAndQuery_should_be_set_when_404

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Error.cshtml.cs:15:27
     {
         if (statusCode == "404")
         {
-            Is404Result = true;
+            Is404Result = false;
 
             var notFoundData = httpContextAccessor.HttpContext!.Features.Get<IStatusCodeReExecuteFeature>();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.Is404Result_should_be_true_if_404_Status_Code; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.ShowBreadcrumb_should_be_true_for_404

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Error.cshtml.cs:18:17
             Is404Result = true;
 
             var notFoundData = httpContextAccessor.HttpContext!.Features.Get<IStatusCodeReExecuteFeature>();
-            if (notFoundData is not null)
+            if (notFoundData is null)
             {
                 OriginalPathAndQuery =
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.ErrorModelTests.OriginalPathAndQuery_should_be_set_when_404
