[Survived] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Index.cshtml.cs:9:28
 {
     public IndexModel()
     {
-        ShowHeaderSearch = false;
+        ShowHeaderSearch = true;
     }
 

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Index.cshtml.cs:12:44
         ShowHeaderSearch = false;
     }
 
-    public string PageSearchFormInputId => "home-search";
+    public string PageSearchFormInputId => "";
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.IndexModelTests.InputId_should_have_a_fixed_value
