[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/OtherServicesLinkBuilder.cs:35:16
 
     public string GetInformationAboutSchoolsListingLinkForTrust(string trustUid)
     {
-        return $"{GetInformationAboutSchoolsBaseUrl}/Groups/Group/Details/{trustUid}";
+        return $"";
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.GetInformationAboutSchoolsListingLink_should_return_url_containing_trust_uid

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/OtherServicesLinkBuilder.cs:40:16
 
     public string GetInformationAboutSchoolsListingLinkForSchool(string urn)
     {
-        return $"{GetInformationAboutSchoolsBaseUrl}/Establishments/Establishment/Details/{urn}";
+        return $"";
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.GetInformationAboutSchoolsListingLink_should_return_school_urn_in_link

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/OtherServicesLinkBuilder.cs:45:16
 
     public string? CompaniesHouseListingLink(string? companiesHouseNumber)
     {
-        return string.IsNullOrEmpty(companiesHouseNumber)
-            ? null
-            : $"{CompaniesHouseBaseUrl}/company/{companiesHouseNumber}";
+        return (true?null
+:$"{CompaniesHouseBaseUrl}/company/{companiesHouseNumber}");
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.CompaniesHouseListingLink_should_return_url_containing_CompaniesHouseNumber

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/OtherServicesLinkBuilder.cs:45:16
 
     public string? CompaniesHouseListingLink(string? companiesHouseNumber)
     {
-        return string.IsNullOrEmpty(companiesHouseNumber)
-            ? null
-            : $"{CompaniesHouseBaseUrl}/company/{companiesHouseNumber}";
+        return (false?null
+:$"{CompaniesHouseBaseUrl}/company/{companiesHouseNumber}");
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.CompaniesHouseListingLink_should_return_null_if_trust_has_no_CompaniesHouseNumber; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.CompaniesHouseListingLink_should_return_null_if_trust_has_no_CompaniesHouseNumber

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/OtherServicesLinkBuilder.cs:52:16
 
     public string? FinancialBenchmarkingInsightsToolListingLink(string? companiesHouseNumber)
     {
-        return string.IsNullOrEmpty(companiesHouseNumber)
-            ? null
-            : $"{FinancialBenchmarkingInsightsToolBaseUrl}/trust/{companiesHouseNumber}";
+        return (true?null
+:$"{FinancialBenchmarkingInsightsToolBaseUrl}/trust/{companiesHouseNumber}");
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.FinancialBenchmarkingInsightsToolListingLink_should_be_to_the_correct_link

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/OtherServicesLinkBuilder.cs:52:16
 
     public string? FinancialBenchmarkingInsightsToolListingLink(string? companiesHouseNumber)
     {
-        return string.IsNullOrEmpty(companiesHouseNumber)
-            ? null
-            : $"{FinancialBenchmarkingInsightsToolBaseUrl}/trust/{companiesHouseNumber}";
+        return (false?null
+:$"{FinancialBenchmarkingInsightsToolBaseUrl}/trust/{companiesHouseNumber}");
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.FinancialBenchmarkingInsightsToolListingLink_should_be_null_companies_house_is_null

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/OtherServicesLinkBuilder.cs:59:16
 
     public string FinancialBenchmarkingLinkForSchool(int urn)
     {
-        return $"{FinancialBenchmarkingInsightsToolBaseUrl}/school/{urn}/spending-and-costs";
+        return $"";
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.FinancialBenchmarkingLinkForSchool_should_be_to_the_correct_link

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/OtherServicesLinkBuilder.cs:67:47
         return trustType switch
         {
             TrustType.MultiAcademyTrust => $"{FindSchoolPerformanceDataBaseUrl}/multi-academy-trust/{uid}",
-            TrustType.SingleAcademyTrust when satAcademyUrn is not null =>
+            TrustType.SingleAcademyTrust when satAcademyUrn is null =>
                 $"{FindSchoolPerformanceDataBaseUrl}/school/{satAcademyUrn}",
             _ => null
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.FindSchoolPerformanceDataListingLink_should_be_to_a_school_page_if_single_academy_trust_with_academies; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.OtherServicesLinkBuilderTests.FindSchoolPerformanceDataListingLink_should_be_null_if_trust_is_single_academy_type_with_no_academies
