[Killed] Equality mutation
Pages/Schools/Contacts/ContactsAreaModel.cs:25:13
     {
         var pageResult = await base.OnGetAsync();
 
-        if (pageResult.GetType() == typeof(NotFoundResult)) return pageResult;
+        if (pageResult.GetType() != typeof(NotFoundResult)) return pageResult;
 
         var giasDataSource = await dataSourceService.GetAsync(Source.Gias);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_should_return_not_found_result_if_urn_is_not_provided; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_should_return_not_found_result_if_school_is_not_found

[Killed] String mutation
Pages/Schools/Contacts/ContactsAreaModel.cs:32:58
         DataSourcesPerPage =
         [
             new DataSourcePageListEntry(InSchoolModel.SubPageName(SchoolCategory),
-                [new DataSourceListEntry(giasDataSource, "Head teacher name")])
+                [new DataSourceListEntry(giasDataSource, "")])
         ];
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_sets_correct_data_source_list
