[Killed] Negate expression
Pages/Schools/Contacts/InSchool.cshtml.cs:48:13
     public override async Task<IActionResult> OnGetAsync()
     {
         var pageResult = await base.OnGetAsync();
-        if (pageResult is NotFoundResult) return pageResult;
+        if (!(pageResult is NotFoundResult)) return pageResult;
 
         HeadTeacher = await schoolContactsService.GetInSchoolContactsAsync(Urn);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_should_set_Headteacher_contact_details
