[Killed] String mutation
Pages/Schools/Overview/Details.cshtml.cs:26:50
     {
         return schoolCategory switch
         {
-            SchoolCategory.LaMaintainedSchool => "School details",
+            SchoolCategory.LaMaintainedSchool => "",
             SchoolCategory.Academy => "Academy details",
             _ => throw new ArgumentOutOfRangeException(nameof(schoolCategory))
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.OnGetAsync_should_configure_PageMetadata_SubPageName; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.SubPageName_should_include_school_type

[Killed] String mutation
Pages/Schools/Overview/Details.cshtml.cs:27:39
         return schoolCategory switch
         {
             SchoolCategory.LaMaintainedSchool => "School details",
-            SchoolCategory.Academy => "Academy details",
+            SchoolCategory.Academy => "",
             _ => throw new ArgumentOutOfRangeException(nameof(schoolCategory))
         };
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.OnGetAsync_should_configure_PageMetadata_SubPageName; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.SubPageName_should_include_school_type
