[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolAreaModel.cs:28:13
     {
         var schoolSummary = await schoolService.GetSchoolSummaryAsync(Urn);
 
-        if (schoolSummary == null)
+        if (schoolSummary != null)
         {
             return new NotFoundResult();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_should_configure_PageMetadata_SubPageName; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_if_school_is_an_academy_should_get_trust_summary; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_should_configure_PageMetadata_PageName

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolAreaModel.cs:29:9
         var schoolSummary = await schoolService.GetSchoolSummaryAsync(Urn);
 
         if (schoolSummary == null)
-        {
-            return new NotFoundResult();
-        }
+        {}
 
         if (schoolSummary.Category == SchoolCategory.Academy)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_should_return_not_found_result_if_urn_is_not_provided; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_should_return_not_found_result_if_school_is_not_found; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.OnGetAsync_should_return_not_found_result_if_school_is_not_found

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolAreaModel.cs:33:13
             return new NotFoundResult();
         }
 
-        if (schoolSummary.Category == SchoolCategory.Academy)
+        if (schoolSummary.Category != SchoolCategory.Academy)
         {
             TrustSummary = await trustService.GetTrustSummaryAsync(schoolSummary.Urn);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_if_school_is_not_an_academy_should_not_get_trust_summary; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_if_school_is_an_academy_should_get_trust_summary; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.OnGetAsync_if_school_is_an_academy_should_get_trust_summary

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolAreaModel.cs:34:9
         }
 
         if (schoolSummary.Category == SchoolCategory.Academy)
-        {
-            TrustSummary = await trustService.GetTrustSummaryAsync(schoolSummary.Urn);
-        }
+        {}
 
         SchoolSummary = schoolSummary;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Contacts.InSchoolModelTests.OnGetAsync_if_school_is_an_academy_should_get_trust_summary; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.Overview.DetailsModelTests.OnGetAsync_if_school_is_an_academy_should_get_trust_summary
