[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolNavMenu.cs:42:21
                     DetailsModel.SubPageName(activePage.SchoolCategory),
                     "/Schools/Overview/Details",
                     activePage,
-                    "overview-details-subnav"
+                    ""
                 )
             ],
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_return_expected_links_for_overview; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_return_expected_links_for_overview

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolNavMenu.cs:52:21
                     InSchoolModel.SubPageName(activePage.SchoolCategory),
                     "/Schools/Contacts/InSchool",
                     activePage,
-                    "contacts-in-this-school-subnav"
+                    ""
                 )
             ],
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_return_expected_links_for_contacts; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_return_expected_links_for_contacts

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolNavMenu.cs:55:88
                     "contacts-in-this-school-subnav"
                 )
             ],
-            _ => throw new ArgumentOutOfRangeException(nameof(activePage), activePage, "Page type is not supported.")
+            _ => throw new ArgumentOutOfRangeException(nameof(activePage), activePage, "")
         };
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_throw_if_page_not_supported

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolNavMenu.cs:67:13
             serviceName,
             linkDisplayText,
             aspPage,
-            testIdOverride ?? $"{serviceName}-{linkDisplayText}-subnav".Kebabify(),
+            $"{serviceName}-{linkDisplayText}-subnav".Kebabify(),
             new Dictionary<string, string> { { "urn", activePage.Urn.ToString() } }
         );
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_return_expected_links_for_contacts; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_return_expected_links_for_overview; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_return_expected_links_for_overview

[Killed] Collection initializer mutation
DfE.FindInformationAcademiesTrusts/Pages/Schools/SchoolNavMenu.cs:68:13
             linkDisplayText,
             aspPage,
             testIdOverride ?? $"{serviceName}-{linkDisplayText}-subnav".Kebabify(),
-            new Dictionary<string, string> { { "urn", activePage.Urn.ToString() } }
+            new Dictionary<string, string> {}
         );
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_set_route_data_to_urn; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Schools.SchoolNavMenu.SchoolNavMenuSubNavTests.GetSubNavLinks_should_set_route_data_to_urn
