[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:36:28
         _trustService = trustService;
         _searchService = searchService;
         _schoolService = schoolService;
-        ShowHeaderSearch = false;
+        ShowHeaderSearch = true;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.ShowHeaderSearch_should_be_false

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:46:13
 
     public async Task<IActionResult> OnGetAsync()
     {
-        if (!string.IsNullOrWhiteSpace(Id))
+        if (string.IsNullOrWhiteSpace(Id))
         {
             var redirectResult = await GetRedirectToSchoolOrTrustAsync();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:46:14
 
     public async Task<IActionResult> OnGetAsync()
     {
-        if (!string.IsNullOrWhiteSpace(Id))
+        if (!(Id.Trim()!=""))
         {
             var redirectResult = await GetRedirectToSchoolOrTrustAsync();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:49:17
         if (!string.IsNullOrWhiteSpace(Id))
         {
             var redirectResult = await GetRedirectToSchoolOrTrustAsync();
-            if (redirectResult is not null)
+            if (redirectResult is null)
             {
                 return redirectResult;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfSchoolSelected_ButSchoolSummaryIsNull_ShouldRedirectToSearchPage

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:50:13
         {
             var redirectResult = await GetRedirectToSchoolOrTrustAsync();
             if (redirectResult is not null)
-            {
-                return redirectResult;
-            }
+            {}
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:55:13
             }
         }
 
-        if (PageNumber <= 0)
+        if (!(PageNumber <= 0))
         {
             return NotFound();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.When_a_different_page_is_requested_return_a_different_page; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfPageNumber_IsLessThanOrEqualTo0_Should404; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfPageNumber_IsLessThanOrEqualTo0_Should404

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:55:13
             }
         }
 
-        if (PageNumber <= 0)
+        if (PageNumber > 0)
         {
             return NotFound();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.When_a_different_page_is_requested_return_a_different_page; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfPageNumber_IsLessThanOrEqualTo0_Should404; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfPageNumber_IsLessThanOrEqualTo0_Should404

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:56:9
         }
 
         if (PageNumber <= 0)
-        {
-            return NotFound();
-        }
+        {}
 
         var searchResults = await _searchService.GetSearchResultsForPageAsync(KeyWords, PageNumber);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfPageNumber_IsLessThanOrEqualTo0_Should404; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfPageNumber_IsLessThanOrEqualTo0_Should404

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:63:13
         var searchResults = await _searchService.GetSearchResultsForPageAsync(KeyWords, PageNumber);
 
         // if there are results but the entered page number is higher than there should be
-        if (searchResults.ResultsList.PageStatus.TotalResults > 0 && PageNumber > searchResults.ResultsList.PageStatus.TotalPages)
+        if (!(searchResults.ResultsList.PageStatus.TotalResults > 0 && PageNumber > searchResults.ResultsList.PageStatus.TotalPages))
         {
             return NotFound();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.When_a_different_page_is_requested_return_a_different_page; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfSchoolSelected_ButSchoolSummaryIsNull_ShouldRedirectToSearchPage; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_not_redirect_to_trust_overview_if_trustId_does_not_match_query

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:63:70
         var searchResults = await _searchService.GetSearchResultsForPageAsync(KeyWords, PageNumber);
 
         // if there are results but the entered page number is higher than there should be
-        if (searchResults.ResultsList.PageStatus.TotalResults > 0 && PageNumber > searchResults.ResultsList.PageStatus.TotalPages)
+        if (searchResults.ResultsList.PageStatus.TotalResults > 0 && PageNumber >= searchResults.ResultsList.PageStatus.TotalPages)
         {
             return NotFound();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.When_a_different_page_is_requested_return_a_different_page; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_not_redirect_to_trust_overview_if_trustId_does_not_match_query

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:64:9
 
         // if there are results but the entered page number is higher than there should be
         if (searchResults.ResultsList.PageStatus.TotalResults > 0 && PageNumber > searchResults.ResultsList.PageStatus.TotalPages)
-        {
-            return NotFound();
-        }
+        {}
 
         SearchResults = searchResults.ResultsList;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfPageNumber_IsGreaterThanNumberOfResultsPages_Should404

[Killed] Null coalescing mutation (remove left)
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:71:78
         SearchResults = searchResults.ResultsList;
         ResultCount = searchResults.ResultsOverview;
 
-        PaginationRouteData = new Dictionary<string, string> { { "Keywords", KeyWords ?? string.Empty } };
+        PaginationRouteData = new Dictionary<string, string> { { "Keywords", string.Empty } };
         return new PageResult();
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.When_a_different_page_is_requested_return_a_different_page; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_set_keywords

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:71:90
         SearchResults = searchResults.ResultsList;
         ResultCount = searchResults.ResultsOverview;
 
-        PaginationRouteData = new Dictionary<string, string> { { "Keywords", KeyWords ?? string.Empty } };
+        PaginationRouteData = new Dictionary<string, string> { { "Keywords", KeyWords ?? "Stryker was here!" } };
         return new PageResult();
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_return_no_results_page_if_no_keyword_given

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:77:13
 
     private async Task<IActionResult?> GetRedirectToSchoolOrTrustAsync()
     {
-        if (SearchResultType is ResultType.Trust)
+        if (!(SearchResultType is ResultType.Trust))
         {
             var trust = await _trustService.GetTrustSummaryAsync(Id);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:81:17
         {
             var trust = await _trustService.GetTrustSummaryAsync(Id);
 
-            if (trust != null && string.Equals(trust.Name, KeyWords, StringComparison.CurrentCultureIgnoreCase))
+            if (trust != null || string.Equals(trust.Name, KeyWords, StringComparison.CurrentCultureIgnoreCase))
             {
                 return RedirectToPage("/trusts/overview/trustdetails", new { Uid = Id });
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfTrustSelected_ButTrustSummaryIsNull_ShouldRedirectToSearchPage

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:81:17
         {
             var trust = await _trustService.GetTrustSummaryAsync(Id);
 
-            if (trust != null && string.Equals(trust.Name, KeyWords, StringComparison.CurrentCultureIgnoreCase))
+            if (trust == null && string.Equals(trust.Name, KeyWords, StringComparison.CurrentCultureIgnoreCase))
             {
                 return RedirectToPage("/trusts/overview/trustdetails", new { Uid = Id });
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfTrustSelected_ButTrustSummaryIsNull_ShouldRedirectToSearchPage

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:90:17
         if (SearchResultType is ResultType.School && int.TryParse(Id, out var schoolUrn))
         {
             var school = await _schoolService.GetSchoolSummaryAsync(schoolUrn);
-            if (school != null && string.Equals(school.Name, KeyWords, StringComparison.CurrentCultureIgnoreCase))
+            if (school == null && string.Equals(school.Name, KeyWords, StringComparison.CurrentCultureIgnoreCase))
             {
                 return RedirectToPage("/schools/overview/details", new { urn = schoolUrn });
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetAsync_should_redirect_to_overview_if_given_identifier_and_query_is_trust_name; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfSchoolSelected_ButSchoolSummaryIsNull_ShouldRedirectToSearchPage

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:90:17
         if (SearchResultType is ResultType.School && int.TryParse(Id, out var schoolUrn))
         {
             var school = await _schoolService.GetSchoolSummaryAsync(schoolUrn);
-            if (school != null && string.Equals(school.Name, KeyWords, StringComparison.CurrentCultureIgnoreCase))
+            if (school != null || string.Equals(school.Name, KeyWords, StringComparison.CurrentCultureIgnoreCase))
             {
                 return RedirectToPage("/schools/overview/details", new { urn = schoolUrn });
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.IfSchoolSelected_ButSchoolSummaryIsNull_ShouldRedirectToSearchPage

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:100:5
     }
 
     public async Task<IActionResult> OnGetPopulateAutocompleteAsync()
-    {
-        var result = (await _searchService.GetSearchResultsForAutocompleteAsync(KeyWords!))
-            .Select(result => new AutocompleteEntry(result.Id, result.Address, result.Name, result.ResultType));
-        
-        return new JsonResult(result);
-    }
+    {}
 
     public string Title
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetPopulateAutocompleteAsync_should_return_empty_json_when_no_matching_keyword; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetPopulateAutocompleteAsync_should_return_empty_json_when_no_matching_keyword; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.OnGetPopulateAutocompleteAsync_should_return_empty_json_when_no_matching_keyword

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:111:17
     {
         get
         {
-            if (string.IsNullOrWhiteSpace(KeyWords))
+            if (!(string.IsNullOrWhiteSpace(KeyWords)))
             {
                 return "Search";
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_When_they_Are_Set; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_And_Page_Number_When_They_Are_Set; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_When_they_Are_Set_And_There_Is_Only_one_page

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:116:17
                 return "Search";
             }
 
-            if (PageStatus.TotalPages > 1)
+            if (PageStatus.TotalPages < 1)
             {
                 return $"Search (page {PageStatus.PageIndex} of {PageStatus.TotalPages}) - {KeyWords}";
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_When_they_Are_Set; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_And_Page_Number_When_They_Are_Set

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:116:17
                 return "Search";
             }
 
-            if (PageStatus.TotalPages > 1)
+            if (PageStatus.TotalPages >= 1)
             {
                 return $"Search (page {PageStatus.PageIndex} of {PageStatus.TotalPages}) - {KeyWords}";
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_When_they_Are_Set_And_There_Is_Only_one_page

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:118:24
 
             if (PageStatus.TotalPages > 1)
             {
-                return $"Search (page {PageStatus.PageIndex} of {PageStatus.TotalPages}) - {KeyWords}";
+                return $"";
             }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_And_Page_Number_When_They_Are_Set

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/Pages/Search.cshtml.cs:121:20
                 return $"Search (page {PageStatus.PageIndex} of {PageStatus.TotalPages}) - {KeyWords}";
             }
 
-            return $"Search - {KeyWords}";
+            return $"";
         }
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_When_they_Are_Set; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.Title_Should_Include_The_Keywords_When_they_Are_Set_And_There_Is_Only_one_page
