[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Pages/Shared/BasePageModel.cs:8:51
 
 public abstract class BasePageModel : PageModel
 {
-    public bool ShowHeaderSearch { get; init; } = true;
+    public bool ShowHeaderSearch { get; init; } = false;
     [BindProperty(SupportsGet = true)] public string? KeyWords { get; set; } = string.Empty;
 }

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Shared/BasePageModel.cs:9:80
 public abstract class BasePageModel : PageModel
 {
     public bool ShowHeaderSearch { get; init; } = true;
-    [BindProperty(SupportsGet = true)] public string? KeyWords { get; set; } = string.Empty;
+    [BindProperty(SupportsGet = true)] public string? KeyWords { get; set; } = "Stryker was here!";
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.IndexModelTests.KeyWords_property_is_empty_by_default
