[Survived] Boolean mutation
DfE.FindInformationAcademiesTrusts/Pages/Shared/ContentPageModel.cs:5:48
 
 public class ContentPageModel : BasePageModel
 {
-    public bool ShowBreadcrumb { get; set; } = true;
+    public bool ShowBreadcrumb { get; set; } = false;
 }
 
