[Killed] Conditional (false) mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:9:38
 
 public record DataSourceListEntry(DataSourceServiceModel DataSource, string DataField = "All information was")
 {
-    public string LastUpdatedText => DataSource.LastUpdated is null
-        ? "Unknown"
-        : DataSource.LastUpdated.Value.ToString(StringFormatConstants.DisplayDateFormat);
+    public string LastUpdatedText => (false?"Unknown"
+:DataSource.LastUpdated.Value.ToString(StringFormatConstants.DisplayDateFormat));
 
     public string? UpdatedByText => DataSource.UpdatedBy == "TRAMs Migration"
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.InDfeModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.InTrustModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.LastUpdatedText_returns_unknown_when_LastUpdated_is_null

[Killed] Conditional (true) mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:9:38
 
 public record DataSourceListEntry(DataSourceServiceModel DataSource, string DataField = "All information was")
 {
-    public string LastUpdatedText => DataSource.LastUpdated is null
-        ? "Unknown"
-        : DataSource.LastUpdated.Value.ToString(StringFormatConstants.DisplayDateFormat);
+    public string LastUpdatedText => (true?"Unknown"
+:DataSource.LastUpdated.Value.ToString(StringFormatConstants.DisplayDateFormat));
 
     public string? UpdatedByText => DataSource.UpdatedBy == "TRAMs Migration"
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.LastUpdatedText_returns_correctString_when_LastUpdated_is_set

[Killed] Equality mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:13:37
         ? "Unknown"
         : DataSource.LastUpdated.Value.ToString(StringFormatConstants.DisplayDateFormat);
 
-    public string? UpdatedByText => DataSource.UpdatedBy == "TRAMs Migration"
+    public string? UpdatedByText => DataSource.UpdatedBy != "TRAMs Migration"
         ? "TRAMS Migration"
         : DataSource.UpdatedBy;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.UpdatedByText_returns_correctString_when_UpdatedBy_is_set; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.UpdatedByText_returns_null_when_UpdatedBy_is_null; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.UpdatedByText_returns_correctString_when_UpdatedBy_is_set_to_TRAMs_Migration

[Killed] Conditional (false) mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:13:37
         ? "Unknown"
         : DataSource.LastUpdated.Value.ToString(StringFormatConstants.DisplayDateFormat);
 
-    public string? UpdatedByText => DataSource.UpdatedBy == "TRAMs Migration"
-        ? "TRAMS Migration"
-        : DataSource.UpdatedBy;
+    public string? UpdatedByText => (false?"TRAMS Migration"
+:DataSource.UpdatedBy);
 
     public string Name => DataSource.Source switch
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.UpdatedByText_returns_correctString_when_UpdatedBy_is_set_to_TRAMs_Migration

[Killed] String mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:14:11
         : DataSource.LastUpdated.Value.ToString(StringFormatConstants.DisplayDateFormat);
 
     public string? UpdatedByText => DataSource.UpdatedBy == "TRAMs Migration"
-        ? "TRAMS Migration"
+        ? ""
         : DataSource.UpdatedBy;
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.UpdatedByText_returns_correctString_when_UpdatedBy_is_set_to_TRAMs_Migration

[Killed] String mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:20:24
     public string Name => DataSource.Source switch
     {
         Source.Gias => "Get information about schools",
-        Source.Mstr => "Get information about schools (internal use only, do not share outside of DfE)",
+        Source.Mstr => "",
         Source.Cdm => "RSD (Regional Services Division) service support team",
         Source.Mis => "State-funded school inspections and outcomes: management information",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.Name_should_return_the_correct_string_for_each_source

[Killed] String mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:22:23
         Source.Gias => "Get information about schools",
         Source.Mstr => "Get information about schools (internal use only, do not share outside of DfE)",
         Source.Cdm => "RSD (Regional Services Division) service support team",
-        Source.Mis => "State-funded school inspections and outcomes: management information",
+        Source.Mis => "",
         Source.ExploreEducationStatistics => "Explore education statistics",
         Source.FiatDb => "Find information about academies and trusts",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.Name_should_return_the_correct_string_for_each_source

[Survived] String mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:26:28
         Source.ExploreEducationStatistics => "Explore education statistics",
         Source.FiatDb => "Find information about academies and trusts",
         Source.Prepare => "Prepare",
-        Source.Complete => "Complete",
+        Source.Complete => "",
         Source.ManageFreeSchoolProjects => "Manage free school projects",
         _ => "Unknown"

[Survived] String mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:27:44
         Source.FiatDb => "Find information about academies and trusts",
         Source.Prepare => "Prepare",
         Source.Complete => "Complete",
-        Source.ManageFreeSchoolProjects => "Manage free school projects",
+        Source.ManageFreeSchoolProjects => "",
         _ => "Unknown"
     };

[Killed] String mutation
Pages/Shared/DataSource/DataSourceListEntry.cs:31:29
         _ => "Unknown"
     };
 
-    public string TestId => $"data-source-{DataSource.Source.ToString()}-{DataField}".Kebabify();
+    public string TestId => $"".Kebabify();
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.TestId_should_combine_source_and_data_field; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.TestId_should_combine_source_and_data_field; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.DataSource.DataSourceListEntryTest.TestId_should_combine_source_and_data_field
