[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Pages/Shared/PageMetadata.cs:14:101
     {
         get
         {
-            var orderedTitleParts = new[] { TabName, SubPageName, PageName, EntityName }.Where(s => s is not null);
+            var orderedTitleParts = new[] { TabName, SubPageName, PageName, EntityName }.Where(s => s is null);
             var browserTitle = string.Join(" - ", orderedTitleParts);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
DfE.FindInformationAcademiesTrusts/Pages/Shared/PageMetadata.cs:17:17
             var orderedTitleParts = new[] { TabName, SubPageName, PageName, EntityName }.Where(s => s is not null);
             var browserTitle = string.Join(" - ", orderedTitleParts);
 
-            if (!ModelStateIsValid)
+            if (ModelStateIsValid)
             {
                 browserTitle = $"Error: {browserTitle}";
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Shared/PageMetadata.cs:19:32
 
             if (!ModelStateIsValid)
             {
-                browserTitle = $"Error: {browserTitle}";
+                browserTitle = $"";
             }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Shared.PageMetadataTests.BrowserTitle_should_be_constructed_from_properties_and_modelstate
