[Killed] String mutation
Pages/Trusts/Academies/AcademiesAreaModel.cs:44:13
     public NavLink GetTabFor<T>(string subPageName, string linkDisplayText, string aspPage)
     {
         return new NavLink(this is T, "Academies", linkDisplayText, aspPage,
-            $"{subPageName}-{linkDisplayText}-tab".Kebabify(),
+            $"".Kebabify(),
             new Dictionary<string, string> { { "uid", Uid } });
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PreAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_should_populate_TabList_to_tabs

[Killed] String mutation
Pages/Trusts/Academies/AcademiesAreaModel.cs:45:48
     {
         return new NavLink(this is T, "Academies", linkDisplayText, aspPage,
             $"{subPageName}-{linkDisplayText}-tab".Kebabify(),
-            new Dictionary<string, string> { { "uid", Uid } });
+            new Dictionary<string, string> { { "", Uid } });
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_route_data_with_uid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_route_data_with_uid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_should_populate_TabList_route_data_with_uid
