[Killed] String mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:41:55
         TabList =
         [
             GetTabFor<AcademiesInTrustDetailsModel>(SubPageName, "Details", "./Details"),
-            GetTabFor<PupilNumbersModel>(SubPageName, "Pupil numbers", "./PupilNumbers"),
+            GetTabFor<PupilNumbersModel>(SubPageName, "", "./PupilNumbers"),
             GetTabFor<FreeSchoolMealsModel>(SubPageName, "Free school meals", "./FreeSchoolMeals")
         ];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.PupilNumbersModelTests.OnGetAsync_should_populate_TabList_to_tabs

[Killed] String mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:41:72
         TabList =
         [
             GetTabFor<AcademiesInTrustDetailsModel>(SubPageName, "Details", "./Details"),
-            GetTabFor<PupilNumbersModel>(SubPageName, "Pupil numbers", "./PupilNumbers"),
+            GetTabFor<PupilNumbersModel>(SubPageName, "Pupil numbers", ""),
             GetTabFor<FreeSchoolMealsModel>(SubPageName, "Free school meals", "./FreeSchoolMeals")
         ];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.PupilNumbersModelTests.OnGetAsync_should_set_active_TabList_to_current_tab

[Killed] String mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:42:79
         [
             GetTabFor<AcademiesInTrustDetailsModel>(SubPageName, "Details", "./Details"),
             GetTabFor<PupilNumbersModel>(SubPageName, "Pupil numbers", "./PupilNumbers"),
-            GetTabFor<FreeSchoolMealsModel>(SubPageName, "Free school meals", "./FreeSchoolMeals")
+            GetTabFor<FreeSchoolMealsModel>(SubPageName, "Free school meals", "")
         ];
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetAsync_should_set_active_TabList_to_current_tab

[Killed] String mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:42:58
         [
             GetTabFor<AcademiesInTrustDetailsModel>(SubPageName, "Details", "./Details"),
             GetTabFor<PupilNumbersModel>(SubPageName, "Pupil numbers", "./PupilNumbers"),
-            GetTabFor<FreeSchoolMealsModel>(SubPageName, "Free school meals", "./FreeSchoolMeals")
+            GetTabFor<FreeSchoolMealsModel>(SubPageName, "", "./FreeSchoolMeals")
         ];
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.PupilNumbersModelTests.OnGetAsync_should_populate_TabList_to_tabs

[Killed] Statement mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:45:9
             GetTabFor<FreeSchoolMealsModel>(SubPageName, "Free school meals", "./FreeSchoolMeals")
         ];
 
-        DataSourcesPerPage.AddRange([
-            new DataSourcePageListEntry(AcademiesInTrustDetailsModel.TabName,
-                [new DataSourceListEntry(giasDataSource)]),
-            new DataSourcePageListEntry(PupilNumbersModel.TabName, [new DataSourceListEntry(giasDataSource)]),
-            new DataSourcePageListEntry(FreeSchoolMealsModel.TabName, [
-                new DataSourceListEntry(giasDataSource, "Pupils eligible for free school meals"),
-                new DataSourceListEntry(eesDataSource, "Local authority average 2023/24"),
-                new DataSourceListEntry(eesDataSource, "National average 2023/24")
-            ])
-        ]);
+        ;
 
         return pageResult;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.PupilNumbersModelTests.OnGetAsync_sets_correct_data_source_list

[Killed] String mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:50:57
                 [new DataSourceListEntry(giasDataSource)]),
             new DataSourcePageListEntry(PupilNumbersModel.TabName, [new DataSourceListEntry(giasDataSource)]),
             new DataSourcePageListEntry(FreeSchoolMealsModel.TabName, [
-                new DataSourceListEntry(giasDataSource, "Pupils eligible for free school meals"),
+                new DataSourceListEntry(giasDataSource, ""),
                 new DataSourceListEntry(eesDataSource, "Local authority average 2023/24"),
                 new DataSourceListEntry(eesDataSource, "National average 2023/24")
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.PupilNumbersModelTests.OnGetAsync_sets_correct_data_source_list

[Killed] String mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:51:56
             new DataSourcePageListEntry(PupilNumbersModel.TabName, [new DataSourceListEntry(giasDataSource)]),
             new DataSourcePageListEntry(FreeSchoolMealsModel.TabName, [
                 new DataSourceListEntry(giasDataSource, "Pupils eligible for free school meals"),
-                new DataSourceListEntry(eesDataSource, "Local authority average 2023/24"),
+                new DataSourceListEntry(eesDataSource, ""),
                 new DataSourceListEntry(eesDataSource, "National average 2023/24")
             ])
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.PupilNumbersModelTests.OnGetAsync_sets_correct_data_source_list

[Killed] Equality mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:63:13
     {
         var trustSummary = await TrustService.GetTrustSummaryAsync(uid);
 
-        if (trustSummary == null)
+        if (trustSummary != null)
         {
             return new NotFoundResult();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetExportAsync_ShouldReturnFileResult_WhenUidIsValid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetExportAsync_ShouldReturnNotFound_WhenUidIsInvalid

[Killed] Block removal mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:64:9
         var trustSummary = await TrustService.GetTrustSummaryAsync(uid);
 
         if (trustSummary == null)
-        {
-            return new NotFoundResult();
-        }
+        {}
 
         // Sanitize the trust name to remove any illegal characters
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetExportAsync_ShouldReturnNotFound_WhenUidIsInvalid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetExportAsync_ShouldReturnNotFound_WhenUidIsInvalid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.PupilNumbersModelTests.OnGetExportAsync_ShouldReturnNotFound_WhenUidIsInvalid

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Trusts/Academies/InTrust/AcademiesInTrustAreaModel.cs:70:56
 
         // Sanitize the trust name to remove any illegal characters
         var sanitizedTrustName =
-            string.Concat(trustSummary.Name.Where(c => !Path.GetInvalidFileNameChars().Contains(c)));
+            string.Concat(trustSummary.Name.Where(c => Path.GetInvalidFileNameChars().Contains(c)));
 
         var fileContents = await academiesExportService.BuildAsync(uid);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.AcademiesDetailsModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.FreeSchoolMealsModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.InTrust.PupilNumbersModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters
