[Killed] String mutation
Trusts/Academies/Pipeline/PipelineAcademiesAreaModel.cs:39:17
         TabList =
         [
             GetTabFor<PreAdvisoryBoardModel>("Pipeline",
-                $"{PreAdvisoryBoardModel.TabName} ({PipelineSummary.PreAdvisoryCount})",
+                $"",
                 "./PreAdvisoryBoard"),
             GetTabFor<PostAdvisoryBoardModel>("Pipeline",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PreAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.FreeSchoolsModelTests.OnGetAsync_should_populate_TabList_to_tabs

[Killed] String mutation
Trusts/Academies/Pipeline/PipelineAcademiesAreaModel.cs:43:17
                 "./PreAdvisoryBoard"),
             GetTabFor<PostAdvisoryBoardModel>("Pipeline",
                 $"{PostAdvisoryBoardModel.TabName} ({PipelineSummary.PostAdvisoryCount})",
-                "./PostAdvisoryBoard"),
+                ""),
             GetTabFor<FreeSchoolsModel>("Pipeline", $"{FreeSchoolsModel.TabName} ({PipelineSummary.FreeSchoolsCount})",
                 "./FreeSchools")
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetAsync_should_set_active_TabList_to_current_tab; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PreAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_to_tabs

[Killed] String mutation
Trusts/Academies/Pipeline/PipelineAcademiesAreaModel.cs:44:41
             GetTabFor<PostAdvisoryBoardModel>("Pipeline",
                 $"{PostAdvisoryBoardModel.TabName} ({PipelineSummary.PostAdvisoryCount})",
                 "./PostAdvisoryBoard"),
-            GetTabFor<FreeSchoolsModel>("Pipeline", $"{FreeSchoolsModel.TabName} ({PipelineSummary.FreeSchoolsCount})",
+            GetTabFor<FreeSchoolsModel>("", $"{FreeSchoolsModel.TabName} ({PipelineSummary.FreeSchoolsCount})",
                 "./FreeSchools")
         ];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PreAdvisoryBoardModelTests.OnGetAsync_should_populate_TabList_to_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.FreeSchoolsModelTests.OnGetAsync_should_populate_TabList_to_tabs

[Killed] Statement mutation
Trusts/Academies/Pipeline/PipelineAcademiesAreaModel.cs:51:9
         var prepareSource = await DataSourceService.GetAsync(Source.Prepare);
         var completeSource = await DataSourceService.GetAsync(Source.Complete);
         var manageFreeSchoolSource = await DataSourceService.GetAsync(Source.ManageFreeSchoolProjects);
-        DataSourcesPerPage.AddRange([
-            new DataSourcePageListEntry(PreAdvisoryBoardModel.TabName, [new DataSourceListEntry(prepareSource)]),
-            new DataSourcePageListEntry(PostAdvisoryBoardModel.TabName, [new DataSourceListEntry(completeSource)]),
-            new DataSourcePageListEntry(FreeSchoolsModel.TabName, [new DataSourceListEntry(manageFreeSchoolSource)])
-        ]);
+        ;
 
         return pageResult;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PreAdvisoryBoardModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.FreeSchoolsModelTests.OnGetAsync_sets_correct_data_source_list

[Killed] String mutation
Trusts/Academies/Pipeline/PipelineAcademiesAreaModel.cs:74:24
             string.Concat(trustSummary.Name.Where(c => !Path.GetInvalidFileNameChars().Contains(c)));
 
         var fileContents = await pipelineAcademiesExportService.BuildAsync(uid);
-        var fileName = $"pipeline-{sanitizedTrustName}-{DateTimeProvider.Now:yyyy-MM-dd}.xlsx";
+        var fileName = $"";
         var contentType = "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet";
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PreAdvisoryBoardModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.FreeSchoolsModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters

[Killed] String mutation
Trusts/Academies/Pipeline/PipelineAcademiesAreaModel.cs:75:27
 
         var fileContents = await pipelineAcademiesExportService.BuildAsync(uid);
         var fileName = $"pipeline-{sanitizedTrustName}-{DateTimeProvider.Now:yyyy-MM-dd}.xlsx";
-        var contentType = "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet";
+        var contentType = "";
 
         return File(fileContents, contentType, fileName);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetExportAsync_ShouldReturnFileResult_WhenUidIsValid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PostAdvisoryBoardModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Academies.Pipeline.PreAdvisoryBoardModelTests.OnGetExportAsync_ShouldReturnFileResult_WhenUidIsValid
