[Killed] Statement mutation
Pages/Trusts/Contacts/ContactsAreaModel.cs:41:9
         var giasDataSource = await DataSourceService.GetAsync(Source.Gias);
         var mstrDataSource = await DataSourceService.GetAsync(Source.Mstr);
 
-        DataSourcesPerPage.AddRange([
-            new DataSourcePageListEntry(InDfeModel.SubPageName, [
-                    new DataSourceListEntry(new DataSourceServiceModel(Source.FiatDb,
-                            TrustRelationshipManager?.LastModifiedAtTime, null,
-                            TrustRelationshipManager?.LastModifiedByEmail),
-                        ContactRole.TrustRelationshipManager.MapRoleToViewString()),
-                    new DataSourceListEntry(new DataSourceServiceModel(Source.FiatDb, SfsoLead?.LastModifiedAtTime,
-                        null,
-                        SfsoLead?.LastModifiedByEmail), ContactRole.SfsoLead.MapRoleToViewString())
-                ]
-            ),
-            new DataSourcePageListEntry(InTrustModel.SubPageName, [
-                    new DataSourceListEntry(giasDataSource, "Accounting officer name"),
-                    new DataSourceListEntry(giasDataSource, "Chief financial officer name"),
-                    new DataSourceListEntry(giasDataSource, "Chair of trustees name"),
-                    new DataSourceListEntry(mstrDataSource, "Accounting officer email"),
-                    new DataSourceListEntry(mstrDataSource, "Chief financial officer email"),
-                    new DataSourceListEntry(mstrDataSource, "Chair of trustees email")
-                ]
-            )
-        ]);
+        ;
 
         return pageResult;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.InDfeModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.InDfeModelTests.OnGetAsync_sets__sfsoLead_last_modified_details_in_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.InDfeModelTests.OnGetAsync_sets_trustRelationshipManager_last_modified_details_in_data_source_list

[Killed] String mutation
Pages/Trusts/Contacts/ContactsAreaModel.cs:55:61
             new DataSourcePageListEntry(InTrustModel.SubPageName, [
                     new DataSourceListEntry(giasDataSource, "Accounting officer name"),
                     new DataSourceListEntry(giasDataSource, "Chief financial officer name"),
-                    new DataSourceListEntry(giasDataSource, "Chair of trustees name"),
+                    new DataSourceListEntry(giasDataSource, ""),
                     new DataSourceListEntry(mstrDataSource, "Accounting officer email"),
                     new DataSourceListEntry(mstrDataSource, "Chief financial officer email"),
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.InDfeModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.InTrustModelTests.OnGetAsync_sets_correct_data_source_list
