[Killed] String mutation
Pages/Trusts/Contacts/EditContactModel.cs:41:68
     [MaxLength(320)]
     public string? Email { get; set; }
 
-    [TempData] public string ContactUpdatedMessage { get; set; } = string.Empty;
+    [TempData] public string ContactUpdatedMessage { get; set; } = "Stryker was here!";
 
     protected abstract InternalContact? GetContactFromServiceModel(TrustContactsServiceModel contacts);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditTrustRelationshipManagerModelTests.OnPostAsync_sets_ContactUpdated_to_false_when_validation_is_incorrect; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditSfsoLeadModelTests.OnPostAsync_sets_ContactUpdated_to_false_when_validation_is_incorrect

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Pages/Trusts/Contacts/EditContactModel.cs:61:13
 
     public async Task<IActionResult> OnPostAsync()
     {
-        if (!ModelState.IsValid)
+        if (ModelState.IsValid)
         {
             return await base.OnGetAsync();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditTrustRelationshipManagerModelTests.OnPostAsync_sets_ContactUpdated_to_true_when_validation_is_correct; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditTrustRelationshipManagerModelTests.OnPostAsync_sets_ContactUpdated_to_true_when_validation_is_correct; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditTrustRelationshipManagerModelTests.OnPostAsync_sets_ContactUpdated_to_true_when_validation_is_correct

[Killed] Block removal mutation
Pages/Trusts/Contacts/EditContactModel.cs:62:9
     public async Task<IActionResult> OnPostAsync()
     {
         if (!ModelState.IsValid)
-        {
-            return await base.OnGetAsync();
-        }
+        {}
 
         var result = await TrustService.UpdateContactAsync(int.Parse(Uid), Name, Email, role);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditTrustRelationshipManagerModelTests.OnPostAsync_sets_ContactUpdated_to_false_when_validation_is_incorrect; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditTrustRelationshipManagerModelTests.OnPostAsync_should_configure_TrustPageMetadata_when_model_is_not_valid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditSfsoLeadModelTests.OnPostAsync_should_configure_TrustPageMetadata_when_model_is_not_valid

[Killed] String mutation
Pages/Trusts/Contacts/EditContactModel.cs:75:17
             { NameUpdated: true, EmailUpdated: false } =>
                 $"Changes made to the {role.MapRoleToViewString()} name were updated.",
             { NameUpdated: false, EmailUpdated: true } =>
-                $"Changes made to the {role.MapRoleToViewString()} email were updated.",
+                $"",
             { NameUpdated: false, EmailUpdated: false } => string.Empty,
             _ => throw new InvalidOperationException(nameof(result))
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditTrustRelationshipManagerModelTests.OnPostAsync_sets_ContactUpdated_to_true_when_validation_is_correct; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditSfsoLeadModelTests.OnPostAsync_sets_ContactUpdated_to_true_when_validation_is_correct

[Killed] Conditional (true) mutation
Pages/Trusts/Contacts/EditContactModel.cs:85:16
 
     public string GetErrorClass(string key)
     {
-        return ModelState.ContainsKey(key) && ModelState[key]!.Errors.Any() ? "govuk-form-group--error" : string.Empty;
+        return (true?"govuk-form-group--error" :string.Empty);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GetErrorClass_returns_empty_string_when_validation_is_correct; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GetErrorClass_returns_empty_string_when_validation_is_correct; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GetErrorClass_returns_empty_string_when_validation_is_correct

[Killed] Logical mutation
Pages/Trusts/Contacts/EditContactModel.cs:85:16
 
     public string GetErrorClass(string key)
     {
-        return ModelState.ContainsKey(key) && ModelState[key]!.Errors.Any() ? "govuk-form-group--error" : string.Empty;
+        return ModelState.ContainsKey(key) || ModelState[key]!.Errors.Any() ? "govuk-form-group--error" : string.Empty;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GetErrorClass_returns_empty_string_when_validation_is_correct; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GetErrorClass_returns_empty_string_when_validation_is_correct; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GetErrorClass_returns_empty_string_when_validation_is_correct

[Killed] Negate expression
Pages/Trusts/Contacts/EditContactModel.cs:95:13
 
     public (int index, string errorMessage)[] GetErrorList(string key)
     {
-        if (ModelState.ContainsKey(key))
+        if (!(ModelState.ContainsKey(key)))
         {
             return ModelState[key]!.Errors.Select((error, index) => (index, error.ErrorMessage)).ToArray();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GetErrorList_returns_the_correct_list_when_validation_is_incorrect; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GenerateErrorAriaDescribedBy_returns_the_correct_string_when_validation_is_incorrect; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GenerateErrorAriaDescribedBy_returns_empty_when_validation_is_correct

[Killed] Block removal mutation
Pages/Trusts/Contacts/EditContactModel.cs:96:9
     public (int index, string errorMessage)[] GetErrorList(string key)
     {
         if (ModelState.ContainsKey(key))
-        {
-            return ModelState[key]!.Errors.Select((error, index) => (index, error.ErrorMessage)).ToArray();
-        }
+        {}
 
         return [];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GetErrorList_returns_the_correct_list_when_validation_is_incorrect; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditContactModelTests.GenerateErrorAriaDescribedBy_returns_the_correct_string_when_validation_is_incorrect
