[Killed] Block removal mutation
Pages/Trusts/Contacts/EditSfsoLead.cshtml.cs:14:5
     : EditContactModel(dataSourceService, trustService, ContactRole.SfsoLead)
 {
     protected override InternalContact? GetContactFromServiceModel(TrustContactsServiceModel contacts)
-    {
-        return contacts.SfsoLead;
-    }
+    {}
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditSfsoLeadModelTests.OnGetAsync_loads_the_correct_name_and_email
