[Killed] Block removal mutation
Pages/Trusts/Contacts/EditTrustRelationshipManager.cshtml.cs:14:5
     : EditContactModel(dataSourceService, trustService, ContactRole.TrustRelationshipManager)
 {
     protected override InternalContact? GetContactFromServiceModel(TrustContactsServiceModel contacts)
-    {
-        return contacts.TrustRelationshipManager;
-    }
+    {}
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Contacts.EditTrustRelationshipManagerModelTests.OnGetAsync_loads_the_correct_name_and_email
