[Killed] Boolean mutation
Pages/Trusts/FinancialDocuments/FinancialDocumentsAreaModel.cs:20:44
 
     public override PageMetadata PageMetadata => base.PageMetadata with { PageName = PageName };
 
-    public virtual bool InternalUseOnly => true;
+    public virtual bool InternalUseOnly => false;
     protected abstract FinancialDocumentType FinancialDocumentType { get; }
     public abstract string FinancialDocumentDisplayName { get; }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.FinancialDocuments.InternalScrutinyReportsModelTests.InternalUseOnly_should_be_true; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.FinancialDocuments.ManagementLettersModelTests.InternalUseOnly_should_be_true; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.FinancialDocuments.SelfAssessmentChecklistsModelTests.InternalUseOnly_should_be_true

[Killed] Linq method mutation (OrderByDescending() to OrderBy())
Pages/Trusts/FinancialDocuments/FinancialDocumentsAreaModel.cs:28:38
     public FinancialDocumentServiceModel[] FinancialDocuments
     {
         get => _financialDocuments;
-        set => _financialDocuments = value.OrderByDescending(doc => doc.YearTo).ToArray();
+        set => _financialDocuments = value.OrderBy(doc => doc.YearTo).ToArray();
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.FinancialDocuments.InternalScrutinyReportsModelTests.OnGetAsync_sets_FinancialDocuments_in_descending_order_for_page; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.FinancialDocuments.ManagementLettersModelTests.OnGetAsync_sets_FinancialDocuments_in_descending_order_for_page; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.FinancialDocuments.SelfAssessmentChecklistsModelTests.OnGetAsync_sets_FinancialDocuments_in_descending_order_for_page
