[Killed] Boolean mutation
Pages/Trusts/FinancialDocuments/FinancialStatements.cshtml.cs:19:45
 
     public override PageMetadata PageMetadata => base.PageMetadata with { SubPageName = SubPageName };
 
-    public override bool InternalUseOnly => false;
+    public override bool InternalUseOnly => true;
     protected override FinancialDocumentType FinancialDocumentType => FinancialDocumentType.FinancialStatement;
     public override string FinancialDocumentDisplayName => "financial statement";
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.FinancialDocuments.FinancialStatementModelTests.InternalUseOnly_should_be_false
