[Killed] Statement mutation
Pages/Trusts/Governance/GovernanceAreaModel.cs:32:9
         // Add data sources
         var giasDataSource = await DataSourceService.GetAsync(Source.Gias);
 
-        DataSourcesPerPage.AddRange([
-            new DataSourcePageListEntry(TrustLeadershipModel.SubPageName, [new DataSourceListEntry(giasDataSource)]),
-            new DataSourcePageListEntry(TrusteesModel.SubPageName, [new DataSourceListEntry(giasDataSource)]),
-            new DataSourcePageListEntry(MembersModel.SubPageName, [new DataSourceListEntry(giasDataSource)]),
-            new DataSourcePageListEntry(HistoricMembersModel.SubPageName, [new DataSourceListEntry(giasDataSource)])
-        ]);
+        ;
 
         return pageResult;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Governance.TrusteesModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Governance.HistoricMembersModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Governance.TrustLeadershipModelTests.OnGetAsync_sets_correct_data_source_list
