[Killed] Statement mutation
Pages/Trusts/Ofsted/OfstedAreaModel.cs:41:9
         var giasDataSource = await DataSourceService.GetAsync(Source.Gias);
         var misDataSource = await DataSourceService.GetAsync(Source.Mis);
 
-        DataSourcesPerPage.AddRange([
-            new DataSourcePageListEntry(SingleHeadlineGradesModel.SubPageName, [
-                    new DataSourceListEntry(giasDataSource, "Date joined trust"),
-                    new DataSourceListEntry(misDataSource, "All single headline grades"),
-                    new DataSourceListEntry(misDataSource, "All inspection dates")
-                ]
-            ),
-            new DataSourcePageListEntry(CurrentRatingsModel.SubPageName, [
-                    new DataSourceListEntry(misDataSource, "Current Ofsted rating"),
-                    new DataSourceListEntry(misDataSource, "Date of current inspection")
-                ]
-            ),
-            new DataSourcePageListEntry(PreviousRatingsModel.SubPageName, [
-                    new DataSourceListEntry(misDataSource, "Previous Ofsted rating"),
-                    new DataSourceListEntry(misDataSource, "Date of previous inspection")
-                ]
-            ),
-            new DataSourcePageListEntry(SafeguardingAndConcernsModel.SubPageName, [
-                    new DataSourceListEntry(misDataSource, "Effective safeguarding"),
-                    new DataSourceListEntry(misDataSource, "Category of concern"),
-                    new DataSourceListEntry(misDataSource, "Date of current inspection")
-                ]
-            )
-        ]);
+        ;
 
         return pageResult;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradesModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SafeguardingAndConcernsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.PreviousRatingsModelTests.OnGetAsync_sets_correct_data_source_list

[Killed] String mutation
Pages/Trusts/Ofsted/OfstedAreaModel.cs:43:61
 
         DataSourcesPerPage.AddRange([
             new DataSourcePageListEntry(SingleHeadlineGradesModel.SubPageName, [
-                    new DataSourceListEntry(giasDataSource, "Date joined trust"),
+                    new DataSourceListEntry(giasDataSource, ""),
                     new DataSourceListEntry(misDataSource, "All single headline grades"),
                     new DataSourceListEntry(misDataSource, "All inspection dates")
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradesModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SafeguardingAndConcernsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.PreviousRatingsModelTests.OnGetAsync_sets_correct_data_source_list

[Killed] String mutation
Pages/Trusts/Ofsted/OfstedAreaModel.cs:54:60
                 ]
             ),
             new DataSourcePageListEntry(PreviousRatingsModel.SubPageName, [
-                    new DataSourceListEntry(misDataSource, "Previous Ofsted rating"),
+                    new DataSourceListEntry(misDataSource, ""),
                     new DataSourceListEntry(misDataSource, "Date of previous inspection")
                 ]
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SafeguardingAndConcernsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.PreviousRatingsModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.CurrentRatingsModelTests.OnGetAsync_sets_correct_data_source_list

[Killed] String mutation
Pages/Trusts/Ofsted/OfstedAreaModel.cs:83:24
             string.Concat(trustSummary.Name.Where(c => !Path.GetInvalidFileNameChars().Contains(c)));
 
         var fileContents = await ofstedDataExportService.BuildAsync(uid);
-        var fileName = $"Ofsted-{sanitizedTrustName}-{DateTimeProvider.Now:yyyy-MM-dd}.xlsx";
+        var fileName = $"";
         var contentType = "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet";
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradesModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SafeguardingAndConcernsModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.PreviousRatingsModelTests.OnGetExportAsync_ShouldSanitizeTrustName_WhenTrustNameContainsIllegalCharacters
