[Killed] Equality mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:12:34
     BeforeOrAfterJoining BeforeOrAfterJoining,
     bool IsCurrent)
 {
-    public bool HasInspection => SingleHeadlineGradeRating.OverallEffectiveness != OfstedRatingScore.NotInspected;
+    public bool HasInspection => SingleHeadlineGradeRating.OverallEffectiveness == OfstedRatingScore.NotInspected;
 
     public string TagLabel => BeforeOrAfterJoining.ToDisplayString();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.InspectionDateText_should_return_not_inspected_when_no_inspection; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.InspectionDateText_should_return_not_inspected_when_no_inspection; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.HasInspection_should_return_true_when_inspected

[Killed] Equality mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:16:36
 
     public string TagLabel => BeforeOrAfterJoining.ToDisplayString();
 
-    public bool IsBeforeJoining => BeforeOrAfterJoining == BeforeOrAfterJoining.Before;
+    public bool IsBeforeJoining => BeforeOrAfterJoining != BeforeOrAfterJoining.Before;
 
     public bool RatingShouldBeBold => SingleHeadlineGradeRating.OverallEffectiveness switch
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.IsBeforeJoining_should_return_expected_bool_for_BeforeOrAfterJoining; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.IsBeforeJoining_should_return_expected_bool_for_BeforeOrAfterJoining; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.IsBeforeJoining_should_return_expected_bool_for_BeforeOrAfterJoining

[Killed] Logical mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:20:9
 
     public bool RatingShouldBeBold => SingleHeadlineGradeRating.OverallEffectiveness switch
     {
-        OfstedRatingScore.Outstanding
-            or OfstedRatingScore.Good
-            or OfstedRatingScore.RequiresImprovement
+        OfstedRatingScore.Outstanding
+            or OfstedRatingScore.Good
+            and OfstedRatingScore.RequiresImprovement
             or OfstedRatingScore.Inadequate => true,
         _ => false
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_true_when_valid_shg; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_true_when_valid_shg; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_true_when_valid_shg

[Killed] Logical mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:20:9
 
     public bool RatingShouldBeBold => SingleHeadlineGradeRating.OverallEffectiveness switch
     {
-        OfstedRatingScore.Outstanding
-            or OfstedRatingScore.Good
+        OfstedRatingScore.Outstanding
+            and OfstedRatingScore.Good
             or OfstedRatingScore.RequiresImprovement
             or OfstedRatingScore.Inadequate => true,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_true_when_valid_shg; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_true_when_valid_shg

[Killed] Boolean mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:23:48
         OfstedRatingScore.Outstanding
             or OfstedRatingScore.Good
             or OfstedRatingScore.RequiresImprovement
-            or OfstedRatingScore.Inadequate => true,
+            or OfstedRatingScore.Inadequate => false,
         _ => false
     };
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_true_when_valid_shg; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_true_when_valid_shg; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_true_when_valid_shg

[Killed] Boolean mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:24:14
             or OfstedRatingScore.Good
             or OfstedRatingScore.RequiresImprovement
             or OfstedRatingScore.Inadequate => true,
-        _ => false
+        _ => true
     };
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_false_when_no_shg; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_false_when_no_shg; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.RatingShouldBeBold_should_return_false_when_no_shg

[Killed] Conditional (true) mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:27:41
         _ => false
     };
 
-    public string InspectionDateText => HasInspection
-        ? SingleHeadlineGradeRating.InspectionDate.ShowDateStringOrReplaceWithText()
-        : OfstedRatingScore.NotInspected.ToDisplayString(IsCurrent);
+    public string InspectionDateText => (true?SingleHeadlineGradeRating.InspectionDate.ShowDateStringOrReplaceWithText()
+:OfstedRatingScore.NotInspected.ToDisplayString(IsCurrent));
 
     public string InspectionDateSort =>
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.InspectionDateText_should_return_not_inspected_when_no_inspection; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.InspectionDateText_should_return_not_inspected_when_no_inspection

[Killed] Conditional (false) mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:27:41
         _ => false
     };
 
-    public string InspectionDateText => HasInspection
-        ? SingleHeadlineGradeRating.InspectionDate.ShowDateStringOrReplaceWithText()
-        : OfstedRatingScore.NotInspected.ToDisplayString(IsCurrent);
+    public string InspectionDateText => (false?SingleHeadlineGradeRating.InspectionDate.ShowDateStringOrReplaceWithText()
+:OfstedRatingScore.NotInspected.ToDisplayString(IsCurrent));
 
     public string InspectionDateSort =>
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.InspectionDateText_should_return_date_when_has_inspection

[Killed] Null coalescing mutation (remove left)
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:32:9
         : OfstedRatingScore.NotInspected.ToDisplayString(IsCurrent);
 
     public string InspectionDateSort =>
-        SingleHeadlineGradeRating.InspectionDate?.ToString(StringFormatConstants.SortableDateFormat)
-        ?? "0";
+        "0";
 
     public string DataTestIdPrefix => $"ofsted-single-headline-grades-{(IsCurrent ? "current" : "previous")}";
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.InspectionDateSort_should_return_date_when_has_inspection

[Killed] Conditional (false) mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:35:73
         SingleHeadlineGradeRating.InspectionDate?.ToString(StringFormatConstants.SortableDateFormat)
         ?? "0";
 
-    public string DataTestIdPrefix => $"ofsted-single-headline-grades-{(IsCurrent ? "current" : "previous")}";
+    public string DataTestIdPrefix => $"ofsted-single-headline-grades-{((false?"current" :"previous"))}";
 
     public string SingleHeadlineGradeText => SingleHeadlineGradeRating.OverallEffectiveness.ToDisplayString(IsCurrent);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.DataTestIdPrefix_should_contain_inspection_type

[Killed] Conditional (true) mutation
Pages/Trusts/Ofsted/_SingleHeadlineGradeCells.cshtml.cs:35:73
         SingleHeadlineGradeRating.InspectionDate?.ToString(StringFormatConstants.SortableDateFormat)
         ?? "0";
 
-    public string DataTestIdPrefix => $"ofsted-single-headline-grades-{(IsCurrent ? "current" : "previous")}";
+    public string DataTestIdPrefix => $"ofsted-single-headline-grades-{((true?"current" :"previous"))}";
 
     public string SingleHeadlineGradeText => SingleHeadlineGradeRating.OverallEffectiveness.ToDisplayString(IsCurrent);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Ofsted.SingleHeadlineGradeCellsModelTests.DataTestIdPrefix_should_contain_inspection_type
