[Killed] Statement mutation
Pages/Trusts/Overview/OverviewAreaModel.cs:31:9
 
         // Add data sources
         var giasDataSource = await DataSourceService.GetAsync(Source.Gias);
-        DataSourcesPerPage.AddRange([
-            new DataSourcePageListEntry(TrustDetailsModel.SubPageName, [new DataSourceListEntry(giasDataSource)]),
-            new DataSourcePageListEntry(TrustSummaryModel.SubPageName, [new DataSourceListEntry(giasDataSource)]),
-            new DataSourcePageListEntry(ReferenceNumbersModel.SubPageName, [new DataSourceListEntry(giasDataSource)])
-        ]);
+        ;
 
         return Page();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Overview.TrustSummaryModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Overview.ReferenceNumbersModelTests.OnGetAsync_sets_correct_data_source_list; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Overview.TrustDetailsModelTests.OnGetAsync_sets_correct_data_source_list
