[Killed] Linq method mutation (OrderByDescending() to OrderBy())
Pages/Trusts/Overview/TrustSummary.cshtml.cs:17:9
     public override PageMetadata PageMetadata => base.PageMetadata with { SubPageName = SubPageName };
 
     public IEnumerable<(string Authority, int Total)> AcademiesInEachLocalAuthority =>
-        TrustOverview.AcademiesByLocalAuthority
-            .OrderByDescending(kv => kv.Value)
+        TrustOverview.AcademiesByLocalAuthority
+            .OrderBy(kv => kv.Value)
             .ThenBy(kv => kv.Key)
             .Select(kv => (Authority: kv.Key, Total: kv.Value));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Overview.TrustSummaryModelTests.OnGetAsync_sets_list_of_local_authorities

[Killed] Linq method mutation (ThenBy() to ThenByDescending())
Pages/Trusts/Overview/TrustSummary.cshtml.cs:17:9
     public override PageMetadata PageMetadata => base.PageMetadata with { SubPageName = SubPageName };
 
     public IEnumerable<(string Authority, int Total)> AcademiesInEachLocalAuthority =>
-        TrustOverview.AcademiesByLocalAuthority
-            .OrderByDescending(kv => kv.Value)
-            .ThenBy(kv => kv.Key)
+        TrustOverview.AcademiesByLocalAuthority
+            .OrderByDescending(kv => kv.Value)
+            .ThenByDescending(kv => kv.Key)
             .Select(kv => (Authority: kv.Key, Total: kv.Value));
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.Overview.TrustSummaryModelTests.OnGetAsync_sets_list_of_local_authorities
