[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:22:80
         [
             GetServiceNavLinkTo<OverviewAreaModel>(OverviewAreaModel.PageName, "/Trusts/Overview/TrustDetails",
                 activePage),
-            GetServiceNavLinkTo<ContactsAreaModel>(ContactsAreaModel.PageName, "/Trusts/Contacts/InDfe", activePage),
+            GetServiceNavLinkTo<ContactsAreaModel>(ContactsAreaModel.PageName, "", activePage),
             GetServiceNavLinkTo<AcademiesAreaModel>(
                 $"{AcademiesAreaModel.PageName} ({activePage.TrustSummary.NumberOfAcademies})",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_set_active_page_link_when_on_any_subpage; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_set_active_page_link_when_on_any_subpage; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_return_expected_links

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:24:17
                 activePage),
             GetServiceNavLinkTo<ContactsAreaModel>(ContactsAreaModel.PageName, "/Trusts/Contacts/InDfe", activePage),
             GetServiceNavLinkTo<AcademiesAreaModel>(
-                $"{AcademiesAreaModel.PageName} ({activePage.TrustSummary.NumberOfAcademies})",
+                $"",
                 "/Trusts/Academies/InTrust/Details", activePage),
             GetServiceNavLinkTo<OfstedAreaModel>(OfstedAreaModel.PageName, "/Trusts/Ofsted/SingleHeadlineGrades",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_show_number_of_academies_in_display_text; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_show_number_of_academies_in_display_text; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_return_expected_links

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:30:84
                 activePage),
             GetServiceNavLinkTo<FinancialDocumentsAreaModel>(FinancialDocumentsAreaModel.PageName,
                 "/Trusts/FinancialDocuments/FinancialStatements", activePage),
-            GetServiceNavLinkTo<GovernanceAreaModel>(GovernanceAreaModel.PageName, "/Trusts/Governance/TrustLeadership",
+            GetServiceNavLinkTo<GovernanceAreaModel>(GovernanceAreaModel.PageName, "",
                 activePage)
         ];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_set_active_page_link_when_on_any_subpage; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_set_active_page_link_when_on_any_subpage; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_set_active_page_link_when_on_any_subpage

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:38:13
     private static NavLink GetServiceNavLinkTo<T>(string linkDisplayText, string aspPage, ITrustsAreaModel activePage)
     {
         return new NavLink(activePage is T,
-            "Trust",
+            "",
             linkDisplayText,
             aspPage,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_set_hidden_text_to_trust

[Killed] Collection initializer mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:42:13
             linkDisplayText,
             aspPage,
             $"{linkDisplayText}-nav".Kebabify(),
-            new Dictionary<string, string> { { "uid", activePage.Uid } });
+            new Dictionary<string, string> {});
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_set_route_data_to_uid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.ServiceNav.GetServiceNavLinks_should_set_route_data_to_uid

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:54:21
                 GetSubNavLinkTo<TrustDetailsModel>(OverviewAreaModel.PageName, TrustDetailsModel.SubPageName,
                     "/Trusts/Overview/TrustDetails", activePage),
                 GetSubNavLinkTo<TrustSummaryModel>(OverviewAreaModel.PageName, TrustSummaryModel.SubPageName,
-                    "/Trusts/Overview/TrustSummary", activePage),
+                    "", activePage),
                 GetSubNavLinkTo<ReferenceNumbersModel>(OverviewAreaModel.PageName, ReferenceNumbersModel.SubPageName,
                     "/Trusts/Overview/ReferenceNumbers", activePage)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_overview

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:56:21
                 GetSubNavLinkTo<TrustSummaryModel>(OverviewAreaModel.PageName, TrustSummaryModel.SubPageName,
                     "/Trusts/Overview/TrustSummary", activePage),
                 GetSubNavLinkTo<ReferenceNumbersModel>(OverviewAreaModel.PageName, ReferenceNumbersModel.SubPageName,
-                    "/Trusts/Overview/ReferenceNumbers", activePage)
+                    "", activePage)
             ],
             ContactsAreaModel =>
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_overview

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:61:21
             ContactsAreaModel =>
             [
                 GetSubNavLinkTo<InDfeModel>(ContactsAreaModel.PageName, InDfeModel.SubPageName,
-                    "/Trusts/Contacts/InDfE", activePage),
+                    "", activePage),
                 GetSubNavLinkTo<InTrustModel>(ContactsAreaModel.PageName, InTrustModel.SubPageName,
                     "/Trusts/Contacts/InTrust", activePage)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_contacts; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:63:21
                 GetSubNavLinkTo<InDfeModel>(ContactsAreaModel.PageName, InDfeModel.SubPageName,
                     "/Trusts/Contacts/InDfE", activePage),
                 GetSubNavLinkTo<InTrustModel>(ContactsAreaModel.PageName, InTrustModel.SubPageName,
-                    "/Trusts/Contacts/InTrust", activePage)
+                    "", activePage)
             ],
             AcademiesAreaModel academiesAreaModel =>
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_contacts; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:69:21
             [
                 GetSubNavLinkTo<AcademiesInTrustAreaModel>(AcademiesAreaModel.PageName,
                     $"{AcademiesInTrustAreaModel.SubPageName} ({academiesAreaModel.TrustSummary.NumberOfAcademies})",
-                    "/Trusts/Academies/InTrust/Details", activePage),
+                    "", activePage),
                 GetSubNavLinkTo<PipelineAcademiesAreaModel>(AcademiesAreaModel.PageName,
                     $"{PipelineAcademiesAreaModel.SubPageName} ({academiesAreaModel.PipelineSummary.Total})",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:81:21
                 GetSubNavLinkTo<CurrentRatingsModel>(OfstedAreaModel.PageName, CurrentRatingsModel.SubPageName,
                     "/Trusts/Ofsted/CurrentRatings", activePage),
                 GetSubNavLinkTo<PreviousRatingsModel>(OfstedAreaModel.PageName, PreviousRatingsModel.SubPageName,
-                    "/Trusts/Ofsted/PreviousRatings", activePage),
+                    "", activePage),
                 GetSubNavLinkTo<SafeguardingAndConcernsModel>(OfstedAreaModel.PageName,
                     SafeguardingAndConcernsModel.SubPageName, "/Trusts/Ofsted/SafeguardingAndConcerns", activePage)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_ofsted

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:88:59
             FinancialDocumentsAreaModel =>
             [
                 GetSubNavLinkTo<FinancialStatementsModel>(FinancialDocumentsAreaModel.PageName,
-                    FinancialStatementsModel.SubPageName, "/Trusts/FinancialDocuments/FinancialStatements", activePage),
+                    FinancialStatementsModel.SubPageName, "", activePage),
                 GetSubNavLinkTo<ManagementLettersModel>(FinancialDocumentsAreaModel.PageName,
                     ManagementLettersModel.SubPageName, "/Trusts/FinancialDocuments/ManagementLetters", activePage),
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_financial_documents

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:90:57
                 GetSubNavLinkTo<FinancialStatementsModel>(FinancialDocumentsAreaModel.PageName,
                     FinancialStatementsModel.SubPageName, "/Trusts/FinancialDocuments/FinancialStatements", activePage),
                 GetSubNavLinkTo<ManagementLettersModel>(FinancialDocumentsAreaModel.PageName,
-                    ManagementLettersModel.SubPageName, "/Trusts/FinancialDocuments/ManagementLetters", activePage),
+                    ManagementLettersModel.SubPageName, "", activePage),
                 GetSubNavLinkTo<InternalScrutinyReportsModel>(FinancialDocumentsAreaModel.PageName,
                     InternalScrutinyReportsModel.SubPageName, "/Trusts/FinancialDocuments/InternalScrutinyReports",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_financial_documents

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:92:63
                 GetSubNavLinkTo<ManagementLettersModel>(FinancialDocumentsAreaModel.PageName,
                     ManagementLettersModel.SubPageName, "/Trusts/FinancialDocuments/ManagementLetters", activePage),
                 GetSubNavLinkTo<InternalScrutinyReportsModel>(FinancialDocumentsAreaModel.PageName,
-                    InternalScrutinyReportsModel.SubPageName, "/Trusts/FinancialDocuments/InternalScrutinyReports",
+                    InternalScrutinyReportsModel.SubPageName, "",
                     activePage),
                 GetSubNavLinkTo<SelfAssessmentChecklistsModel>(FinancialDocumentsAreaModel.PageName,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_active_sub_page_link; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_financial_documents

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:102:21
             [
                 GetSubNavLinkTo<TrustLeadershipModel>(GovernanceAreaModel.PageName,
                     $"{TrustLeadershipModel.SubPageName} ({governanceAreaModel.TrustGovernance.CurrentTrustLeadership.Length})",
-                    "/Trusts/Governance/TrustLeadership", activePage),
+                    "", activePage),
                 GetSubNavLinkTo<TrusteesModel>(GovernanceAreaModel.PageName,
                     $"{TrusteesModel.SubPageName} ({governanceAreaModel.TrustGovernance.CurrentTrustees.Length})",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:107:21
                     $"{TrusteesModel.SubPageName} ({governanceAreaModel.TrustGovernance.CurrentTrustees.Length})",
                     "/Trusts/Governance/Trustees", activePage),
                 GetSubNavLinkTo<MembersModel>(GovernanceAreaModel.PageName,
-                    $"{MembersModel.SubPageName} ({governanceAreaModel.TrustGovernance.CurrentMembers.Length})",
+                    $"",
                     "/Trusts/Governance/Members", activePage),
                 GetSubNavLinkTo<HistoricMembersModel>(GovernanceAreaModel.PageName,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:108:21
                     "/Trusts/Governance/Trustees", activePage),
                 GetSubNavLinkTo<MembersModel>(GovernanceAreaModel.PageName,
                     $"{MembersModel.SubPageName} ({governanceAreaModel.TrustGovernance.CurrentMembers.Length})",
-                    "/Trusts/Governance/Members", activePage),
+                    "", activePage),
                 GetSubNavLinkTo<HistoricMembersModel>(GovernanceAreaModel.PageName,
                     $"{HistoricMembersModel.SubPageName} ({governanceAreaModel.TrustGovernance.HistoricMembers.Length})",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:125:13
             serviceName,
             linkDisplayText,
             aspPage,
-            $"{serviceName}-{linkDisplayText}-subnav".Kebabify(),
+            $"".Kebabify(),
             new Dictionary<string, string> { { "uid", activePage.Uid } }
         );
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_governance

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustNavMenu.cs:126:48
             linkDisplayText,
             aspPage,
             $"{serviceName}-{linkDisplayText}-subnav".Kebabify(),
-            new Dictionary<string, string> { { "uid", activePage.Uid } }
+            new Dictionary<string, string> { { "", activePage.Uid } }
         );
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_route_data_to_uid; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_set_route_data_to_uid
