[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Pages/Trusts/TrustsAreaModel.cs:17:74
     protected readonly IDataSourceService DataSourceService = dataSourceService;
     protected readonly ITrustService TrustService = trustService;
 
-    [BindProperty(SupportsGet = true)] public string Uid { get; set; } = "";
+    [BindProperty(SupportsGet = true)] public string Uid { get; set; } = "Stryker was here!";
     public TrustSummaryServiceModel TrustSummary { get; set; } = default!;
     public List<DataSourcePageListEntry> DataSourcesPerPage { get; set; } = [];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustsAreaModelTests.GroupUid_should_be_empty_string_by_default
