[Killed] Block removal mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/ResponseHeadersMiddleware.cs:8:5
     private readonly RequestDelegate _next;
 
     public ResponseHeadersMiddleware(RequestDelegate next)
-    {
-        _next = next;
-    }
+    {}
 
     public Task Invoke(HttpContext context)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.ResponseHeadersMiddlewareTests.Invoke_should_set_XRobotTag_header_to_noindex_nofollow; DfE.FindInformationAcademiesTrusts.UnitTests.ResponseHeadersMiddlewareTests.Invoke_should_return_next_delegate; DfE.FindInformationAcademiesTrusts.UnitTests.ResponseHeadersMiddlewareTests.Invoke_should_not_override_existing_headers

[Killed] Statement mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/ResponseHeadersMiddleware.cs:14:9
 
     public Task Invoke(HttpContext context)
     {
-        SetHeaderIfEmpty(context, "X-Robots-Tag", "noindex, nofollow");
+        ;
         return _next(context);
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.ResponseHeadersMiddlewareTests.Invoke_should_set_XRobotTag_header_to_noindex_nofollow

[Killed] String mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/ResponseHeadersMiddleware.cs:14:51
 
     public Task Invoke(HttpContext context)
     {
-        SetHeaderIfEmpty(context, "X-Robots-Tag", "noindex, nofollow");
+        SetHeaderIfEmpty(context, "X-Robots-Tag", "");
         return _next(context);
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.ResponseHeadersMiddlewareTests.Invoke_should_set_XRobotTag_header_to_noindex_nofollow

[Killed] Negate expression
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts/ResponseHeadersMiddleware.cs:20:13
 
     private static void SetHeaderIfEmpty(HttpContext context, string headerName, string value)
     {
-        if (context.Response.Headers.ContainsKey(headerName))
+        if (!(context.Response.Headers.ContainsKey(headerName)))
         {
             return;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.ResponseHeadersMiddlewareTests.Invoke_should_set_XRobotTag_header_to_noindex_nofollow; DfE.FindInformationAcademiesTrusts.UnitTests.ResponseHeadersMiddlewareTests.Invoke_should_not_override_existing_headers
