[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:18:17
     {
         get
         {
-            if (CurrentOfstedRating.InspectionDate is null)
+            if (CurrentOfstedRating.InspectionDate is not null)
             {
                 return BeforeOrAfterJoining.NotYetInspected;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:19:13
         get
         {
             if (CurrentOfstedRating.InspectionDate is null)
-            {
-                return BeforeOrAfterJoining.NotYetInspected;
-            }
+            {}
 
             if (CurrentOfstedRating.InspectionDate >= DateAcademyJoinedTrust)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidCurrentInspectionHappen_should_be_NotYetInspected_when_CurrentInspectionDate_is_null

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:23:17
                 return BeforeOrAfterJoining.NotYetInspected;
             }
 
-            if (CurrentOfstedRating.InspectionDate >= DateAcademyJoinedTrust)
+            if (CurrentOfstedRating.InspectionDate < DateAcademyJoinedTrust)
             {
                 return BeforeOrAfterJoining.After;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidCurrentInspectionHappen_should_be_After_when_CurrentInspectionDate_is_EqualTo_joining_date

[Killed] Negate expression
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:23:17
                 return BeforeOrAfterJoining.NotYetInspected;
             }
 
-            if (CurrentOfstedRating.InspectionDate >= DateAcademyJoinedTrust)
+            if (!(CurrentOfstedRating.InspectionDate >= DateAcademyJoinedTrust))
             {
                 return BeforeOrAfterJoining.After;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidCurrentInspectionHappen_should_be_After_when_CurrentInspectionDate_is_EqualTo_joining_date

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:24:13
             }
 
             if (CurrentOfstedRating.InspectionDate >= DateAcademyJoinedTrust)
-            {
-                return BeforeOrAfterJoining.After;
-            }
+            {}
 
             // Must be CurrentOfstedRating.InspectionDate < DateAcademyJoinedTrust by process of elimination 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidCurrentInspectionHappen_should_be_After_when_CurrentInspectionDate_is_EqualTo_joining_date

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:38:17
     {
         get
         {
-            if (PreviousOfstedRating.InspectionDate is null)
+            if (PreviousOfstedRating.InspectionDate is not null)
             {
                 return BeforeOrAfterJoining.NotYetInspected;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:39:13
         get
         {
             if (PreviousOfstedRating.InspectionDate is null)
-            {
-                return BeforeOrAfterJoining.NotYetInspected;
-            }
+            {}
 
             if (PreviousOfstedRating.InspectionDate >= DateAcademyJoinedTrust)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidPreviousInspectionHappen_should_be_NotYetInspected_when_PreviousInspectionDate_is_null

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:43:17
                 return BeforeOrAfterJoining.NotYetInspected;
             }
 
-            if (PreviousOfstedRating.InspectionDate >= DateAcademyJoinedTrust)
+            if (PreviousOfstedRating.InspectionDate > DateAcademyJoinedTrust)
             {
                 return BeforeOrAfterJoining.After;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidPreviousInspectionHappen_should_be_After_when_PreviousInspectionDate_is_EqualTo_joining_date

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:43:17
                 return BeforeOrAfterJoining.NotYetInspected;
             }
 
-            if (PreviousOfstedRating.InspectionDate >= DateAcademyJoinedTrust)
+            if (PreviousOfstedRating.InspectionDate < DateAcademyJoinedTrust)
             {
                 return BeforeOrAfterJoining.After;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidPreviousInspectionHappen_should_be_Before_when_PreviousInspectionDate_is_Before_joining_date

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyOfstedServiceModel.cs:44:13
             }
 
             if (PreviousOfstedRating.InspectionDate >= DateAcademyJoinedTrust)
-            {
-                return BeforeOrAfterJoining.After;
-            }
+            {}
 
             // Must be PreviousOfstedRating.InspectionDate < DateAcademyJoinedTrust by process of elimination 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidPreviousInspectionHappen_should_be_After_when_PreviousInspectionDate_is_After_joining_date; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyOfstedServiceModelTests.WhenDidPreviousInspectionHappen_should_be_After_when_PreviousInspectionDate_is_EqualTo_joining_date
