[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyPipelineSummaryServiceModel.cs:5:25
 
 public record AcademyPipelineSummaryServiceModel(int PreAdvisoryCount, int PostAdvisoryCount, int FreeSchoolsCount)
 {
-    public int Total => PreAdvisoryCount + PostAdvisoryCount + FreeSchoolsCount;
+    public int Total => PreAdvisoryCount - PostAdvisoryCount + FreeSchoolsCount;
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_show_number_of_pipeline_academies_in_pipeline_subnav_display_text; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_academies_tabs; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_academies_tabs

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyPipelineSummaryServiceModel.cs:5:25
 
 public record AcademyPipelineSummaryServiceModel(int PreAdvisoryCount, int PostAdvisoryCount, int FreeSchoolsCount)
 {
-    public int Total => PreAdvisoryCount + PostAdvisoryCount + FreeSchoolsCount;
+    public int Total => PreAdvisoryCount + PostAdvisoryCount - FreeSchoolsCount;
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_show_number_of_pipeline_academies_in_pipeline_subnav_display_text; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_show_number_of_pipeline_academies_in_pipeline_subnav_display_text; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.Trusts.TrustNavMenu.SubNav.GetSubNavLinks_should_return_expected_links_for_academies_tabs
