[Killed] Negate expression
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyPupilNumbersServiceModel.cs:18:17
     {
         get
         {
-            if (this is { NumberOfPupils: not null, SchoolCapacity: not null } &&
-                SchoolCapacity != 0)
+            if (!(this is { NumberOfPupils: not null, SchoolCapacity: not null } &&
+                SchoolCapacity != 0))
             {
                 return (float)Math.Round((int)NumberOfPupils / (float)SchoolCapacity * 100);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyPupilNumbersServiceModel.cs:18:17
     {
         get
         {
-            if (this is { NumberOfPupils: not null, SchoolCapacity: not null } &&
-                SchoolCapacity != 0)
+            if (this is { NumberOfPupils: not null, SchoolCapacity: not null } ||
+                SchoolCapacity != 0)
             {
                 return (float)Math.Round((int)NumberOfPupils / (float)SchoolCapacity * 100);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyPupilNumbersServiceModel.cs:19:17
         get
         {
             if (this is { NumberOfPupils: not null, SchoolCapacity: not null } &&
-                SchoolCapacity != 0)
+                SchoolCapacity == 0)
             {
                 return (float)Math.Round((int)NumberOfPupils / (float)SchoolCapacity * 100);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyPupilNumbersServiceModel.cs:21:42
             if (this is { NumberOfPupils: not null, SchoolCapacity: not null } &&
                 SchoolCapacity != 0)
             {
-                return (float)Math.Round((int)NumberOfPupils / (float)SchoolCapacity * 100);
+                return (float)Math.Round((int)NumberOfPupils * (float)SchoolCapacity * 100);
             }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyPupilNumbersServiceModel.cs:21:42
             if (this is { NumberOfPupils: not null, SchoolCapacity: not null } &&
                 SchoolCapacity != 0)
             {
-                return (float)Math.Round((int)NumberOfPupils / (float)SchoolCapacity * 100);
+                return (float)Math.Round((int)NumberOfPupils / (float)SchoolCapacity / 100);
             }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyPupilNumbersServiceModelTests.PercentageFull_should_return_the_correct_percentage_calculation
