[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyService.cs:32:59
 
         return academies.Select(a =>
             new AcademyDetailsServiceModel(a.Urn, a.EstablishmentName, a.LocalAuthority, a.TypeOfEstablishment,
-                a.UrbanRural?.Replace("(England/Wales) ", ""), a.DateAcademyJoinedTrust)).ToArray();
+                a.UrbanRural?.Replace("(England/Wales) ", "Stryker was here!"), a.DateAcademyJoinedTrust)).ToArray();
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesInTrustDetailsAsync_ShouldRemoveEnglandWalesFromUrbanRural

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyService.cs:36:5
     }
 
     public async Task<AcademyOfstedServiceModel[]> GetAcademiesInTrustOfstedAsync(string uid)
-    {
-        var academies = await ofstedRepository.GetAcademiesInTrustOfstedAsync(uid);
-
-        return academies.Select(a =>
-            new AcademyOfstedServiceModel(a.Urn, a.EstablishmentName, a.DateAcademyJoinedTrust, a.PreviousOfstedRating,
-                a.CurrentOfstedRating)).ToArray();
-    }
+    {}
 
     public async Task<AcademyPupilNumbersServiceModel[]> GetAcademiesInTrustPupilNumbersAsync(string uid)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesInTrustOfstedAsync_should_return_mapped_result_from_repository

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyService.cs:45:5
     }
 
     public async Task<AcademyPupilNumbersServiceModel[]> GetAcademiesInTrustPupilNumbersAsync(string uid)
-    {
-        var academies = await academyRepository.GetAcademiesInTrustPupilNumbersAsync(uid);
-
-        return academies.Select(a =>
-            new AcademyPupilNumbersServiceModel(a.Urn, a.EstablishmentName, a.PhaseOfEducation,
-                a.AgeRange, a.NumberOfPupils,
-                a.SchoolCapacity)).ToArray();
-    }
+    {}
 
     public async Task<AcademyFreeSchoolMealsServiceModel[]> GetAcademiesInTrustFreeSchoolMealsAsync(string uid)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesInTrustPupilNumbersAsync_should_return_mapped_result_from_repository

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyService.cs:55:5
     }
 
     public async Task<AcademyFreeSchoolMealsServiceModel[]> GetAcademiesInTrustFreeSchoolMealsAsync(string uid)
-    {
-        var academies = await academyRepository.GetAcademiesInTrustFreeSchoolMealsAsync(uid);
-
-        return academies.Select(a =>
-                new AcademyFreeSchoolMealsServiceModel(
-                    a.Urn,
-                    a.EstablishmentName,
-                    a.PercentageFreeSchoolMeals,
-                    freeSchoolMealsAverageProvider.GetLaAverage(a.LocalAuthorityCode, a.PhaseOfEducation,
-                        a.TypeOfEstablishment),
-                    freeSchoolMealsAverageProvider.GetNationalAverage(a.PhaseOfEducation, a.TypeOfEstablishment)))
-            .ToArray();
-    }
+    {}
 
     public async Task<AcademyPipelineSummaryServiceModel> GetAcademiesPipelineSummaryAsync(string trustReferenceNumber)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesInTrustFreeSchoolMealsAsync_should_get_relevant_fields_from_freeSchoolMealsAveragesProvider; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesInTrustFreeSchoolMealsAsync_should_map_relevant_fields_from_repository

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyService.cs:70:5
     }
 
     public async Task<AcademyPipelineSummaryServiceModel> GetAcademiesPipelineSummaryAsync(string trustReferenceNumber)
-    {
-        var repoSummary = await pipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsync(trustReferenceNumber);
-
-        return new AcademyPipelineSummaryServiceModel(
-            repoSummary.PreAdvisoryCount,
-            repoSummary.PostAdvisoryCount,
-            repoSummary.FreeSchoolsCount
-        );
-    }
+    {}
 
     public async Task<AcademyPipelineServiceModel[]> GetAcademiesPipelinePreAdvisoryAsync(string trustReferenceNumber)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesPipelineSummaryAsync_should_return_mapped_result_from_repository

[Killed] Linq method mutation (Concat() to Except())
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyService.cs:90:41
             await pipelineEstablishmentRepository.GetAdvisoryTransferEstablishmentsAsync(trustReferenceNumber,
                 AdvisoryType.PreAdvisory);
 
-        var preAdvisoryEstablishments = advisoryConversions.Concat(advisoryTransfers);
+        var preAdvisoryEstablishments = advisoryConversions.Except(advisoryTransfers);
 
         return preAdvisoryEstablishments.Select(fs => new AcademyPipelineServiceModel(
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesPipelinePreAdvisoryAsync_should_return_mapped_establishments_when_data_found

[Killed] Linq method mutation (Concat() to Except())
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyService.cs:112:42
             await pipelineEstablishmentRepository.GetAdvisoryTransferEstablishmentsAsync(trustReferenceNumber,
                 AdvisoryType.PostAdvisory);
 
-        var postAdvisoryEstablishments = advisoryConversions.Concat(advisoryTransfers);
+        var postAdvisoryEstablishments = advisoryConversions.Except(advisoryTransfers);
 
         return postAdvisoryEstablishments.Select(fs => new AcademyPipelineServiceModel(
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesPipelinePostAdvisoryAsync_should_return_mapped_establishments_when_data_found

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Academy/AcademyService.cs:125:5
     }
 
     public async Task<AcademyPipelineServiceModel[]> GetAcademiesPipelineFreeSchoolsAsync(string trustReferenceNumber)
-    {
-        var freeSchools =
-            await pipelineEstablishmentRepository.GetPipelineFreeSchoolProjectsAsync(trustReferenceNumber);
-
-        return freeSchools.Select(fs => new AcademyPipelineServiceModel(
-            fs.Urn,
-            fs.EstablishmentName,
-            fs.AgeRange,
-            fs.LocalAuthority,
-            fs.ProjectType,
-            fs.ChangeDate
-        )).ToArray();
-    }
+    {}
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesPipelineFreeSchoolsAsync_should_return_empty_array_when_repository_returns_empty_array; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesPipelineFreeSchoolsAsync_should_return_mapped_establishments_when_data_found; DfE.FindInformationAcademiesTrusts.UnitTests.Services.AcademyServiceTests.GetAcademiesPipelineFreeSchoolsAsync_should_return_empty_array_when_repository_returns_null
