[Killed] Negate expression
DfE.FindInformationAcademiesTrusts/Services/DataSource/DataSourceService.cs:21:13
 {
     public async Task<DataSourceServiceModel> GetAsync(Source source)
     {
-        if (memoryCache.TryGetValue(source, out DataSourceServiceModel? cachedDataSource))
+        if (!(memoryCache.TryGetValue(source, out DataSourceServiceModel? cachedDataSource)))
         {
             return cachedDataSource!;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/DataSource/DataSourceService.cs:22:9
     public async Task<DataSourceServiceModel> GetAsync(Source source)
     {
         if (memoryCache.TryGetValue(source, out DataSourceServiceModel? cachedDataSource))
-        {
-            return cachedDataSource!;
-        }
+        {}
 
         var dataSource = source switch
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_cached_should_return_cached_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_cached_should_return_cached_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_cached_should_return_cached_result

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts/Services/DataSource/DataSourceService.cs:28:13
 
         var dataSource = source switch
         {
-            Source.Gias or Source.Mstr or Source.Cdm or Source.Mis => await dataSourceRepository.GetAsync(source),
+            Source.Gias and Source.Mstr or Source.Cdm or Source.Mis => await dataSourceRepository.GetAsync(source),
             Source.ExploreEducationStatistics => freeSchoolMealsAverageProvider.GetFreeSchoolMealsUpdated(),
             Source.Prepare or Source.Complete or Source.ManageFreeSchoolProjects =>
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_call_academiesDbDataSourceRepository

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts/Services/DataSource/DataSourceService.cs:28:13
 
         var dataSource = source switch
         {
-            Source.Gias or Source.Mstr or Source.Cdm or Source.Mis => await dataSourceRepository.GetAsync(source),
+            Source.Gias or Source.Mstr and Source.Cdm or Source.Mis => await dataSourceRepository.GetAsync(source),
             Source.ExploreEducationStatistics => freeSchoolMealsAverageProvider.GetFreeSchoolMealsUpdated(),
             Source.Prepare or Source.Complete or Source.ManageFreeSchoolProjects =>
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts/Services/DataSource/DataSourceService.cs:30:13
         {
             Source.Gias or Source.Mstr or Source.Cdm or Source.Mis => await dataSourceRepository.GetAsync(source),
             Source.ExploreEducationStatistics => freeSchoolMealsAverageProvider.GetFreeSchoolMealsUpdated(),
-            Source.Prepare or Source.Complete or Source.ManageFreeSchoolProjects =>
+            Source.Prepare and Source.Complete or Source.ManageFreeSchoolProjects =>
                await dataSourceRepository.GetAsync(source),
             _ => throw new ArgumentOutOfRangeException(nameof(source), source, null)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_call_academiesDbDataSourceRepository

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/DataSource/DataSourceService.cs:38:13
         var dataSourceServiceModel =
             new DataSourceServiceModel(dataSource.Source, dataSource.LastUpdated, dataSource.NextUpdated);
 
-        if (dataSourceServiceModel.LastUpdated is not null)
+        if (dataSourceServiceModel.LastUpdated is null)
         {
             var cacheExpiration = dataSourceServiceModel.NextUpdated switch
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/DataSource/DataSourceService.cs:48:13
                 _ => throw new SwitchExpressionException(dataSourceServiceModel.NextUpdated)
             };
 
-            memoryCache.Set(source, dataSourceServiceModel, cacheExpiration);
+            ;
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.DataSourceServiceTests.GetAsync_uncached_should_cache_result
