[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:23:9
         CommonColumnNames.SchoolName,
         CommonColumnNames.Urn,
         CommonColumnNames.LocalAuthority,
-        "Type",
+        "",
         "Rural or Urban",
         CommonColumnNames.DateJoined,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:26:9
         "Type",
         "Rural or Urban",
         CommonColumnNames.DateJoined,
-        "Current Ofsted Rating",
+        "",
         CommonColumnNames.BeforeOrAfterJoiningHeader,
         "Date of Current Ofsted",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:28:9
         CommonColumnNames.DateJoined,
         "Current Ofsted Rating",
         CommonColumnNames.BeforeOrAfterJoiningHeader,
-        "Date of Current Ofsted",
+        "",
         "Previous Ofsted Rating",
         CommonColumnNames.BeforeOrAfterJoiningHeader,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:46:13
     {
         var trustSummary = await trustService.GetTrustSummaryAsync(uid);
 
-        if (trustSummary is null)
+        if (trustSummary is not null)
         {
             throw new DataIntegrityException($"Trust summary not found for UID {uid}");
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.IfTrustDetailsDontExist_ShouldThrow; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:48:13
 
         if (trustSummary is null)
         {
-            throw new DataIntegrityException($"Trust summary not found for UID {uid}");
+            ;
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.IfTrustDetailsDontExist_ShouldThrow

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:48:46
 
         if (trustSummary is null)
         {
-            throw new DataIntegrityException($"Trust summary not found for UID {uid}");
+            throw new DataIntegrityException($"");
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.IfTrustDetailsDontExist_ShouldThrow

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:60:17
             .WriteHeaders(headers)
             .WriteRows(() =>
             {
-                WriteRows(academiesDetails, academiesOfstedRatings, academiesPupilNumbers,
-                    academiesFreeSchoolMeals);
+                ;
             })
             .Build();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData

[Killed] Linq method mutation (SingleOrDefault() to Single())
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:72:30
     {
         foreach (var details in academies)
         {
-            var ofstedData = academiesOfstedRatings.SingleOrDefault(x => x.Urn == details.Urn);
+            var ofstedData = academiesOfstedRatings.Single(x => x.Urn == details.Urn);
             var pupilData = academiesPupilNumbers.SingleOrDefault(x => x.Urn == details.Urn);
             var freeMealsData = academiesFreeSchoolMeals.SingleOrDefault(x => x.Urn == details.Urn);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullOfstedData

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:72:74
     {
         foreach (var details in academies)
         {
-            var ofstedData = academiesOfstedRatings.SingleOrDefault(x => x.Urn == details.Urn);
+            var ofstedData = academiesOfstedRatings.SingleOrDefault(x => x.Urn != details.Urn);
             var pupilData = academiesPupilNumbers.SingleOrDefault(x => x.Urn == details.Urn);
             var freeMealsData = academiesFreeSchoolMeals.SingleOrDefault(x => x.Urn == details.Urn);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:73:72
         foreach (var details in academies)
         {
             var ofstedData = academiesOfstedRatings.SingleOrDefault(x => x.Urn == details.Urn);
-            var pupilData = academiesPupilNumbers.SingleOrDefault(x => x.Urn == details.Urn);
+            var pupilData = academiesPupilNumbers.SingleOrDefault(x => x.Urn != details.Urn);
             var freeMealsData = academiesFreeSchoolMeals.SingleOrDefault(x => x.Urn == details.Urn);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Linq method mutation (SingleOrDefault() to Single())
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:73:29
         foreach (var details in academies)
         {
             var ofstedData = academiesOfstedRatings.SingleOrDefault(x => x.Urn == details.Urn);
-            var pupilData = academiesPupilNumbers.SingleOrDefault(x => x.Urn == details.Urn);
+            var pupilData = academiesPupilNumbers.Single(x => x.Urn == details.Urn);
             var freeMealsData = academiesFreeSchoolMeals.SingleOrDefault(x => x.Urn == details.Urn);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData

[Killed] Linq method mutation (SingleOrDefault() to Single())
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:74:33
         {
             var ofstedData = academiesOfstedRatings.SingleOrDefault(x => x.Urn == details.Urn);
             var pupilData = academiesPupilNumbers.SingleOrDefault(x => x.Urn == details.Urn);
-            var freeMealsData = academiesFreeSchoolMeals.SingleOrDefault(x => x.Urn == details.Urn);
+            var freeMealsData = academiesFreeSchoolMeals.Single(x => x.Urn == details.Urn);
 
             GenerateAcademyRow(details, ofstedData, pupilData, freeMealsData);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:74:79
         {
             var ofstedData = academiesOfstedRatings.SingleOrDefault(x => x.Urn == details.Urn);
             var pupilData = academiesPupilNumbers.SingleOrDefault(x => x.Urn == details.Urn);
-            var freeMealsData = academiesFreeSchoolMeals.SingleOrDefault(x => x.Urn == details.Urn);
+            var freeMealsData = academiesFreeSchoolMeals.SingleOrDefault(x => x.Urn != details.Urn);
 
             GenerateAcademyRow(details, ofstedData, pupilData, freeMealsData);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:76:13
             var pupilData = academiesPupilNumbers.SingleOrDefault(x => x.Urn == details.Urn);
             var freeMealsData = academiesFreeSchoolMeals.SingleOrDefault(x => x.Urn == details.Urn);
 
-            GenerateAcademyRow(details, ofstedData, pupilData, freeMealsData);
+            ;
         }
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:88:30
     {
         var previousRating = ofstedData?.PreviousOfstedRating;
         var currentRating = ofstedData?.CurrentOfstedRating;
-        var percentageFull = pupilNumbersData?.PercentageFull ?? 0;
+        var percentageFull = 0;
 
         SetTextCell(AcademyColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:90:48
         var currentRating = ofstedData?.CurrentOfstedRating;
         var percentageFull = pupilNumbersData?.PercentageFull ?? 0;
 
-        SetTextCell(AcademyColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
+        SetTextCell(AcademyColumns.SchoolName, string.Empty);
         SetTextCell(AcademyColumns.Urn, academy.Urn);
         SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:90:9
         var currentRating = ofstedData?.CurrentOfstedRating;
         var percentageFull = pupilNumbersData?.PercentageFull ?? 0;
 
-        SetTextCell(AcademyColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
+        ;
         SetTextCell(AcademyColumns.Urn, academy.Urn);
         SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:91:9
         var percentageFull = pupilNumbersData?.PercentageFull ?? 0;
 
         SetTextCell(AcademyColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
-        SetTextCell(AcademyColumns.Urn, academy.Urn);
+        ;
         SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
         SetTextCell(AcademyColumns.Type, academy.TypeOfEstablishment ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:92:52
 
         SetTextCell(AcademyColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
         SetTextCell(AcademyColumns.Urn, academy.Urn);
-        SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
+        SetTextCell(AcademyColumns.LocalAuthority, string.Empty);
         SetTextCell(AcademyColumns.Type, academy.TypeOfEstablishment ?? string.Empty);
         SetTextCell(AcademyColumns.RuralOrUrban, academy.UrbanRural ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:92:9
 
         SetTextCell(AcademyColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
         SetTextCell(AcademyColumns.Urn, academy.Urn);
-        SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
+        ;
         SetTextCell(AcademyColumns.Type, academy.TypeOfEstablishment ?? string.Empty);
         SetTextCell(AcademyColumns.RuralOrUrban, academy.UrbanRural ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:93:42
         SetTextCell(AcademyColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
         SetTextCell(AcademyColumns.Urn, academy.Urn);
         SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
-        SetTextCell(AcademyColumns.Type, academy.TypeOfEstablishment ?? string.Empty);
+        SetTextCell(AcademyColumns.Type, string.Empty);
         SetTextCell(AcademyColumns.RuralOrUrban, academy.UrbanRural ?? string.Empty);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:93:9
         SetTextCell(AcademyColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
         SetTextCell(AcademyColumns.Urn, academy.Urn);
         SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
-        SetTextCell(AcademyColumns.Type, academy.TypeOfEstablishment ?? string.Empty);
+        ;
         SetTextCell(AcademyColumns.RuralOrUrban, academy.UrbanRural ?? string.Empty);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:94:9
         SetTextCell(AcademyColumns.Urn, academy.Urn);
         SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
         SetTextCell(AcademyColumns.Type, academy.TypeOfEstablishment ?? string.Empty);
-        SetTextCell(AcademyColumns.RuralOrUrban, academy.UrbanRural ?? string.Empty);
+        ;
 
         SetDateCell(AcademyColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:94:50
         SetTextCell(AcademyColumns.Urn, academy.Urn);
         SetTextCell(AcademyColumns.LocalAuthority, academy.LocalAuthority ?? string.Empty);
         SetTextCell(AcademyColumns.Type, academy.TypeOfEstablishment ?? string.Empty);
-        SetTextCell(AcademyColumns.RuralOrUrban, academy.UrbanRural ?? string.Empty);
+        SetTextCell(AcademyColumns.RuralOrUrban, string.Empty);
 
         SetDateCell(AcademyColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:96:9
         SetTextCell(AcademyColumns.Type, academy.TypeOfEstablishment ?? string.Empty);
         SetTextCell(AcademyColumns.RuralOrUrban, academy.UrbanRural ?? string.Empty);
 
-        SetDateCell(AcademyColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
+        ;
 
         SetTextCell(AcademyColumns.CurrentOfstedRating,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:98:9
 
         SetDateCell(AcademyColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
 
-        SetTextCell(AcademyColumns.CurrentOfstedRating,
-            currentRating?.OverallEffectiveness.ToDisplayString(true) ?? string.Empty);
+        ;
         SetTextCell(AcademyColumns.CurrentBeforeAfterJoining,
             ofstedData?.WhenDidCurrentInspectionHappen == BeforeOrAfterJoining.NotYetInspected
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:99:65
         SetDateCell(AcademyColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
 
         SetTextCell(AcademyColumns.CurrentOfstedRating,
-            currentRating?.OverallEffectiveness.ToDisplayString(true) ?? string.Empty);
+            currentRating?.OverallEffectiveness.ToDisplayString(false) ?? string.Empty);
         SetTextCell(AcademyColumns.CurrentBeforeAfterJoining,
             ofstedData?.WhenDidCurrentInspectionHappen == BeforeOrAfterJoining.NotYetInspected
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:99:13
         SetDateCell(AcademyColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
 
         SetTextCell(AcademyColumns.CurrentOfstedRating,
-            currentRating?.OverallEffectiveness.ToDisplayString(true) ?? string.Empty);
+            string.Empty);
         SetTextCell(AcademyColumns.CurrentBeforeAfterJoining,
             ofstedData?.WhenDidCurrentInspectionHappen == BeforeOrAfterJoining.NotYetInspected
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:100:9
 
         SetTextCell(AcademyColumns.CurrentOfstedRating,
             currentRating?.OverallEffectiveness.ToDisplayString(true) ?? string.Empty);
-        SetTextCell(AcademyColumns.CurrentBeforeAfterJoining,
-            ofstedData?.WhenDidCurrentInspectionHappen == BeforeOrAfterJoining.NotYetInspected
-                ? string.Empty
-                : ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
+        ;
         SetDateCell(AcademyColumns.DateOfCurrentInspection, currentRating?.InspectionDate);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:101:13
         SetTextCell(AcademyColumns.CurrentOfstedRating,
             currentRating?.OverallEffectiveness.ToDisplayString(true) ?? string.Empty);
         SetTextCell(AcademyColumns.CurrentBeforeAfterJoining,
-            ofstedData?.WhenDidCurrentInspectionHappen == BeforeOrAfterJoining.NotYetInspected
+            ofstedData?.WhenDidCurrentInspectionHappen != BeforeOrAfterJoining.NotYetInspected
                 ? string.Empty
                 : ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Conditional (true) mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:101:13
         SetTextCell(AcademyColumns.CurrentOfstedRating,
             currentRating?.OverallEffectiveness.ToDisplayString(true) ?? string.Empty);
         SetTextCell(AcademyColumns.CurrentBeforeAfterJoining,
-            ofstedData?.WhenDidCurrentInspectionHappen == BeforeOrAfterJoining.NotYetInspected
-                ? string.Empty
-                : ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
+            (true?string.Empty
+:ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty));
         SetDateCell(AcademyColumns.DateOfCurrentInspection, currentRating?.InspectionDate);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:103:19
         SetTextCell(AcademyColumns.CurrentBeforeAfterJoining,
             ofstedData?.WhenDidCurrentInspectionHappen == BeforeOrAfterJoining.NotYetInspected
                 ? string.Empty
-                : ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
+                : string.Empty);
         SetDateCell(AcademyColumns.DateOfCurrentInspection, currentRating?.InspectionDate);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:104:9
             ofstedData?.WhenDidCurrentInspectionHappen == BeforeOrAfterJoining.NotYetInspected
                 ? string.Empty
                 : ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
-        SetDateCell(AcademyColumns.DateOfCurrentInspection, currentRating?.InspectionDate);
+        ;
 
         SetTextCell(AcademyColumns.PreviousOfstedRating,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:106:9
                 : ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
         SetDateCell(AcademyColumns.DateOfCurrentInspection, currentRating?.InspectionDate);
 
-        SetTextCell(AcademyColumns.PreviousOfstedRating,
-            previousRating?.OverallEffectiveness.ToDisplayString(false) ?? string.Empty);
+        ;
 
         SetTextCell(AcademyColumns.PreviousBeforeAfterJoining,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:107:13
         SetDateCell(AcademyColumns.DateOfCurrentInspection, currentRating?.InspectionDate);
 
         SetTextCell(AcademyColumns.PreviousOfstedRating,
-            previousRating?.OverallEffectiveness.ToDisplayString(false) ?? string.Empty);
+            string.Empty);
 
         SetTextCell(AcademyColumns.PreviousBeforeAfterJoining,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:107:66
         SetDateCell(AcademyColumns.DateOfCurrentInspection, currentRating?.InspectionDate);
 
         SetTextCell(AcademyColumns.PreviousOfstedRating,
-            previousRating?.OverallEffectiveness.ToDisplayString(false) ?? string.Empty);
+            previousRating?.OverallEffectiveness.ToDisplayString(true) ?? string.Empty);
 
         SetTextCell(AcademyColumns.PreviousBeforeAfterJoining,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync
