[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:109:9
         SetTextCell(AcademyColumns.PreviousOfstedRating,
             previousRating?.OverallEffectiveness.ToDisplayString(false) ?? string.Empty);
 
-        SetTextCell(AcademyColumns.PreviousBeforeAfterJoining,
-            ofstedData?.WhenDidPreviousInspectionHappen == BeforeOrAfterJoining.NotYetInspected
-                ? string.Empty
-                : ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
+        ;
 
         SetDateCell(AcademyColumns.DateOfPreviousInspection, previousRating?.InspectionDate);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:110:13
             previousRating?.OverallEffectiveness.ToDisplayString(false) ?? string.Empty);
 
         SetTextCell(AcademyColumns.PreviousBeforeAfterJoining,
-            ofstedData?.WhenDidPreviousInspectionHappen == BeforeOrAfterJoining.NotYetInspected
+            ofstedData?.WhenDidPreviousInspectionHappen != BeforeOrAfterJoining.NotYetInspected
                 ? string.Empty
                 : ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Conditional (true) mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:110:13
             previousRating?.OverallEffectiveness.ToDisplayString(false) ?? string.Empty);
 
         SetTextCell(AcademyColumns.PreviousBeforeAfterJoining,
-            ofstedData?.WhenDidPreviousInspectionHappen == BeforeOrAfterJoining.NotYetInspected
-                ? string.Empty
-                : ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
+            (true?string.Empty
+:ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty));
 
         SetDateCell(AcademyColumns.DateOfPreviousInspection, previousRating?.InspectionDate);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:112:19
         SetTextCell(AcademyColumns.PreviousBeforeAfterJoining,
             ofstedData?.WhenDidPreviousInspectionHappen == BeforeOrAfterJoining.NotYetInspected
                 ? string.Empty
-                : ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
+                : string.Empty);
 
         SetDateCell(AcademyColumns.DateOfPreviousInspection, previousRating?.InspectionDate);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:112:84
         SetTextCell(AcademyColumns.PreviousBeforeAfterJoining,
             ofstedData?.WhenDidPreviousInspectionHappen == BeforeOrAfterJoining.NotYetInspected
                 ? string.Empty
-                : ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
+                : ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? "Stryker was here!");
 
         SetDateCell(AcademyColumns.DateOfPreviousInspection, previousRating?.InspectionDate);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullOfstedData

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:114:9
                 ? string.Empty
                 : ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
 
-        SetDateCell(AcademyColumns.DateOfPreviousInspection, previousRating?.InspectionDate);
+        ;
 
         SetTextCell(AcademyColumns.PhaseOfEducation, pupilNumbersData?.PhaseOfEducation ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:116:9
 
         SetDateCell(AcademyColumns.DateOfPreviousInspection, previousRating?.InspectionDate);
 
-        SetTextCell(AcademyColumns.PhaseOfEducation, pupilNumbersData?.PhaseOfEducation ?? string.Empty);
+        ;
 
         SetTextCell(AcademyColumns.AgeRange, pupilNumbersData?.AgeRange.ToTabularDisplayString() ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:116:54
 
         SetDateCell(AcademyColumns.DateOfPreviousInspection, previousRating?.InspectionDate);
 
-        SetTextCell(AcademyColumns.PhaseOfEducation, pupilNumbersData?.PhaseOfEducation ?? string.Empty);
+        SetTextCell(AcademyColumns.PhaseOfEducation, string.Empty);
 
         SetTextCell(AcademyColumns.AgeRange, pupilNumbersData?.AgeRange.ToTabularDisplayString() ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:118:46
 
         SetTextCell(AcademyColumns.PhaseOfEducation, pupilNumbersData?.PhaseOfEducation ?? string.Empty);
 
-        SetTextCell(AcademyColumns.AgeRange, pupilNumbersData?.AgeRange.ToTabularDisplayString() ?? string.Empty);
+        SetTextCell(AcademyColumns.AgeRange, string.Empty);
 
         SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:118:9
 
         SetTextCell(AcademyColumns.PhaseOfEducation, pupilNumbersData?.PhaseOfEducation ?? string.Empty);
 
-        SetTextCell(AcademyColumns.AgeRange, pupilNumbersData?.AgeRange.ToTabularDisplayString() ?? string.Empty);
+        ;
 
         SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:120:50
 
         SetTextCell(AcademyColumns.AgeRange, pupilNumbersData?.AgeRange.ToTabularDisplayString() ?? string.Empty);
 
-        SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
+        SetTextCell(AcademyColumns.PupilNumbers, string.Empty);
         SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
         SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:120:9
 
         SetTextCell(AcademyColumns.AgeRange, pupilNumbersData?.AgeRange.ToTabularDisplayString() ?? string.Empty);
 
-        SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
+        ;
         SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
         SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:121:46
         SetTextCell(AcademyColumns.AgeRange, pupilNumbersData?.AgeRange.ToTabularDisplayString() ?? string.Empty);
 
         SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
-        SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
+        SetTextCell(AcademyColumns.Capacity, string.Empty);
         SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
         SetTextCell(AcademyColumns.PupilsEligibleFreeSchoolMeals,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:121:9
         SetTextCell(AcademyColumns.AgeRange, pupilNumbersData?.AgeRange.ToTabularDisplayString() ?? string.Empty);
 
         SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
-        SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
+        ;
         SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
         SetTextCell(AcademyColumns.PupilsEligibleFreeSchoolMeals,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Conditional (true) mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:122:49
 
         SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
         SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
-        SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
+        SetTextCell(AcademyColumns.PercentFull, (true?$"{percentageFull}%" :string.Empty));
         SetTextCell(AcademyColumns.PupilsEligibleFreeSchoolMeals,
             freeSchoolMealsData is { PercentageFreeSchoolMeals: not null }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync

[Killed] Conditional (false) mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:122:49
 
         SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
         SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
-        SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
+        SetTextCell(AcademyColumns.PercentFull, (false?$"{percentageFull}%" :string.Empty));
         SetTextCell(AcademyColumns.PupilsEligibleFreeSchoolMeals,
             freeSchoolMealsData is { PercentageFreeSchoolMeals: not null }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:123:9
         SetTextCell(AcademyColumns.PupilNumbers, pupilNumbersData?.NumberOfPupils?.ToString() ?? string.Empty);
         SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
         SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
-        SetTextCell(AcademyColumns.PupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { PercentageFreeSchoolMeals: not null }
-                ? $"{freeSchoolMealsData.PercentageFreeSchoolMeals}%"
-                : string.Empty
-        );
+        ;
 
         SetTextCell(AcademyColumns.LaPupilsEligibleFreeSchoolMeals,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:124:13
         SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
         SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
         SetTextCell(AcademyColumns.PupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { PercentageFreeSchoolMeals: not null }
+            freeSchoolMealsData is not { PercentageFreeSchoolMeals: not null }
                 ? $"{freeSchoolMealsData.PercentageFreeSchoolMeals}%"
                 : string.Empty
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Conditional (false) mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:124:13
         SetTextCell(AcademyColumns.Capacity, pupilNumbersData?.SchoolCapacity?.ToString() ?? string.Empty);
         SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
         SetTextCell(AcademyColumns.PupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { PercentageFreeSchoolMeals: not null }
-                ? $"{freeSchoolMealsData.PercentageFreeSchoolMeals}%"
-                : string.Empty
+            (false?$"{freeSchoolMealsData.PercentageFreeSchoolMeals}%"
+:string.Empty
+)
         );
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:125:19
         SetTextCell(AcademyColumns.PercentFull, percentageFull > 0 ? $"{percentageFull}%" : string.Empty);
         SetTextCell(AcademyColumns.PupilsEligibleFreeSchoolMeals,
             freeSchoolMealsData is { PercentageFreeSchoolMeals: not null }
-                ? $"{freeSchoolMealsData.PercentageFreeSchoolMeals}%"
+                ? $""
                 : string.Empty
         );
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:129:9
                 : string.Empty
         );
 
-        SetTextCell(AcademyColumns.LaPupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { LaAveragePercentageFreeSchoolMeals: > 0 }
-                ? $"{Math.Round(freeSchoolMealsData.LaAveragePercentageFreeSchoolMeals, 1)}%"
-                : string.Empty
-        );
+        ;
         SetTextCell(AcademyColumns.NationalPupilsEligibleFreeSchoolMeals,
             freeSchoolMealsData is { NationalAveragePercentageFreeSchoolMeals: > 0 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:130:74
         );
 
         SetTextCell(AcademyColumns.LaPupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { LaAveragePercentageFreeSchoolMeals: > 0 }
+            freeSchoolMealsData is { LaAveragePercentageFreeSchoolMeals: < 0 }
                 ? $"{Math.Round(freeSchoolMealsData.LaAveragePercentageFreeSchoolMeals, 1)}%"
                 : string.Empty
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:130:74
         );
 
         SetTextCell(AcademyColumns.LaPupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { LaAveragePercentageFreeSchoolMeals: > 0 }
+            freeSchoolMealsData is { LaAveragePercentageFreeSchoolMeals: >= 0 }
                 ? $"{Math.Round(freeSchoolMealsData.LaAveragePercentageFreeSchoolMeals, 1)}%"
                 : string.Empty
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:134:9
                 ? $"{Math.Round(freeSchoolMealsData.LaAveragePercentageFreeSchoolMeals, 1)}%"
                 : string.Empty
         );
-        SetTextCell(AcademyColumns.NationalPupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { NationalAveragePercentageFreeSchoolMeals: > 0 }
-                ? $"{Math.Round(freeSchoolMealsData.NationalAveragePercentageFreeSchoolMeals, 1)}%"
-                : string.Empty
-        );
+        ;
 
         CurrentRow++;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:135:80
                 : string.Empty
         );
         SetTextCell(AcademyColumns.NationalPupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { NationalAveragePercentageFreeSchoolMeals: > 0 }
+            freeSchoolMealsData is { NationalAveragePercentageFreeSchoolMeals: >= 0 }
                 ? $"{Math.Round(freeSchoolMealsData.NationalAveragePercentageFreeSchoolMeals, 1)}%"
                 : string.Empty
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:135:13
                 : string.Empty
         );
         SetTextCell(AcademyColumns.NationalPupilsEligibleFreeSchoolMeals,
-            freeSchoolMealsData is { NationalAveragePercentageFreeSchoolMeals: > 0 }
+            freeSchoolMealsData is not { NationalAveragePercentageFreeSchoolMeals: > 0 }
                 ? $"{Math.Round(freeSchoolMealsData.NationalAveragePercentageFreeSchoolMeals, 1)}%"
                 : string.Empty
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] PostIncrementExpression to PostDecrementExpression mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:140:9
                 : string.Empty
         );
 
-        CurrentRow++;
+        CurrentRow--;
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/AcademiesExportService.cs:140:9
                 : string.Empty
         );
 
-        CurrentRow++;
+        ;
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync
