[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:19:9
         public int CurrentRow { get; set; }
 
         protected ExportBuilder(string sheetName)
-        {
-            Worksheet = workbook.Worksheets.Add(sheetName);
-        }
+        {}
 
         public byte[] Build()
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullOfstedData

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:25:13
 
         public byte[] Build()
         {
-            Worksheet.Columns().AdjustToContents();
+            ;
             using var stream = new MemoryStream();
             workbook.SaveAs(stream);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.ExportBuilderTests.OnBuild_ShouldAdjustContents

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:27:13
         {
             Worksheet.Columns().AdjustToContents();
             using var stream = new MemoryStream();
-            workbook.SaveAs(stream);
+            ;
             return stream.ToArray();
         }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleEmptyAcademiesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:34:48
         public ExportBuilder WriteTrustInformation(TrustSummaryServiceModel trustSummary)
         {
             Worksheet.Cell(1, 1).Value = trustSummary.Name;
-            Worksheet.Row(1).Style.Font.Bold = true;
+            Worksheet.Row(1).Style.Font.Bold = false;
             Worksheet.Cell(2, 1).Value = trustSummary.Type;
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.ExportBuilderTests.WhenWritingTrustInformation_ShouldSetFontStyleToBold

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:37:13
             Worksheet.Row(1).Style.Font.Bold = true;
             Worksheet.Cell(2, 1).Value = trustSummary.Type;
 
-            CurrentRow += TrustRows;
+            CurrentRow -= TrustRows;
 
             return this;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullOfstedData

[Killed] PostIncrementExpression to PostDecrementExpression mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:44:48
 
         public ExportBuilder WriteHeaders(List<string> headers)
         {
-            for (var i = 0; i < headers.Count; i++)
+            for (var i = 0; i < headers.Count; i--)
             {
                 Worksheet.Cell(CurrentRow, i + 1).Value = headers[i];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullOfstedData

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:44:29
 
         public ExportBuilder WriteHeaders(List<string> headers)
         {
-            for (var i = 0; i < headers.Count; i++)
+            for (var i = 0; i <= headers.Count; i++)
             {
                 Worksheet.Cell(CurrentRow, i + 1).Value = headers[i];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullOfstedData

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:46:44
         {
             for (var i = 0; i < headers.Count; i++)
             {
-                Worksheet.Cell(CurrentRow, i + 1).Value = headers[i];
+                Worksheet.Cell(CurrentRow, i - 1).Value = headers[i];
             }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullOfstedData

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:49:57
                 Worksheet.Cell(CurrentRow, i + 1).Value = headers[i];
             }
 
-            Worksheet.Row(CurrentRow).Style.Font.Bold = true;
+            Worksheet.Row(CurrentRow).Style.Font.Bold = false;
 
             CurrentRow += HeaderRows;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.ExportBuilderTests.WhenWritingHeaders_ShouldSetFontStyleToBold

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:51:13
 
             Worksheet.Row(CurrentRow).Style.Font.Bold = true;
 
-            CurrentRow += HeaderRows;
+            CurrentRow -= HeaderRows;
 
             return this;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:58:13
 
         internal void SetTextCell(Enum column, string value)
         {
-            Worksheet.Cell(CurrentRow, (int)(object)column).SetValue(value);
+            ;
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData

[Killed] Negate expression
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:64:17
         public void SetDateCell(Enum column, DateTime? dateValue)
         {
             var cell = Worksheet.Cell(CurrentRow, (int)(object)column);
-            if (dateValue.HasValue)
+            if (!(dateValue.HasValue))
             {
                 cell.Value = dateValue.Value;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullOfstedData

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:67:17
             if (dateValue.HasValue)
             {
                 cell.Value = dateValue.Value;
-                cell.Style.NumberFormat.SetFormat(StringFormatConstants.DisplayDateFormat);
+                ;
             }
             else
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.ExportBuilderTests.WhenWritingDateCell_ShouldSetCorrectDateFormat

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/ExportBuilder.cs:77:13
 
         internal ExportBuilder WriteRows(Action action)
         {
-            action.Invoke();
+            ;
 
             return this;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullPupilData; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyHandleNullValuesAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldHandleNullFreeSchoolsData
