[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:21:13
         [
             CommonColumnNames.SchoolName,
             CommonColumnNames.DateJoined,
-            "Current single headline grade",
+            "",
             CommonColumnNames.BeforeOrAfterJoiningHeader,
             "Date of Current Inspection",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:26:13
             "Date of Current Inspection",
             "Previous single headline grade",
             CommonColumnNames.BeforeOrAfterJoiningHeader,
-            "Date of previous inspection",
+            "",
             "Quality of Education",
             "Behaviour and Attitudes",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:28:13
             CommonColumnNames.BeforeOrAfterJoiningHeader,
             "Date of previous inspection",
             "Quality of Education",
-            "Behaviour and Attitudes",
+            "",
             "Personal Development",
             "Leadership and Management",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:29:13
             "Date of previous inspection",
             "Quality of Education",
             "Behaviour and Attitudes",
-            "Personal Development",
+            "",
             "Leadership and Management",
             "Early Years Provision",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:30:13
             "Quality of Education",
             "Behaviour and Attitudes",
             "Personal Development",
-            "Leadership and Management",
+            "",
             "Early Years Provision",
             "Sixth Form Provision",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:33:13
             "Leadership and Management",
             "Early Years Provision",
             "Sixth Form Provision",
-            "Previous Quality of Education",
+            "",
             "Previous Behaviour and Attitudes",
             "Previous Personal Development",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:35:13
             "Sixth Form Provision",
             "Previous Quality of Education",
             "Previous Behaviour and Attitudes",
-            "Previous Personal Development",
+            "",
             "Previous Leadership and Management",
             "Previous Early Years Provision",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:36:13
             "Previous Quality of Education",
             "Previous Behaviour and Attitudes",
             "Previous Personal Development",
-            "Previous Leadership and Management",
+            "",
             "Previous Early Years Provision",
             "Previous Sixth Form Provision",
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldGenerateCorrectHeadersAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:67:17
             {
                 var ofstedData = academiesOfstedRatings.SingleOrDefault(x => x.Urn == details.Urn);
 
-                GenerateOfstedRow(details, ofstedData);
+                ;
             }
         }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:73:34
 
         private void GenerateOfstedRow(AcademyDetailsServiceModel academy, AcademyOfstedServiceModel? ofstedData)
         {
-            var previousRating = ofstedData?.PreviousOfstedRating ?? OfstedRating.NotInspected;
+            var previousRating = OfstedRating.NotInspected;
             var currentRating = ofstedData?.CurrentOfstedRating ?? OfstedRating.NotInspected;
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:74:33
         private void GenerateOfstedRow(AcademyDetailsServiceModel academy, AcademyOfstedServiceModel? ofstedData)
         {
             var previousRating = ofstedData?.PreviousOfstedRating ?? OfstedRating.NotInspected;
-            var currentRating = ofstedData?.CurrentOfstedRating ?? OfstedRating.NotInspected;
+            var currentRating = OfstedRating.NotInspected;
 
             SetTextCell(OfstedColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:76:51
             var previousRating = ofstedData?.PreviousOfstedRating ?? OfstedRating.NotInspected;
             var currentRating = ofstedData?.CurrentOfstedRating ?? OfstedRating.NotInspected;
 
-            SetTextCell(OfstedColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
+            SetTextCell(OfstedColumns.SchoolName, string.Empty);
             SetDateCell(OfstedColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
             SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:76:13
             var previousRating = ofstedData?.PreviousOfstedRating ?? OfstedRating.NotInspected;
             var currentRating = ofstedData?.CurrentOfstedRating ?? OfstedRating.NotInspected;
 
-            SetTextCell(OfstedColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
+            ;
             SetDateCell(OfstedColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
             SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:77:13
             var currentRating = ofstedData?.CurrentOfstedRating ?? OfstedRating.NotInspected;
 
             SetTextCell(OfstedColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
-            SetDateCell(OfstedColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
+            ;
             SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:78:13
 
             SetTextCell(OfstedColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
             SetDateCell(OfstedColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
-            SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
+            ;
             SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Survived] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:78:118
 
             SetTextCell(OfstedColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
             SetDateCell(OfstedColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
-            SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
+            SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(false));
             SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:79:13
             SetTextCell(OfstedColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
             SetDateCell(OfstedColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
             SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
-            SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
+            ;
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
             SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:79:66
             SetTextCell(OfstedColumns.SchoolName, academy.EstablishmentName ?? string.Empty);
             SetDateCell(OfstedColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
             SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
-            SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
+            SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, string.Empty);
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
             SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:80:13
             SetDateCell(OfstedColumns.DateJoined, ofstedData?.DateAcademyJoinedTrust);
             SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
-            SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
+            ;
             SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:81:13
             SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
-            SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
+            ;
             SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Survived] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:81:120
             SetTextCell(OfstedColumns.CurrentSingleHeadlineGrade, currentRating.OverallEffectiveness.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
-            SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
+            SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(true));
             SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:82:13
             SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
             SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
+            ;
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:82:67
             SetTextCell(OfstedColumns.CurrentBeforeAfterJoining, ofstedData?.WhenDidCurrentInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
             SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
+            SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, string.Empty);
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:83:13
             SetDateCell(OfstedColumns.DateOfCurrentInspection, currentRating.InspectionDate);
             SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
-            SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
+            ;
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldCorrectlyExtractDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:84:115
             SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
-            SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
+            SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(false));
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:84:13
             SetTextCell(OfstedColumns.PreviousSingleHeadlineGrade, previousRating.OverallEffectiveness.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
-            SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
+            ;
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:85:13
             SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
-            SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
+            ; 
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:85:121
             SetTextCell(OfstedColumns.PreviousBeforeAfterJoining, ofstedData?.WhenDidPreviousInspectionHappen.ToDisplayString() ?? string.Empty);
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
-            SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
+            SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(false)); 
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:86:117
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
-            SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
+            SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(false)); 
             SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(true)); 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:86:13
             SetDateCell(OfstedColumns.DateOfPreviousInspection, previousRating.InspectionDate);
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
-            SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
+            ; 
             SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(true)); 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:87:13
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
-            SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
+            ;
             SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(true));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:87:140
             SetTextCell(OfstedColumns.CurrentQualityOfEducation, currentRating.QualityOfEducation.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
-            SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
+            SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
             SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(true));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:88:13
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
-            SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(true)); 
+            ; 
             SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(true));
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:88:117
             SetTextCell(OfstedColumns.CurrentBehaviourAndAttitudes, currentRating.BehaviourAndAttitudes.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
-            SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(true)); 
+            SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(false)); 
             SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(true));
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync
