[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:89:13
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(true)); 
-            SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(true));
+            ;
 
  
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:89:115
             SetTextCell(OfstedColumns.CurrentPersonalDevelopment, currentRating.PersonalDevelopment.ToDisplayString(true)); 
             SetTextCell(OfstedColumns.CurrentLeadershipAndManagement, currentRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
             SetTextCell(OfstedColumns.CurrentEarlyYearsProvision, currentRating.EarlyYearsProvision.ToDisplayString(true)); 
-            SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(true));
+            SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(false));
 
  
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:92:13
             SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(true));
 
  
-            SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(false));
+            ;
             SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:92:117
             SetTextCell(OfstedColumns.CurrentSixthFormProvision, currentRating.SixthFormProvision.ToDisplayString(true));
 
  
-            SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(false));
+            SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(true));
             SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:93:123
 
  
             SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
+            SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(true));
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:93:13
 
  
             SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
+            ;
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:94:119
  
             SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
+            SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(true));
             SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:94:13
  
             SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
+            ;
             SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:95:13
             SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
+            ;
             SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousSixthFormProvision, previousRating.SixthFormProvision.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:95:142
             SetTextCell(OfstedColumns.PreviousQualityOfEducation, previousRating.QualityOfEducation.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
+            SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(true));
             SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousSixthFormProvision, previousRating.SixthFormProvision.ToDisplayString(false));
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:96:119
             SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
+            SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(true));
             SetTextCell(OfstedColumns.PreviousSixthFormProvision, previousRating.SixthFormProvision.ToDisplayString(false));
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:96:13
             SetTextCell(OfstedColumns.PreviousBehaviourAndAttitudes, previousRating.BehaviourAndAttitudes.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
+            ;
             SetTextCell(OfstedColumns.PreviousSixthFormProvision, previousRating.SixthFormProvision.ToDisplayString(false));
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:97:13
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousSixthFormProvision, previousRating.SixthFormProvision.ToDisplayString(false));
+            ;
 
             SetTextCell(OfstedColumns.EffectiveSafeguarding, currentRating.SafeguardingIsEffective.ToDisplayString());
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Boolean mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:97:117
             SetTextCell(OfstedColumns.PreviousPersonalDevelopment, previousRating.PersonalDevelopment.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousLeadershipAndManagement, previousRating.EffectivenessOfLeadershipAndManagement.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
-            SetTextCell(OfstedColumns.PreviousSixthFormProvision, previousRating.SixthFormProvision.ToDisplayString(false));
+            SetTextCell(OfstedColumns.PreviousSixthFormProvision, previousRating.SixthFormProvision.ToDisplayString(true));
 
             SetTextCell(OfstedColumns.EffectiveSafeguarding, currentRating.SafeguardingIsEffective.ToDisplayString());
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:99:13
             SetTextCell(OfstedColumns.PreviousEarlyYearsProvision, previousRating.EarlyYearsProvision.ToDisplayString(false));
             SetTextCell(OfstedColumns.PreviousSixthFormProvision, previousRating.SixthFormProvision.ToDisplayString(false));
 
-            SetTextCell(OfstedColumns.EffectiveSafeguarding, currentRating.SafeguardingIsEffective.ToDisplayString());
+            ;
 
             SetTextCell(OfstedColumns.CategoryOfConcern, currentRating.CategoryOfConcern.ToDisplayString());
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/OfstedDataExportService.cs:101:13
 
             SetTextCell(OfstedColumns.EffectiveSafeguarding, currentRating.SafeguardingIsEffective.ToDisplayString());
 
-            SetTextCell(OfstedColumns.CategoryOfConcern, currentRating.CategoryOfConcern.ToDisplayString());
+            ;
 
             CurrentRow++;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.OfstedDataExportServiceTests.ExportOfstedDataToSpreadsheet_ShouldHandleNoOfstedDataAsync
