[Killed] PostIncrementExpression to PostDecrementExpression mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:45:9
 
     private void WriteHeadersForPreAdvisory()
     {
-        CurrentRow++;
+        CurrentRow--;
         WriteHeaders(["Pre-advisory academies"]);
         WriteHeaders([
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.Export_ShouldCorrectlyHandleNullValuesAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:45:9
 
     private void WriteHeadersForPreAdvisory()
     {
-        CurrentRow++;
+        ;
         WriteHeaders(["Pre-advisory academies"]);
         WriteHeaders([
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.Export_ShouldCorrectlyHandleNullValuesAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:46:9
     private void WriteHeadersForPreAdvisory()
     {
         CurrentRow++;
-        WriteHeaders(["Pre-advisory academies"]);
+        ;
         WriteHeaders([
             CommonColumnNames.SchoolName, CommonColumnNames.Urn, CommonColumnNames.AgeRange,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.Export_ShouldCorrectlyHandleNullValuesAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:47:9
     {
         CurrentRow++;
         WriteHeaders(["Pre-advisory academies"]);
-        WriteHeaders([
-            CommonColumnNames.SchoolName, CommonColumnNames.Urn, CommonColumnNames.AgeRange,
-            CommonColumnNames.LocalAuthority, "Project type", "Proposed conversion or transfer date"
-        ]);
+        ;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.Export_ShouldCorrectlyHandleNullValuesAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:49:47
         WriteHeaders(["Pre-advisory academies"]);
         WriteHeaders([
             CommonColumnNames.SchoolName, CommonColumnNames.Urn, CommonColumnNames.AgeRange,
-            CommonColumnNames.LocalAuthority, "Project type", "Proposed conversion or transfer date"
+            CommonColumnNames.LocalAuthority, "", "Proposed conversion or transfer date"
         ]);
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:56:9
     private void WriteHeadersForPostAdvisory()
     {
         CurrentRow++;
-        WriteHeaders(["Post-advisory academies"]);
+        ;
         WriteHeaders([
             CommonColumnNames.SchoolName, CommonColumnNames.Urn, CommonColumnNames.AgeRange,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:57:9
     {
         CurrentRow++;
         WriteHeaders(["Post-advisory academies"]);
-        WriteHeaders([
-            CommonColumnNames.SchoolName, CommonColumnNames.Urn, CommonColumnNames.AgeRange,
-            CommonColumnNames.LocalAuthority, "Project type", "Proposed conversion or transfer date"
-        ]);
+        ;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:66:9
     private void WriteHeadersForFreeSchools()
     {
         CurrentRow++;
-        WriteHeaders(["Free schools"]);
+        ;
         WriteHeaders([
             CommonColumnNames.SchoolName, CommonColumnNames.Urn, CommonColumnNames.AgeRange,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:67:9
     {
         CurrentRow++;
         WriteHeaders(["Free schools"]);
-        WriteHeaders([
-            CommonColumnNames.SchoolName, CommonColumnNames.Urn, CommonColumnNames.AgeRange,
-            CommonColumnNames.LocalAuthority, "Project type", "Provisional opening date"
-        ]);
+        ;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:69:47
         WriteHeaders(["Free schools"]);
         WriteHeaders([
             CommonColumnNames.SchoolName, CommonColumnNames.Urn, CommonColumnNames.AgeRange,
-            CommonColumnNames.LocalAuthority, "Project type", "Provisional opening date"
+            CommonColumnNames.LocalAuthority, "", "Provisional opening date"
         ]);
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:75:40
 
     private void WriteRows(AcademyPipelineServiceModel[] pipelineAcademies)
     {
-        var orderedPipelineAcademies = pipelineAcademies.OrderBy(a => a.EstablishmentName).ToArray();
+        var orderedPipelineAcademies = pipelineAcademies.OrderByDescending(a => a.EstablishmentName).ToArray();
 
         foreach (var details in orderedPipelineAcademies)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:79:13
 
         foreach (var details in orderedPipelineAcademies)
         {
-            GeneratePipelineAcademyRow(details);
+            ;
         }
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.Export_ShouldCorrectlyHandleNullValuesAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:85:9
 
     private void GeneratePipelineAcademyRow(AcademyPipelineServiceModel pipelineAcademy)
     {
-        SetTextCell(PipelineAcademiesColumns.SchoolName, pipelineAcademy.EstablishmentName ?? string.Empty);
+        ;
         SetTextCell(PipelineAcademiesColumns.Urn, pipelineAcademy.Urn ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.AgeRange,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:85:58
 
     private void GeneratePipelineAcademyRow(AcademyPipelineServiceModel pipelineAcademy)
     {
-        SetTextCell(PipelineAcademiesColumns.SchoolName, pipelineAcademy.EstablishmentName ?? string.Empty);
+        SetTextCell(PipelineAcademiesColumns.SchoolName, string.Empty);
         SetTextCell(PipelineAcademiesColumns.Urn, pipelineAcademy.Urn ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.AgeRange,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:86:51
     private void GeneratePipelineAcademyRow(AcademyPipelineServiceModel pipelineAcademy)
     {
         SetTextCell(PipelineAcademiesColumns.SchoolName, pipelineAcademy.EstablishmentName ?? string.Empty);
-        SetTextCell(PipelineAcademiesColumns.Urn, pipelineAcademy.Urn ?? string.Empty);
+        SetTextCell(PipelineAcademiesColumns.Urn, string.Empty);
         SetTextCell(PipelineAcademiesColumns.AgeRange,
             pipelineAcademy.AgeRange?.ToTabularDisplayString() ?? "Unconfirmed");
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:86:9
     private void GeneratePipelineAcademyRow(AcademyPipelineServiceModel pipelineAcademy)
     {
         SetTextCell(PipelineAcademiesColumns.SchoolName, pipelineAcademy.EstablishmentName ?? string.Empty);
-        SetTextCell(PipelineAcademiesColumns.Urn, pipelineAcademy.Urn ?? string.Empty);
+        ;
         SetTextCell(PipelineAcademiesColumns.AgeRange,
             pipelineAcademy.AgeRange?.ToTabularDisplayString() ?? "Unconfirmed");
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:87:9
     {
         SetTextCell(PipelineAcademiesColumns.SchoolName, pipelineAcademy.EstablishmentName ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.Urn, pipelineAcademy.Urn ?? string.Empty);
-        SetTextCell(PipelineAcademiesColumns.AgeRange,
-            pipelineAcademy.AgeRange?.ToTabularDisplayString() ?? "Unconfirmed");
+        ;
         SetTextCell(PipelineAcademiesColumns.LocalAuthority, pipelineAcademy.LocalAuthority ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.ProjectType, pipelineAcademy.ProjectType ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.Export_ShouldCorrectlyHandleNullValuesAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:88:13
         SetTextCell(PipelineAcademiesColumns.SchoolName, pipelineAcademy.EstablishmentName ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.Urn, pipelineAcademy.Urn ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.AgeRange,
-            pipelineAcademy.AgeRange?.ToTabularDisplayString() ?? "Unconfirmed");
+            "Unconfirmed");
         SetTextCell(PipelineAcademiesColumns.LocalAuthority, pipelineAcademy.LocalAuthority ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.ProjectType, pipelineAcademy.ProjectType ?? string.Empty);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:89:62
         SetTextCell(PipelineAcademiesColumns.Urn, pipelineAcademy.Urn ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.AgeRange,
             pipelineAcademy.AgeRange?.ToTabularDisplayString() ?? "Unconfirmed");
-        SetTextCell(PipelineAcademiesColumns.LocalAuthority, pipelineAcademy.LocalAuthority ?? string.Empty);
+        SetTextCell(PipelineAcademiesColumns.LocalAuthority, string.Empty);
         SetTextCell(PipelineAcademiesColumns.ProjectType, pipelineAcademy.ProjectType ?? string.Empty);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:89:9
         SetTextCell(PipelineAcademiesColumns.Urn, pipelineAcademy.Urn ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.AgeRange,
             pipelineAcademy.AgeRange?.ToTabularDisplayString() ?? "Unconfirmed");
-        SetTextCell(PipelineAcademiesColumns.LocalAuthority, pipelineAcademy.LocalAuthority ?? string.Empty);
+        ;
         SetTextCell(PipelineAcademiesColumns.ProjectType, pipelineAcademy.ProjectType ?? string.Empty);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:90:59
         SetTextCell(PipelineAcademiesColumns.AgeRange,
             pipelineAcademy.AgeRange?.ToTabularDisplayString() ?? "Unconfirmed");
         SetTextCell(PipelineAcademiesColumns.LocalAuthority, pipelineAcademy.LocalAuthority ?? string.Empty);
-        SetTextCell(PipelineAcademiesColumns.ProjectType, pipelineAcademy.ProjectType ?? string.Empty);
+        SetTextCell(PipelineAcademiesColumns.ProjectType, string.Empty);
 
         if (pipelineAcademy.ChangeDate != null)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:90:9
         SetTextCell(PipelineAcademiesColumns.AgeRange,
             pipelineAcademy.AgeRange?.ToTabularDisplayString() ?? "Unconfirmed");
         SetTextCell(PipelineAcademiesColumns.LocalAuthority, pipelineAcademy.LocalAuthority ?? string.Empty);
-        SetTextCell(PipelineAcademiesColumns.ProjectType, pipelineAcademy.ProjectType ?? string.Empty);
+        ;
 
         if (pipelineAcademy.ChangeDate != null)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:92:13
         SetTextCell(PipelineAcademiesColumns.LocalAuthority, pipelineAcademy.LocalAuthority ?? string.Empty);
         SetTextCell(PipelineAcademiesColumns.ProjectType, pipelineAcademy.ProjectType ?? string.Empty);
 
-        if (pipelineAcademy.ChangeDate != null)
+        if (pipelineAcademy.ChangeDate == null)
         {
             SetDateCell(PipelineAcademiesColumns.ChangeDate, pipelineAcademy.ChangeDate);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.Export_ShouldCorrectlyHandleNullValuesAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:94:13
 
         if (pipelineAcademy.ChangeDate != null)
         {
-            SetDateCell(PipelineAcademiesColumns.ChangeDate, pipelineAcademy.ChangeDate);
+            ;
         }
         else
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheetAsync_ShouldArrangeAcademiesByNameAlphabetically; DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.ExportPipelineAcademiesToSpreadsheet_ShouldCorrectlyExtractPipelineAcademyDataAsync

[Killed] Statement mutation
DfE.FindInformationAcademiesTrusts/Services/Export/PipelineAcademiesExportService.cs:98:13
         }
         else
         {
-            SetTextCell(PipelineAcademiesColumns.ChangeDate, "Unconfirmed");
+            ;
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.PipelineAcademiesExportServiceTests.Export_ShouldCorrectlyHandleNullValuesAsync
