[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:34:13
 
         int latestFinancialYearToDisplay;
 
-        if (financialDocumentType == FinancialDocumentType.SelfAssessmentChecklist)
+        if (financialDocumentType != FinancialDocumentType.SelfAssessmentChecklist)
         {
             // For Self assessment checklist the submission window is 1st January -> 31st December so we are always looking at the financial year ending last calendar year   
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:37:44
         if (financialDocumentType == FinancialDocumentType.SelfAssessmentChecklist)
         {
             // For Self assessment checklist the submission window is 1st January -> 31st December so we are always looking at the financial year ending last calendar year   
-            latestFinancialYearToDisplay = today.Year - 1;
+            latestFinancialYearToDisplay = today.Year + 1;
         }
         else
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that

[Killed] Conditional (false) mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:42:44
         else
         {
             // For all other doc types, the submission window is 1st October -> 30th September
-            latestFinancialYearToDisplay = today.Month >= 10 ? today.Year : today.Year - 1;
+            latestFinancialYearToDisplay = (false?today.Year :today.Year - 1);
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:42:44
         else
         {
             // For all other doc types, the submission window is 1st October -> 30th September
-            latestFinancialYearToDisplay = today.Month >= 10 ? today.Year : today.Year - 1;
+            latestFinancialYearToDisplay = today.Month < 10 ? today.Year : today.Year - 1;
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:48:32
         return
         [
             (new FinancialYear(latestFinancialYearToDisplay), FinancialYearSubmissionWindowStatus.Open),
-            (new FinancialYear(latestFinancialYearToDisplay - 1), FinancialYearSubmissionWindowStatus.Closed),
+            (new FinancialYear(latestFinancialYearToDisplay + 1), FinancialYearSubmissionWindowStatus.Closed),
             (new FinancialYear(latestFinancialYearToDisplay - 2), FinancialYearSubmissionWindowStatus.Closed)
         ];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:49:32
         [
             (new FinancialYear(latestFinancialYearToDisplay), FinancialYearSubmissionWindowStatus.Open),
             (new FinancialYear(latestFinancialYearToDisplay - 1), FinancialYearSubmissionWindowStatus.Closed),
-            (new FinancialYear(latestFinancialYearToDisplay - 2), FinancialYearSubmissionWindowStatus.Closed)
+            (new FinancialYear(latestFinancialYearToDisplay + 2), FinancialYearSubmissionWindowStatus.Closed)
         ];
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialYearsToDisplay_should_return_latest_year_with_open_submission_window_and_two_years_before_that

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:63:68
         var financialDocumentServiceModels = financialYearsToDisplay.Select(year =>
         {
             var financialDocument =
-                allFinancialDocumentsForTrust.SingleOrDefault(d => d.FinancialYear == year.FinancialYear);
+                allFinancialDocumentsForTrust.SingleOrDefault(d => d.FinancialYear != year.FinancialYear);
 
             if (financialDocument != null)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_submitted_when_no_link_for_year_with_closed_submission_window; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_submitted_when_link_exists_even_though_trust_opened_after_financial_year_en; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_expected_when_no_link_and_trust_opened_after_financial_year_ended

[Killed] Linq method mutation (SingleOrDefault() to Single())
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:63:17
         var financialDocumentServiceModels = financialYearsToDisplay.Select(year =>
         {
             var financialDocument =
-                allFinancialDocumentsForTrust.SingleOrDefault(d => d.FinancialYear == year.FinancialYear);
+                allFinancialDocumentsForTrust.Single(d => d.FinancialYear == year.FinancialYear);
 
             if (financialDocument != null)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_submitted_when_no_link_for_year_with_closed_submission_window; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_submitted_when_link_exists_even_though_trust_opened_after_financial_year_en; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_expected_when_no_link_and_trust_opened_after_financial_year_ended

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:65:17
             var financialDocument =
                 allFinancialDocumentsForTrust.SingleOrDefault(d => d.FinancialYear == year.FinancialYear);
 
-            if (financialDocument != null)
+            if (financialDocument == null)
             {
                 return new FinancialDocumentServiceModel(year.FinancialYear, FinancialDocumentStatus.Submitted,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_submitted_when_no_link_for_year_with_closed_submission_window; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_submitted_when_link_exists_even_though_trust_opened_after_financial_year_en; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_expected_when_no_link_and_trust_opened_after_financial_year_ended

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:66:13
                 allFinancialDocumentsForTrust.SingleOrDefault(d => d.FinancialYear == year.FinancialYear);
 
             if (financialDocument != null)
-            {
-                return new FinancialDocumentServiceModel(year.FinancialYear, FinancialDocumentStatus.Submitted,
-                    financialDocument.Link);
-            }
+            {}
 
             var financialDocumentStatus = year switch
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_submitted_when_no_link_for_year_with_closed_submission_window; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_submitted_when_link_exists_even_though_trust_opened_after_financial_year_en; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_expected_when_no_link_and_trust_opened_after_financial_year_ended

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:73:57
 
             var financialDocumentStatus = year switch
             {
-                { FinancialYear.End: var yearEnd } when yearEnd < trustOpenDate => FinancialDocumentStatus.NotExpected,
+                { FinancialYear.End: var yearEnd } when yearEnd > trustOpenDate => FinancialDocumentStatus.NotExpected,
                 { SubmissionWindowStatus: FinancialYearSubmissionWindowStatus.Open } => FinancialDocumentStatus
                     .NotYetSubmitted,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_submitted_when_no_link_for_year_with_closed_submission_window; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_submitted_when_link_exists_even_though_trust_opened_after_financial_year_en; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_expected_when_no_link_and_trust_opened_after_financial_year_ended

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/FinancialDocument/FinancialDocumentService.cs:73:57
 
             var financialDocumentStatus = year switch
             {
-                { FinancialYear.End: var yearEnd } when yearEnd < trustOpenDate => FinancialDocumentStatus.NotExpected,
+                { FinancialYear.End: var yearEnd } when yearEnd <= trustOpenDate => FinancialDocumentStatus.NotExpected,
                 { SubmissionWindowStatus: FinancialYearSubmissionWindowStatus.Open } => FinancialDocumentStatus
                     .NotYetSubmitted,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_submitted_when_no_link_for_year_with_closed_submission_window
