[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/School/SchoolContactsService.cs:17:38
     {
         var schoolContacts = await schoolRepository.GetSchoolContactsAsync(urn);
 
-        var headteacher = new Person(schoolContacts.Name ?? string.Empty, schoolContacts.Email);
+        var headteacher = new Person(string.Empty, schoolContacts.Email);
 
         return headteacher;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolContactsServiceTests.GetInSchoolContactsAsync_should_set_contact_details_from_repository
