[Killed] Negate expression
DfE.FindInformationAcademiesTrusts/Services/School/SchoolOverviewDetailsService.cs:23:13
             schoolDetails.Region, schoolDetails.LocalAuthority, schoolDetails.PhaseOfEducationName,
             schoolDetails.AgeRange, nurseryProvision);
 
-        if (schoolCategory is SchoolCategory.LaMaintainedSchool)
+        if (!(schoolCategory is SchoolCategory.LaMaintainedSchool))
         {
             return overviewModel;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolOverviewDetailsServiceTests.If_school_is_la_maintained_should_not_get_date_joined_trust; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolOverviewDetailsServiceTests.If_school_is_academy_should_return_with_date_joined_trust

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/School/SchoolOverviewDetailsService.cs:24:9
             schoolDetails.AgeRange, nurseryProvision);
 
         if (schoolCategory is SchoolCategory.LaMaintainedSchool)
-        {
-            return overviewModel;
-        }
+        {}
 
         var dateJoinedTrust = await schoolRepository.GetDateJoinedTrustAsync(urn);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolOverviewDetailsServiceTests.If_school_is_la_maintained_should_not_get_date_joined_trust
