[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/School/SchoolService.cs:15:24
 {
     public async Task<SchoolSummaryServiceModel?> GetSchoolSummaryAsync(int urn)
     {
-        var cacheKey = $"{nameof(GetSchoolSummaryAsync)}:{urn}";
+        var cacheKey = $"";
 
         if (memoryCache.TryGetValue(cacheKey, out SchoolSummaryServiceModel? cachedTrustSummary))
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_cached_should_return_cached_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_uncached_should_cache_result

[Killed] Negate expression
DfE.FindInformationAcademiesTrusts/Services/School/SchoolService.cs:17:13
     {
         var cacheKey = $"{nameof(GetSchoolSummaryAsync)}:{urn}";
 
-        if (memoryCache.TryGetValue(cacheKey, out SchoolSummaryServiceModel? cachedTrustSummary))
+        if (!(memoryCache.TryGetValue(cacheKey, out SchoolSummaryServiceModel? cachedTrustSummary)))
         {
             return cachedTrustSummary;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_cached_should_return_cached_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/School/SchoolService.cs:18:9
         var cacheKey = $"{nameof(GetSchoolSummaryAsync)}:{urn}";
 
         if (memoryCache.TryGetValue(cacheKey, out SchoolSummaryServiceModel? cachedTrustSummary))
-        {
-            return cachedTrustSummary;
-        }
+        {}
 
         var summary = await schoolRepository.GetSchoolSummaryAsync(urn);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_cached_should_return_cached_result

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/School/SchoolService.cs:24:13
 
         var summary = await schoolRepository.GetSchoolSummaryAsync(urn);
 
-        if (summary is null)
+        if (summary is not null)
         {
             return null;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_should_return_null_if_not_found; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/School/SchoolService.cs:25:9
         var summary = await schoolRepository.GetSchoolSummaryAsync(urn);
 
         if (summary is null)
-        {
-            return null;
-        }
+        {}
 
         var schoolSummaryServiceModel =
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SchoolServiceTests.GetSchoolSummaryAsync_should_return_null_if_not_found
