[Killed] Negate expression
DfE.FindInformationAcademiesTrusts/Services/Search/SearchService.cs:18:13
 
     public async Task<SearchResultServiceModel[]> GetSearchResultsForAutocompleteAsync(string? keyWords)
     {
-        if (string.IsNullOrWhiteSpace(keyWords))
+        if (!(string.IsNullOrWhiteSpace(keyWords)))
         {
             return [];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_if_keywords_are_null_or_empty_should_return_empty_results; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_if_keywords_are_null_or_empty_should_return_empty_results; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_should_return_correct_mapped_models

[Killed] String mutation
DfE.FindInformationAcademiesTrusts/Services/Search/SearchService.cs:18:13
 
     public async Task<SearchResultServiceModel[]> GetSearchResultsForAutocompleteAsync(string? keyWords)
     {
-        if (string.IsNullOrWhiteSpace(keyWords))
+        if ((keyWords!=""))
         {
             return [];
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_if_keywords_are_null_or_empty_should_return_empty_results; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_should_return_correct_mapped_models

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Search/SearchService.cs:19:9
     public async Task<SearchResultServiceModel[]> GetSearchResultsForAutocompleteAsync(string? keyWords)
     {
         if (string.IsNullOrWhiteSpace(keyWords))
-        {
-            return [];
-        }
+        {}
 
         var results = await trustSchoolSearchRepository.GetAutoCompleteSearchResultsAsync(keyWords);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_if_keywords_are_null_or_empty_should_return_empty_results; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_if_keywords_are_null_or_empty_should_return_empty_results

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Search/SearchService.cs:31:9
     public async Task<PagedSearchResults> GetSearchResultsForPageAsync(string? keyWords, int pageNumber)
     {
         if (string.IsNullOrWhiteSpace(keyWords))
-        {
-            return new PagedSearchResults(PaginatedList<SearchResultServiceModel>.Empty(), new SearchResultsOverview());
-        }
+        {}
 
         var searchResults = await trustSchoolSearchRepository.GetSearchResultsAsync(keyWords, PageSize, pageNumber);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForPageAsync_if_keywords_are_null_or_empty_should_return_empty_results; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForPageAsync_if_keywords_are_null_or_empty_should_return_empty_results

[Killed] Conditional (true) mutation
DfE.FindInformationAcademiesTrusts/Services/Search/SearchService.cs:50:21
     {
         return results.Select(x =>
                 new SearchResultServiceModel(x.Id, x.Name, x.Address, x.TrustReferenceNumber, x.Type,
-                    x.IsTrust ? ResultType.Trust : ResultType.School))
+                    (true?ResultType.Trust :ResultType.School)))
             .ToArray();
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForPageAsync_should_return_correct_mapped_models; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_should_return_correct_mapped_models

[Killed] Conditional (false) mutation
DfE.FindInformationAcademiesTrusts/Services/Search/SearchService.cs:50:21
     {
         return results.Select(x =>
                 new SearchResultServiceModel(x.Id, x.Name, x.Address, x.TrustReferenceNumber, x.Type,
-                    x.IsTrust ? ResultType.Trust : ResultType.School))
+                    (false?ResultType.Trust :ResultType.School)))
             .ToArray();
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForPageAsync_should_return_correct_mapped_models; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForAutocompleteAsync_should_return_correct_mapped_models
