[Killed] Conditional (false) mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustOverviewServiceModel.cs:21:9
     int TotalCapacity)
 {
     public int? PercentageFull =>
-        TotalCapacity > 0
-            ? (int)Math.Round((double)TotalPupilNumbers / TotalCapacity * 100)
-            : null;
+        (false?(int)Math.Round((double)TotalPupilNumbers / TotalCapacity * 100)
+:null);
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustOverviewServiceModel.cs:21:9
     int TotalCapacity)
 {
     public int? PercentageFull =>
-        TotalCapacity > 0
+        TotalCapacity < 0
             ? (int)Math.Round((double)TotalPupilNumbers / TotalCapacity * 100)
             : null;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustOverviewServiceModel.cs:22:31
 {
     public int? PercentageFull =>
         TotalCapacity > 0
-            ? (int)Math.Round((double)TotalPupilNumbers / TotalCapacity * 100)
+            ? (int)Math.Round((double)TotalPupilNumbers * TotalCapacity * 100)
             : null;
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustOverviewServiceModel.cs:22:31
 {
     public int? PercentageFull =>
         TotalCapacity > 0
-            ? (int)Math.Round((double)TotalPupilNumbers / TotalCapacity * 100)
+            ? (int)Math.Round((double)TotalPupilNumbers / TotalCapacity / 100)
             : null;
 }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustOverviewServiceModelTests.PercentageFull_ReturnsCorrectValue
