[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:36:13
     {
         var uid = await academyRepository.GetTrustUidFromAcademyUrnAsync(urn);
 
-        if (uid is null)
+        if (uid is not null)
         {
             return null;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustSummaryAsync_should_return_null_if_trust_uid_is_null; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustSummaryAsync_should_return_trust_summary_if_found

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:37:9
         var uid = await academyRepository.GetTrustUidFromAcademyUrnAsync(urn);
 
         if (uid is null)
-        {
-            return null;
-        }
+        {}
 
         return await GetTrustSummaryAsync(uid);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustSummaryAsync_should_return_null_if_trust_uid_is_null

[Killed] Negate expression
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:48:13
     {
         var cacheKey = $"{nameof(TrustService)}:{uid}";
 
-        if (memoryCache.TryGetValue(cacheKey, out TrustSummaryServiceModel? cachedTrustSummary))
+        if (!(memoryCache.TryGetValue(cacheKey, out TrustSummaryServiceModel? cachedTrustSummary)))
         {
             return cachedTrustSummary!;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustSummaryAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustSummaryAsync_uncached_should_cache_result; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustSummaryAsync_uncached_should_cache_result

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:49:9
         var cacheKey = $"{nameof(TrustService)}:{uid}";
 
         if (memoryCache.TryGetValue(cacheKey, out TrustSummaryServiceModel? cachedTrustSummary))
-        {
-            return cachedTrustSummary!;
-        }
+        {}
 
         var summary = await trustRepository.GetTrustSummaryAsync(uid);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustSummaryAsync_cached_should_return_cached_result

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:71:5
     }
 
     public async Task<TrustGovernanceServiceModel> GetTrustGovernanceAsync(string uid)
-    {
-        var urn = await academyRepository.GetSingleAcademyTrustAcademyUrnAsync(uid);
-
-        var trustGovernance = await trustRepository.GetTrustGovernanceAsync(uid, urn);
-
-        var governanceTurnover = GetGovernanceTurnoverRate(trustGovernance);
-
-        return new TrustGovernanceServiceModel(
-            trustGovernance.CurrentTrustLeadership,
-            trustGovernance.CurrentMembers,
-            trustGovernance.CurrentTrustees,
-            trustGovernance.HistoricMembers,
-            governanceTurnover);
-    }
+    {}
 
     public async Task<TrustContactsServiceModel> GetTrustContactsAsync(string uid)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustGovernanceAsync_should_get_governanceResults_for_single_trust

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:87:5
     }
 
     public async Task<TrustContactsServiceModel> GetTrustContactsAsync(string uid)
-    {
-        var urn = await academyRepository.GetSingleAcademyTrustAcademyUrnAsync(uid);
-
-        var trustContacts =
-            await trustRepository.GetTrustContactsAsync(uid, urn);
-        var internalContacts = await contactRepository.GetInternalContactsAsync(uid);
-
-        return new TrustContactsServiceModel(
-            internalContacts.TrustRelationshipManager,
-            internalContacts.SfsoLead,
-            ChairOfTrustees: trustContacts.ChairOfTrustees,
-            AccountingOfficer: trustContacts.AccountingOfficer,
-            ChiefFinancialOfficer: trustContacts.ChiefFinancialOfficer
-        );
-    }
+    {}
 
     public async Task<TrustContactUpdatedServiceModel> UpdateContactAsync(int uid, string? name, string? email,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustContactsAsync_should_get_governanceResults_for_single_trust

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:105:5
 
     public async Task<TrustContactUpdatedServiceModel> UpdateContactAsync(int uid, string? name, string? email,
         ContactRole role)
-    {
-        var (emailChanged, nameChanged) = await contactRepository.UpdateInternalContactsAsync(uid, name, email, role);
-
-        return new TrustContactUpdatedServiceModel(emailChanged, nameChanged);
-    }
+    {}
 
     public async Task<TrustOverviewServiceModel> GetTrustOverviewAsync(string uid)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.UpdateContactsAsync_returns_the_correct_values_changed; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.UpdateContactsAsync_returns_the_correct_values_changed; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.UpdateContactsAsync_returns_the_correct_values_changed

[Killed] Conditional (false) mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:121:44
             _ => throw new InvalidOperationException($"Unknown trust type: {trustOverview.Type}")
         };
 
-        var singleAcademyTrustAcademyUrn = trustType is TrustType.SingleAcademyTrust
-            ? await academyRepository.GetSingleAcademyTrustAcademyUrnAsync(uid)
-            : null;
+        var singleAcademyTrustAcademyUrn = (false?await academyRepository.GetSingleAcademyTrustAcademyUrnAsync(uid)
+:null);
 
         var academiesOverview = await academyRepository.GetOverviewOfAcademiesInTrustAsync(uid);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_should_get_singleAcademyTrustAcademyUrn_from_academy_repository_when_trust_is_single_academy_trust; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_should_get_singleAcademyTrustAcademyUrn_from_academy_repository_when_trust_is_single_academy_trust

[Killed] Conditional (true) mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:121:44
             _ => throw new InvalidOperationException($"Unknown trust type: {trustOverview.Type}")
         };
 
-        var singleAcademyTrustAcademyUrn = trustType is TrustType.SingleAcademyTrust
-            ? await academyRepository.GetSingleAcademyTrustAcademyUrnAsync(uid)
-            : null;
+        var singleAcademyTrustAcademyUrn = (true?await academyRepository.GetSingleAcademyTrustAcademyUrnAsync(uid)
+:null);
 
         var academiesOverview = await academyRepository.GetOverviewOfAcademiesInTrustAsync(uid);
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_should_not_get_singleAcademyTrustAcademyUrn_when_trust_is_multi_academy_trust

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:133:60
             .GroupBy(a => a.LocalAuthority)
             .ToDictionary(g => g.Key, g => g.Count());
 
-        var totalPupilNumbers = academiesOverview.Sum(a => a.NumberOfPupils ?? 0);
+        var totalPupilNumbers = academiesOverview.Sum(a => 0);
         var totalCapacity = academiesOverview.Sum(a => a.SchoolCapacity ?? 0);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_returns_correct_overview_for_trust_with_academies

[Killed] Linq method mutation (Sum() to Max())
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:133:33
             .GroupBy(a => a.LocalAuthority)
             .ToDictionary(g => g.Key, g => g.Count());
 
-        var totalPupilNumbers = academiesOverview.Sum(a => a.NumberOfPupils ?? 0);
+        var totalPupilNumbers = academiesOverview.Max(a => a.NumberOfPupils ?? 0);
         var totalCapacity = academiesOverview.Sum(a => a.SchoolCapacity ?? 0);
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_returns_correct_overview_for_trust_with_academies; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_should_set_properties_from_TrustRepo; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_returns_zero_values_for_trust_with_no_academies

[Killed] Linq method mutation (Sum() to Max())
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:134:29
             .ToDictionary(g => g.Key, g => g.Count());
 
         var totalPupilNumbers = academiesOverview.Sum(a => a.NumberOfPupils ?? 0);
-        var totalCapacity = academiesOverview.Sum(a => a.SchoolCapacity ?? 0);
+        var totalCapacity = academiesOverview.Max(a => a.SchoolCapacity ?? 0);
 
         var overviewModel = new TrustOverviewServiceModel(
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_returns_correct_overview_for_trust_with_academies; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_should_set_properties_from_TrustRepo; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_returns_zero_values_for_trust_with_no_academies

[Killed] Null coalescing mutation (remove left)
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:134:56
             .ToDictionary(g => g.Key, g => g.Count());
 
         var totalPupilNumbers = academiesOverview.Sum(a => a.NumberOfPupils ?? 0);
-        var totalCapacity = academiesOverview.Sum(a => a.SchoolCapacity ?? 0);
+        var totalCapacity = academiesOverview.Sum(a => 0);
 
         var overviewModel = new TrustOverviewServiceModel(
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetTrustOverviewAsync_returns_correct_overview_for_trust_with_academies

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:159:48
         var today = dateTimeProvider.Today;
 
         // Past 12 Months 
-        var past12MonthsStart = today.AddYears(-1);
+        var past12MonthsStart = today.AddYears(+1);
 
         // Get current governors (Trustees and Members)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernanceTurnoverRate_Calculates_CorrectTurnover

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:187:27
             today
         );
 
-        int totalEvents = appointmentsInPast12Months + resignationsInPast12Months;
+        int totalEvents = appointmentsInPast12Months - resignationsInPast12Months;
         return CalculateTurnoverRate(totalCurrentGovernors, totalEvents);
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernanceTurnoverRate_Calculates_CorrectTurnover

[Killed] Conditional (false) mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:194:16
     public static decimal CalculateTurnoverRate(int totalCurrentGovernors, int totalEvents)
     {
         // Calculate turnover rate and round to 1 decimal point
-        return totalCurrentGovernors > 0
-            ? Math.Round((decimal)totalEvents / totalCurrentGovernors * 100m, 1)
-            : 0m;
+        return (false?Math.Round((decimal)totalEvents / totalCurrentGovernors * 100m, 1)
+:0m);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:194:16
     public static decimal CalculateTurnoverRate(int totalCurrentGovernors, int totalEvents)
     {
         // Calculate turnover rate and round to 1 decimal point
-        return totalCurrentGovernors > 0
+        return totalCurrentGovernors >= 0
             ? Math.Round((decimal)totalEvents / totalCurrentGovernors * 100m, 1)
             : 0m;
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Returns_Zero_When_TotalCurrentGovernors_Is_Zero; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Returns_Zero_When_TotalCurrentGovernors_Is_Zero; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernanceTurnoverRate_Returns_Zero_When_No_CurrentGovernors

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:195:26
     {
         // Calculate turnover rate and round to 1 decimal point
         return totalCurrentGovernors > 0
-            ? Math.Round((decimal)totalEvents / totalCurrentGovernors * 100m, 1)
+            ? Math.Round((decimal)totalEvents / totalCurrentGovernors / 100m, 1)
             : 0m;
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero

[Killed] Arithmetic mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:195:26
     {
         // Calculate turnover rate and round to 1 decimal point
         return totalCurrentGovernors > 0
-            ? Math.Round((decimal)totalEvents / totalCurrentGovernors * 100m, 1)
+            ? Math.Round((decimal)totalEvents * totalCurrentGovernors * 100m, 1)
             : 0m;
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CalculateTurnoverRate_Calculates_CorrectRate_When_TotalCurrentGovernors_Is_Greater_Than_Zero

[Killed] Linq method mutation (Concat() to Except())
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:201:16
 
     public static List<Governor> GetGovernorsExcludingLeadership(TrustGovernance trustGovernance)
     {
-        return trustGovernance.CurrentTrustees
-                    .Concat(trustGovernance.CurrentMembers)
-                    .Concat(trustGovernance.HistoricMembers)
+        return trustGovernance.CurrentTrustees
+                    .Concat(trustGovernance.CurrentMembers)
+                    .Except(trustGovernance.HistoricMembers)
                     .Where(g => !g.HasRoleLeadership)
                     .ToList();
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernanceTurnoverRate_Calculates_CorrectTurnover

[Killed] Linq method mutation (Concat() to Except())
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:201:16
 
     public static List<Governor> GetGovernorsExcludingLeadership(TrustGovernance trustGovernance)
     {
-        return trustGovernance.CurrentTrustees
-                    .Concat(trustGovernance.CurrentMembers)
+        return trustGovernance.CurrentTrustees
+                    .Except(trustGovernance.CurrentMembers)
                     .Concat(trustGovernance.HistoricMembers)
                     .Where(g => !g.HasRoleLeadership)
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernorsExcludingLeadership_Excludes_LeadershipRoles

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:204:33
         return trustGovernance.CurrentTrustees
                     .Concat(trustGovernance.CurrentMembers)
                     .Concat(trustGovernance.HistoricMembers)
-                    .Where(g => !g.HasRoleLeadership)
+                    .Where(g => g.HasRoleLeadership)
                     .ToList();
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernorsExcludingLeadership_Excludes_LeadershipRoles; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernanceTurnoverRate_Calculates_CorrectTurnover

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:217:36
 
     public static int CountEventsWithinDateRange<T>(IEnumerable<T> items, Func<T, DateTime?> dateSelector, DateTime rangeStart, DateTime rangeEnd)
     {
-        return items.Count(item => dateSelector(item) != null &&
-                                   dateSelector(item) >= rangeStart &&
+        return items.Count(item => dateSelector(item) != null ||
+                                   dateSelector(item) >= rangeStart &&
                                    dateSelector(item) <= rangeEnd);
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:217:36
 
     public static int CountEventsWithinDateRange<T>(IEnumerable<T> items, Func<T, DateTime?> dateSelector, DateTime rangeStart, DateTime rangeEnd)
     {
-        return items.Count(item => dateSelector(item) != null &&
-                                   dateSelector(item) >= rangeStart &&
-                                   dateSelector(item) <= rangeEnd);
+        return items.Count(item => dateSelector(item) != null &&
+                                   dateSelector(item) >= rangeStart ||
+                                   dateSelector(item) <= rangeEnd);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:218:36
     public static int CountEventsWithinDateRange<T>(IEnumerable<T> items, Func<T, DateTime?> dateSelector, DateTime rangeStart, DateTime rangeEnd)
     {
         return items.Count(item => dateSelector(item) != null &&
-                                   dateSelector(item) >= rangeStart &&
+                                   dateSelector(item) < rangeStart &&
                                    dateSelector(item) <= rangeEnd);
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:218:36
     public static int CountEventsWithinDateRange<T>(IEnumerable<T> items, Func<T, DateTime?> dateSelector, DateTime rangeStart, DateTime rangeEnd)
     {
         return items.Count(item => dateSelector(item) != null &&
-                                   dateSelector(item) >= rangeStart &&
+                                   dateSelector(item) > rangeStart &&
                                    dateSelector(item) <= rangeEnd);
     }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:219:36
     {
         return items.Count(item => dateSelector(item) != null &&
                                    dateSelector(item) >= rangeStart &&
-                                   dateSelector(item) <= rangeEnd);
+                                   dateSelector(item) > rangeEnd);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:219:36
     {
         return items.Count(item => dateSelector(item) != null &&
                                    dateSelector(item) >= rangeStart &&
-                                   dateSelector(item) <= rangeEnd);
+                                   dateSelector(item) < rangeEnd);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.CountEventsWithinDateRange_Calculates_CorrectCount

[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts/Services/Trust/TrustService.cs:223:5
     }
 
     public async Task<string> GetTrustReferenceNumberAsync(string uid)
-    {
-        return await trustRepository.GetTrustReferenceNumberAsync(uid);
-    }
+    {}
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceTests.GetAcademyTrustTrustReferenceNumberAsync_should_return_trust_reference_number_when_found
