[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:15:9
     private static readonly string[] SupportedEstablishmentTypeGroups =
     [
         "Academies",
-        "Colleges",
+        "",
         "Free Schools",
         "Local authority maintained schools",
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentsQueryFilter_should_filter_for_supported_school_types

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:16:9
     [
         "Academies",
         "Colleges",
-        "Free Schools",
+        "",
         "Local authority maintained schools",
         "Special schools"
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentsQueryFilter_should_filter_for_supported_school_types

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:17:9
         "Academies",
         "Colleges",
         "Free Schools",
-        "Local authority maintained schools",
+        "",
         "Special schools"
     ];
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:23:13
 
     public static readonly Expression<Func<GiasEstablishment, bool>> GiasEstablishmentsQueryFilter =
         e => 
-            e.EstablishmentStatusName != null &&
+            e.EstablishmentStatusName == null &&
             e.EstablishmentTypeGroupName != null &&
             e.EstablishmentName != null &&
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:23:13
 
     public static readonly Expression<Func<GiasEstablishment, bool>> GiasEstablishmentsQueryFilter =
         e => 
-            e.EstablishmentStatusName != null &&
-            e.EstablishmentTypeGroupName != null &&
-            e.EstablishmentName != null &&
+            e.EstablishmentStatusName != null &&
+            e.EstablishmentTypeGroupName != null ||
+            e.EstablishmentName != null &&
             SupportedEstablishmentTypeGroups.Contains(e.EstablishmentTypeGroupName) &&
              e.EstablishmentStatusName != "Closed";
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentsQueryFilter_should_filter_nullable_columns_that_can_never_contain_null_data

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:24:13
     public static readonly Expression<Func<GiasEstablishment, bool>> GiasEstablishmentsQueryFilter =
         e => 
             e.EstablishmentStatusName != null &&
-            e.EstablishmentTypeGroupName != null &&
+            e.EstablishmentTypeGroupName == null &&
             e.EstablishmentName != null &&
             SupportedEstablishmentTypeGroups.Contains(e.EstablishmentTypeGroupName) &&
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:25:13
         e => 
             e.EstablishmentStatusName != null &&
             e.EstablishmentTypeGroupName != null &&
-            e.EstablishmentName != null &&
+            e.EstablishmentName == null &&
             SupportedEstablishmentTypeGroups.Contains(e.EstablishmentTypeGroupName) &&
              e.EstablishmentStatusName != "Closed";
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:27:14
             e.EstablishmentTypeGroupName != null &&
             e.EstablishmentName != null &&
             SupportedEstablishmentTypeGroups.Contains(e.EstablishmentTypeGroupName) &&
-             e.EstablishmentStatusName != "Closed";
+             e.EstablishmentStatusName == "Closed";
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishment.cs:27:43
             e.EstablishmentTypeGroupName != null &&
             e.EstablishmentName != null &&
             SupportedEstablishmentTypeGroups.Contains(e.EstablishmentTypeGroupName) &&
-             e.EstablishmentStatusName != "Closed";
+             e.EstablishmentStatusName != "";
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentsQueryFilterTests.GiasEstablishmentQueryFilter_should_filter_for_establishment_status
