[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishmentLink.cs:13:16
     public DbSet<GiasEstablishmentLink> GiasEstablishmentLink { get; set; }
     
     public static readonly Expression<Func<GiasEstablishmentLink, bool>> GiasEstablishmentLinkQueryFilter =
-        gel => gel.Urn != null
+        gel => gel.Urn == null
                && gel.LinkUrn != null
                && gel.LinkType != null;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentLinkQueryFilterTests.GiasEstablishmentLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_null

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishmentLink.cs:13:16
     public DbSet<GiasEstablishmentLink> GiasEstablishmentLink { get; set; }
     
     public static readonly Expression<Func<GiasEstablishmentLink, bool>> GiasEstablishmentLinkQueryFilter =
-        gel => gel.Urn != null
-               && gel.LinkUrn != null
+        gel => gel.Urn != null
+               || gel.LinkUrn != null
                && gel.LinkType != null;
     
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentLinkQueryFilterTests.GiasEstablishmentLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_null

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishmentLink.cs:14:19
     
     public static readonly Expression<Func<GiasEstablishmentLink, bool>> GiasEstablishmentLinkQueryFilter =
         gel => gel.Urn != null
-               && gel.LinkUrn != null
+               && gel.LinkUrn == null
                && gel.LinkType != null;
     
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasEstablishmentLinkQueryFilterTests.GiasEstablishmentLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_null

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasEstablishmentLink.cs:15:19
     public static readonly Expression<Func<GiasEstablishmentLink, bool>> GiasEstablishmentLinkQueryFilter =
         gel => gel.Urn != null
                && gel.LinkUrn != null
-               && gel.LinkType != null;
+               && gel.LinkType == null;
     
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_query_further_ed_for_urns_not_in_mis_establishments_when_urn
