[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroup.cs:15:14
     // We specifically filter out nulls to improve SQL Server query performance and reliability when searching for a
     // value in a nullable column - https://learn.microsoft.com/en-us/ef/core/querying/null-comparisons
     public static readonly Expression<Func<GiasGroup, bool>> GiasGroupQueryFilter =
-        g => g.GroupUid != null &&
-             g.GroupName != null &&
-             g.GroupType != null &&
-             g.GroupStatusCode != null &&
-             (g.GroupStatusCode == "OPEN" || g.GroupStatusCode == "PROPOSED_TO_CLOSE");
+        g => g.GroupUid != null &&
+             g.GroupName != null &&
+             g.GroupType != null &&
+             g.GroupStatusCode != null ||
+             (g.GroupStatusCode == "OPEN" || g.GroupStatusCode == "PROPOSED_TO_CLOSE");
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupQueryFilterTests.GiasGroupQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupQueryFilterTests.GiasGroupQueryFilter_should_filter_nullable_columns_that_can_never_contain_null_data

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroup.cs:15:14
     // We specifically filter out nulls to improve SQL Server query performance and reliability when searching for a
     // value in a nullable column - https://learn.microsoft.com/en-us/ef/core/querying/null-comparisons
     public static readonly Expression<Func<GiasGroup, bool>> GiasGroupQueryFilter =
-        g => g.GroupUid != null &&
-             g.GroupName != null &&
+        g => g.GroupUid != null ||
+             g.GroupName != null &&
              g.GroupType != null &&
              g.GroupStatusCode != null &&
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupQueryFilterTests.GiasGroupQueryFilter_should_filter_nullable_columns_that_can_never_contain_null_data

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroup.cs:16:14
     // value in a nullable column - https://learn.microsoft.com/en-us/ef/core/querying/null-comparisons
     public static readonly Expression<Func<GiasGroup, bool>> GiasGroupQueryFilter =
         g => g.GroupUid != null &&
-             g.GroupName != null &&
+             g.GroupName == null &&
              g.GroupType != null &&
              g.GroupStatusCode != null &&
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_newest_doc_when_more_than_one_in_year; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroup.cs:17:14
     public static readonly Expression<Func<GiasGroup, bool>> GiasGroupQueryFilter =
         g => g.GroupUid != null &&
              g.GroupName != null &&
-             g.GroupType != null &&
+             g.GroupType == null &&
              g.GroupStatusCode != null &&
              (g.GroupStatusCode == "OPEN" || g.GroupStatusCode == "PROPOSED_TO_CLOSE");
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_newest_doc_when_more_than_one_in_year; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroup.cs:18:14
         g => g.GroupUid != null &&
              g.GroupName != null &&
              g.GroupType != null &&
-             g.GroupStatusCode != null &&
+             g.GroupStatusCode == null &&
              (g.GroupStatusCode == "OPEN" || g.GroupStatusCode == "PROPOSED_TO_CLOSE");
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_set_properties_from_giasGroup; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroup.cs:19:15
              g.GroupName != null &&
              g.GroupType != null &&
              g.GroupStatusCode != null &&
-             (g.GroupStatusCode == "OPEN" || g.GroupStatusCode == "PROPOSED_TO_CLOSE");
+             (g.GroupStatusCode != "OPEN" || g.GroupStatusCode == "PROPOSED_TO_CLOSE");
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_set_properties_from_giasGroup; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroup.cs:19:46
              g.GroupName != null &&
              g.GroupType != null &&
              g.GroupStatusCode != null &&
-             (g.GroupStatusCode == "OPEN" || g.GroupStatusCode == "PROPOSED_TO_CLOSE");
+             (g.GroupStatusCode == "OPEN" || g.GroupStatusCode != "PROPOSED_TO_CLOSE");
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupQueryFilterTests.GiasGroupQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupQueryFilterTests.GiasGroupQueryFilter_should_filter_on_group_status
