[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroupLink.cs:13:15
     public DbSet<GiasGroupLink> GiasGroupLinks { get; set; }
 
     public static readonly Expression<Func<GiasGroupLink, bool>> GiasGroupLinkQueryFilter =
-        gl => gl.Urn != null &&
-              gl.GroupUid != null &&
+        gl => gl.Urn != null ||
+              gl.GroupUid != null &&
               (gl.GroupStatusCode == "OPEN" || gl.GroupStatusCode == "PROPOSED_TO_CLOSE");
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_null_data

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroupLink.cs:13:15
     public DbSet<GiasGroupLink> GiasGroupLinks { get; set; }
 
     public static readonly Expression<Func<GiasGroupLink, bool>> GiasGroupLinkQueryFilter =
-        gl => gl.Urn != null &&
+        gl => gl.Urn == null &&
               gl.GroupUid != null &&
               (gl.GroupStatusCode == "OPEN" || gl.GroupStatusCode == "PROPOSED_TO_CLOSE");
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_null_data

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroupLink.cs:14:15
 
     public static readonly Expression<Func<GiasGroupLink, bool>> GiasGroupLinkQueryFilter =
         gl => gl.Urn != null &&
-              gl.GroupUid != null &&
+              gl.GroupUid == null &&
               (gl.GroupStatusCode == "OPEN" || gl.GroupStatusCode == "PROPOSED_TO_CLOSE");
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_null_data

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroupLink.cs:15:16
     public static readonly Expression<Func<GiasGroupLink, bool>> GiasGroupLinkQueryFilter =
         gl => gl.Urn != null &&
               gl.GroupUid != null &&
-              (gl.GroupStatusCode == "OPEN" || gl.GroupStatusCode == "PROPOSED_TO_CLOSE");
+              (gl.GroupStatusCode == "OPEN" && gl.GroupStatusCode == "PROPOSED_TO_CLOSE");
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_null_data

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.GiasGroupLink.cs:15:48
     public static readonly Expression<Func<GiasGroupLink, bool>> GiasGroupLinkQueryFilter =
         gl => gl.Urn != null &&
               gl.GroupUid != null &&
-              (gl.GroupStatusCode == "OPEN" || gl.GroupStatusCode == "PROPOSED_TO_CLOSE");
+              (gl.GroupStatusCode == "OPEN" || gl.GroupStatusCode != "PROPOSED_TO_CLOSE");
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_on_group_status; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.GiasGroupLinkQueryFilterTests.GiasGroupLinkQueryFilter_should_filter_on_group_status
