[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.SharePointTrustDocLinks.cs:13:16
     public DbSet<SharepointTrustDocLink> SharepointTrustDocLinks { get; set; }
 
     public static readonly Expression<Func<SharepointTrustDocLink, bool>> SharepointTrustDocLinkQueryFilter =
-        doc => doc.DocumentLink != null
-               && doc.TrustRefNumber != null;
+        doc => doc.DocumentLink != null
+               || doc.TrustRefNumber != null;
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.SharepointTrustDocLinkQueryFilterTests.SharepointTrustDocLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_nu

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.SharePointTrustDocLinks.cs:13:16
     public DbSet<SharepointTrustDocLink> SharepointTrustDocLinks { get; set; }
 
     public static readonly Expression<Func<SharepointTrustDocLink, bool>> SharepointTrustDocLinkQueryFilter =
-        doc => doc.DocumentLink != null
+        doc => doc.DocumentLink == null
                && doc.TrustRefNumber != null;
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_newest_doc_when_more_than_one_in_year; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Contexts/AcademiesDbContext.SharePointTrustDocLinks.cs:14:19
 
     public static readonly Expression<Func<SharepointTrustDocLink, bool>> SharepointTrustDocLinkQueryFilter =
         doc => doc.DocumentLink != null
-               && doc.TrustRefNumber != null;
+               && doc.TrustRefNumber == null;
 
     [ExcludeFromCodeCoverage]
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Contexts.SharepointTrustDocLinkQueryFilterTests.SharepointTrustDocLinkQueryFilter_should_filter_nullable_columns_that_can_never_contain_nu
