[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Converters/YesNoValueToBooleanConverter.cs:12:13
 {
     private static bool? ConvertYesNoString(string? input)
     {
-        if (string.IsNullOrEmpty(input))
+        if (!(string.IsNullOrEmpty(input)))
         {
             return null;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Converters.YesNoValueToBooleanConverterTests.ConvertFrom_ShouldCorrectlyParseYesOrNo_IntoBool; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Converters.YesNoValueToBooleanConverterTests.ConvertFrom_ShouldCorrectlyParseYesOrNo_IntoBool; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Converters.YesNoValueToBooleanConverterTests.ConvertFrom_ShouldCorrectlyParseYesOrNo_IntoBool

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Converters/YesNoValueToBooleanConverter.cs:13:9
     private static bool? ConvertYesNoString(string? input)
     {
         if (string.IsNullOrEmpty(input))
-        {
-            return null;
-        }
+        {}
 
         return input.Equals("yes", StringComparison.CurrentCultureIgnoreCase);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Converters.YesNoValueToBooleanConverterTests.ConvertFrom_ShouldCorrectlyParseYesOrNo_IntoBool

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Converters/YesNoValueToBooleanConverter.cs:22:13
 
     private static string? ConvertBoolToYesNoString(bool? input)
     {
-        if (input is null)
+        if (input is not null)
         {
             return null;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Converters.YesNoValueToBooleanConverterTests.ConvertTo_ShouldCorrectlyParseBool_IntoYesNoString; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Converters.YesNoValueToBooleanConverterTests.ConvertTo_ShouldCorrectlyParseBool_IntoYesNoString

[NoCoverage] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Converters/YesNoValueToBooleanConverter.cs:23:9
     private static string? ConvertBoolToYesNoString(bool? input)
     {
         if (input is null)
-        {
-            return null;
-        }
+        {}
 
         return input.Value ? "Yes" : "No";

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Converters/YesNoValueToBooleanConverter.cs:27:16
             return null;
         }
 
-        return input.Value ? "Yes" : "No";
+        return (true?"Yes" :"No");
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Converters.YesNoValueToBooleanConverterTests.ConvertTo_ShouldCorrectlyParseBool_IntoYesNoString

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Converters/YesNoValueToBooleanConverter.cs:27:16
             return null;
         }
 
-        return input.Value ? "Yes" : "No";
+        return (false?"Yes" :"No");
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Converters.YesNoValueToBooleanConverterTests.ConvertTo_ShouldCorrectlyParseBool_IntoYesNoString
