[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/IQueryableExtensions.cs:13:13
     public static IQueryable<GiasGroup> Trusts(this IQueryable<GiasGroup> giasGroups)
     {
         return giasGroups.Where(g =>
-            g.GroupId != null &&
-            (g.GroupType == MultiAcademyTrust || g.GroupType == SingleAcademyTrust)
+            g.GroupId != null ||
+            (g.GroupType == MultiAcademyTrust || g.GroupType == SingleAcademyTrust)
         );
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroup_Trusts_should_filter_on_group_type; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroup_Trusts_should_filter_out_null_groupId_as_it_is_never_null_for_a_trust

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/IQueryableExtensions.cs:13:13
     public static IQueryable<GiasGroup> Trusts(this IQueryable<GiasGroup> giasGroups)
     {
         return giasGroups.Where(g =>
-            g.GroupId != null &&
+            g.GroupId == null &&
             (g.GroupType == MultiAcademyTrust || g.GroupType == SingleAcademyTrust)
         );
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_set_properties_from_giasGroup; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/IQueryableExtensions.cs:14:14
     {
         return giasGroups.Where(g =>
             g.GroupId != null &&
-            (g.GroupType == MultiAcademyTrust || g.GroupType == SingleAcademyTrust)
+            (g.GroupType != MultiAcademyTrust || g.GroupType == SingleAcademyTrust)
         );
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_set_properties_from_giasGroup; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/IQueryableExtensions.cs:14:50
     {
         return giasGroups.Where(g =>
             g.GroupId != null &&
-            (g.GroupType == MultiAcademyTrust || g.GroupType == SingleAcademyTrust)
+            (g.GroupType == MultiAcademyTrust || g.GroupType != SingleAcademyTrust)
         );
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroup_Trusts_should_filter_on_group_type

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/IQueryableExtensions.cs:22:14
     {
         return giasGroups.Where(g =>
             g.GroupId != null &&
-            (g.GroupType == MultiAcademyTrust || g.GroupType == SingleAcademyTrust)
+            (g.GroupType == MultiAcademyTrust && g.GroupType == SingleAcademyTrust)
         );
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroupLink_Trusts_should_filter_out_null_groupId_as_it_is_never_null_for_a_trust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroupLink_Trusts_should_filter_on_group_type; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetTrustUidFromAcademyUrnAsync_should_throw_if_more_than_one_link_between_academy_and_trust

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/IQueryableExtensions.cs:29:13
     public static IQueryable<GiasGroupLink> SingleAcademyTrusts(this IQueryable<GiasGroupLink> giasGroups)
     {
         return giasGroups.Where(g =>
-            g.GroupId != null &&
-            g.GroupType == SingleAcademyTrust);
+            g.GroupId != null ||
+            g.GroupType == SingleAcademyTrust);
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroupLink_SingleAcademyTrusts_should_filter_on_group_type; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroupLink_SingleAcademyTrusts_should_filter_out_null_groupId_as_it_is_never_null_for_a_trust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetUrnForSingleAcademyTrustAsync_should_set_singleAcademyTrustAcademyUrn_to_null_when_multi_academy_tr

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/IQueryableExtensions.cs:30:13
     {
         return giasGroups.Where(g =>
             g.GroupId != null &&
-            g.GroupType == SingleAcademyTrust);
+            g.GroupType != SingleAcademyTrust);
     }
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroupLink_SingleAcademyTrusts_should_filter_on_group_type; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.IQueryableExtensionsTests.GiasGroupLink_SingleAcademyTrusts_should_filter_out_null_groupId_as_it_is_never_null_for_a_trust
