[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:8:55
     public static OfstedRatingScore ConvertOverallEffectivenessToOfstedRatingScore(this string? rating)
     {
         // Check if it is 'Not judged' all other gradings are int based
-        if (rating?.ToLower().Equals("not judged") ?? false)
+        if (rating?.ToLower().Equals("not judged") ?? true)
         {
             return OfstedRatingScore.SingleHeadlineGradeNotAvailable;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_handle_not_inspected_when_not_further_ed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_remove_single_headline_grades_for_further_ed_issued_after_2nd

[Killed] Null coalescing mutation (remove left)
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:8:13
     public static OfstedRatingScore ConvertOverallEffectivenessToOfstedRatingScore(this string? rating)
     {
         // Check if it is 'Not judged' all other gradings are int based
-        if (rating?.ToLower().Equals("not judged") ?? false)
+        if (false)
         {
             return OfstedRatingScore.SingleHeadlineGradeNotAvailable;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertOverallEffectivenessToOfstedRatingScore_Should_Return_NoJudgement_When_Rating_Is_NotJudged_CaseIns; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertOverallEffectivenessToOfstedRatingScore_Should_Return_NoJudgement_When_Rating_Is_NotJudged_CaseIns; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertOverallEffectivenessToOfstedRatingScore_Should_Return_NoJudgement_When_Rating_Is_NotJudged_CaseIns

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:9:9
     {
         // Check if it is 'Not judged' all other gradings are int based
         if (rating?.ToLower().Equals("not judged") ?? false)
-        {
-            return OfstedRatingScore.SingleHeadlineGradeNotAvailable;
-        }
+        {}
 
         return ConvertNullableStringToOfstedRatingScore(rating);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_log_error_for_valid_overall_effectiveness; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertOverallEffectivenessToOfstedRatingScore_Should_Return_NoJudgement_When_Rating_Is_NotJudged_CaseIns

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:18:13
 
     public static OfstedRatingScore ToOfstedRatingScore(this int? rating)
     {
-        if (rating is null)
+        if (rating is not null)
             return OfstedRatingScore.NotInspected;
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_ofsted_judgements_when_further_ed

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:21:13
         if (rating is null)
             return OfstedRatingScore.NotInspected;
 
-        if (Enum.IsDefined(typeof(OfstedRatingScore), rating))
+        if (!(Enum.IsDefined(typeof(OfstedRatingScore), rating)))
             return (OfstedRatingScore)rating;
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_ofsted_judgements_when_further_ed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_query_further_ed_for_urns_not_in_mis_establishments_when_urn

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:33:13
             return OfstedRatingScore.NotInspected;
 
         // Attempt to parse the string as an integer then cast to enum
-        if (int.TryParse(rating, out var intRating) && Enum.IsDefined(typeof(OfstedRatingScore), intRating))
+        if (int.TryParse(rating, out var intRating) || Enum.IsDefined(typeof(OfstedRatingScore), intRating))
         {
             return (OfstedRatingScore)intRating;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:33:13
             return OfstedRatingScore.NotInspected;
 
         // Attempt to parse the string as an integer then cast to enum
-        if (int.TryParse(rating, out var intRating) && Enum.IsDefined(typeof(OfstedRatingScore), intRating))
+        if (!(int.TryParse(rating, out var intRating) && Enum.IsDefined(typeof(OfstedRatingScore), intRating)))
         {
             return (OfstedRatingScore)intRating;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:34:9
 
         // Attempt to parse the string as an integer then cast to enum
         if (int.TryParse(rating, out var intRating) && Enum.IsDefined(typeof(OfstedRatingScore), intRating))
-        {
-            return (OfstedRatingScore)intRating;
-        }
+        {}
 
         return OfstedRatingScore.Unknown;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ConvertNullableStringToOfstedRatingScore_should_transform_given_string

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:58:21
     {
         return input switch
         {
-            null or "NULL" => SafeguardingScore.NotInspected,
+            null or "" => SafeguardingScore.NotInspected,
             "Yes" => SafeguardingScore.Yes,
             "No" => SafeguardingScore.No,
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ToSafeguardingScore_should_transform_given_string

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/OfstedExtensions.cs:61:13
             null or "NULL" => SafeguardingScore.NotInspected,
             "Yes" => SafeguardingScore.Yes,
             "No" => SafeguardingScore.No,
-            "9" => SafeguardingScore.NotRecorded,
+            "" => SafeguardingScore.NotRecorded,
             _ => SafeguardingScore.Unknown
         };
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.OfstedExtensionsTests.ToSafeguardingScore_should_transform_given_string
