[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/StringExtensions.cs:13:13
 
     public static DateTime? ParseAsNullableDate(this string? dateString)
     {
-        if (string.IsNullOrWhiteSpace(dateString)) return null;
+        if (!(string.IsNullOrWhiteSpace(dateString))) return null;
 
         if (SlashRegex.IsMatch(dateString))
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/StringExtensions.cs:13:13
 
     public static DateTime? ParseAsNullableDate(this string? dateString)
     {
-        if (string.IsNullOrWhiteSpace(dateString)) return null;
+        if ((dateString!=null)) return null;
 
         if (SlashRegex.IsMatch(dateString))
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/StringExtensions.cs:15:13
     {
         if (string.IsNullOrWhiteSpace(dateString)) return null;
 
-        if (SlashRegex.IsMatch(dateString))
+        if (!(SlashRegex.IsMatch(dateString)))
         {
             return DateTime.ParseExact(dateString, "dd/MM/yyyy", CultureInfo.InvariantCulture);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/StringExtensions.cs:20:13
             return DateTime.ParseExact(dateString, "dd/MM/yyyy", CultureInfo.InvariantCulture);
         }
 
-        if (DashRegex.IsMatch(dateString))
+        if (!(DashRegex.IsMatch(dateString)))
         {
             return DateTime.ParseExact(dateString, "dd-MM-yyyy", CultureInfo.InvariantCulture);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDate_should_return_correctly_parsed_date; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDate_should_return_correctly_parsed_date; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDate_should_return_correctly_parsed_date

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/StringExtensions.cs:25:9
             return DateTime.ParseExact(dateString, "dd-MM-yyyy", CultureInfo.InvariantCulture);
         }
 
-        throw new ArgumentException($"Cannot parse date in unknown format - {dateString}");
+        ;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDate_should_throw_argumentexception_when_unknown_date_string; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDate_should_throw_argumentexception_when_unknown_date_string; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDate_should_throw_argumentexception_when_unknown_date_string

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/StringExtensions.cs:29:5
     }
 
     public static int? ParseAsNullableInt(this string? numberString)
-    {
-        return int.TryParse(numberString, out var number) ? number : null;
-    }
+    {}
 
     public static double? ParseAsNullableDouble(this string? numberString)
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableInt_should_return_correctly_parsed_int; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableInt_should_return_correctly_parsed_int; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableInt_should_return_correctly_parsed_int

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Extensions/StringExtensions.cs:34:5
     }
 
     public static double? ParseAsNullableDouble(this string? numberString)
-    {
-        return double.TryParse(numberString, out var number) ? number : null;
-    }
+    {}
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDouble_should_return_correctly_parsed_double; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDouble_should_return_correctly_parsed_double; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Extensions.StringExtensionsTests.ParseAsNullableDouble_should_return_correctly_parsed_double
