[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/AcademyRepository.cs:15:26
     public async Task<AcademyDetails[]> GetAcademiesInTrustDetailsAsync(string uid)
     {
         return await academiesDbContext.GiasGroupLinks
-            .Where(gl => gl.GroupUid == uid)
+            .Where(gl => gl.GroupUid != uid)
             .Join(academiesDbContext.GiasEstablishments,
                 gl => gl.Urn!, e => e.Urn.ToString(),
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetAcademiesInTrustDetailsAsync_should_return_academies_linked_to_trust

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/AcademyRepository.cs:24:61
                         e.TypeOfEstablishmentName,
                         e.LaName,
                         e.UrbanRuralName,
-                        DateOnly.ParseExact(gl.JoinedDate!, "dd/MM/yyyy", CultureInfo.InvariantCulture, DateTimeStyles.None)))
+                        DateOnly.ParseExact(gl.JoinedDate!, "", CultureInfo.InvariantCulture, DateTimeStyles.None)))
             .ToArrayAsync();
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetAcademiesInTrustDetailsAsync_should_return_academies_linked_to_trust

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/AcademyRepository.cs:62:95
 
     public async Task<int> GetNumberOfAcademiesInTrustAsync(string uid)
     {
-        return await academiesDbContext.GiasGroupLinks.CountAsync(gl => gl.GroupUid == uid && gl.Urn != null);
+        return await academiesDbContext.GiasGroupLinks.CountAsync(gl => gl.GroupUid == uid && gl.Urn == null);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetNumberOfAcademiesInTrustAsync_should_return_number_of_grouplinks_for_uid; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetNumberOfAcademiesInTrustAsync_should_return_number_of_grouplinks_for_uid

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/AcademyRepository.cs:62:73
 
     public async Task<int> GetNumberOfAcademiesInTrustAsync(string uid)
     {
-        return await academiesDbContext.GiasGroupLinks.CountAsync(gl => gl.GroupUid == uid && gl.Urn != null);
+        return await academiesDbContext.GiasGroupLinks.CountAsync(gl => gl.GroupUid != uid && gl.Urn != null);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetNumberOfAcademiesInTrustAsync_should_return_number_of_grouplinks_for_uid; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetNumberOfAcademiesInTrustAsync_should_return_number_of_grouplinks_for_uid; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetNumberOfAcademiesInTrustAsync_should_return_zero_when_no_grouplinks

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/AcademyRepository.cs:68:26
     public async Task<string?> GetSingleAcademyTrustAcademyUrnAsync(string uid)
     {
         return await academiesDbContext.GiasGroupLinks.SingleAcademyTrusts()
-            .Where(gl => gl.GroupUid == uid)
+            .Where(gl => gl.GroupUid != uid)
             .Select(gl => gl.Urn)
             .FirstOrDefaultAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetUrnForSingleAcademyTrustAsync_should_set_singleAcademyTrustAcademyUrn_to_urn_of_SAT_academy

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/AcademyRepository.cs:76:26
     public async Task<string?> GetTrustUidFromAcademyUrnAsync(int urn)
     {
         return await academiesDbContext.GiasGroupLinks.Trusts()
-            .Where(gl => gl.Urn == urn.ToString())
+            .Where(gl => gl.Urn != urn.ToString())
             .Select(gl => gl.GroupUid)
             .SingleOrDefaultAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetTrustUidFromAcademyUrnAsync_should_return_for_trust_types; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetTrustUidFromAcademyUrnAsync_should_return_for_trust_types; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetTrustUidFromAcademyUrnAsync_should_return_for_trust_types

[Killed] Null coalescing mutation (remove left)
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/AcademyRepository.cs:93:25
                     new AcademyOverview
                     (
                         e.Urn.ToString(),
-                        e.LaName ?? string.Empty,
+                        string.Empty,
                         e.NumberOfPupils.ParseAsNullableInt(),
                         e.SchoolCapacity.ParseAsNullableInt()
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetOverviewOfAcademiesInTrustAsync_should_return_academies_linked_to_trust

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/AcademyRepository.cs:93:37
                     new AcademyOverview
                     (
                         e.Urn.ToString(),
-                        e.LaName ?? string.Empty,
+                        e.LaName ?? "Stryker was here!",
                         e.NumberOfPupils.ParseAsNullableInt(),
                         e.SchoolCapacity.ParseAsNullableInt()
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.AcademyRepositoryTests.GetOverviewOfAcademiesInTrustAsync_should_handle_academies_with_missing_data
