[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:22:13
             Source.Mstr => await GetDataSourceFromApplicationEvents("MSTR_Daily", Source.Mstr, UpdateFrequency.Daily),
             Source.Cdm => await GetDataSourceFromApplicationEvents("CDM_Daily", Source.Cdm, UpdateFrequency.Daily),
             Source.Mis => await GetMisEstablishmentsUpdatedAsync(),
-            Source.Prepare
-            or Source.Complete
+            Source.Prepare
+            and Source.Complete
             or Source.ManageFreeSchoolProjects => await GetDataSourceFromMstr(source),
             _ => throw new ArgumentOutOfRangeException(nameof(source), source, null)
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:32:39
     public async Task<DataSource> GetMisEstablishmentsUpdatedAsync()
     {
         var lastEntry = await academiesDbContext.ApplicationSettings
-            .FirstOrDefaultAsync(e => e.Key == "ManagementInformationSchoolTableData CSV Filename");
+            .FirstOrDefaultAsync(e => e.Key != "ManagementInformationSchoolTableData CSV Filename");
         if (lastEntry?.Modified is null)
         {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:33:13
     {
         var lastEntry = await academiesDbContext.ApplicationSettings
             .FirstOrDefaultAsync(e => e.Key == "ManagementInformationSchoolTableData CSV Filename");
-        if (lastEntry?.Modified is null)
+        if (lastEntry?.Modified is not null)
         {
             logger.LogError("Unable to find when ManagementInformationSchoolTableData was last modified");
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:35:13
             .FirstOrDefaultAsync(e => e.Key == "ManagementInformationSchoolTableData CSV Filename");
         if (lastEntry?.Modified is null)
         {
-            logger.LogError("Unable to find when ManagementInformationSchoolTableData was last modified");
+            ;
             return new DataSource(Source.Mis, null, UpdateFrequency.Monthly);
         }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:68:13
                                 .MaxAsync(),
             _ => throw new ArgumentOutOfRangeException(nameof(source), source, null),
         };
-        if (lastDataRefresh is null)
+        if (lastDataRefresh is not null)
         {
             logger.LogError("Unable to find last data refresh for MSTR source '{source}'", source);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:70:13
         };
         if (lastDataRefresh is null)
         {
-            logger.LogError("Unable to find last data refresh for MSTR source '{source}'", source);
+            ;
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:80:25
         UpdateFrequency updateFrequency)
     {
         var lastEntry = await academiesDbContext.ApplicationEvents
-            .Where(e => e.Message == "Finished"
+            .Where(e => e.Message != "Finished"
                         && e.EventType != 'E'
                         && e.Description == pipelineName).MaxAsync(e => e.DateTime);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:80:25
         UpdateFrequency updateFrequency)
     {
         var lastEntry = await academiesDbContext.ApplicationEvents
-            .Where(e => e.Message == "Finished"
-                        && e.EventType != 'E'
-                        && e.Description == pipelineName).MaxAsync(e => e.DateTime);
+            .Where(e => e.Message == "Finished"
+                        && e.EventType != 'E'
+                        || e.Description == pipelineName).MaxAsync(e => e.DateTime);
         if (lastEntry is null)
         {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:81:28
     {
         var lastEntry = await academiesDbContext.ApplicationEvents
             .Where(e => e.Message == "Finished"
-                        && e.EventType != 'E'
+                        && e.EventType == 'E'
                         && e.Description == pipelineName).MaxAsync(e => e.DateTime);
         if (lastEntry is null)
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:82:28
         var lastEntry = await academiesDbContext.ApplicationEvents
             .Where(e => e.Message == "Finished"
                         && e.EventType != 'E'
-                        && e.Description == pipelineName).MaxAsync(e => e.DateTime);
+                        && e.Description != pipelineName).MaxAsync(e => e.DateTime);
         if (lastEntry is null)
         {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:83:13
             .Where(e => e.Message == "Finished"
                         && e.EventType != 'E'
                         && e.Description == pipelineName).MaxAsync(e => e.DateTime);
-        if (lastEntry is null)
+        if (lastEntry is not null)
         {
             logger.LogError("Unable to find when {pipelineName} was last run", pipelineName);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenEntryExists_ShouldReturnLatestSuccessfullyFinishedDataSourceUpdate

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/DataSourceRepository.cs:85:13
                         && e.Description == pipelineName).MaxAsync(e => e.DateTime);
         if (lastEntry is null)
         {
-            logger.LogError("Unable to find when {pipelineName} was last run", pipelineName);
+            ;
             return new DataSource(source, null, updateFrequency);
         }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.DataSourceRepositoryTests.GetAsync_WhenNoEntryForPipelineExists_ShouldReturnDataSource_WithNullDate_AndLogError
