[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:19:26
     public async Task<AcademyOfsted[]> GetAcademiesInTrustOfstedAsync(string uid)
     {
         var giasGroupLinkData = await academiesDbContext.GiasGroupLinks
-            .Where(gl => gl.GroupUid == uid)
+            .Where(gl => gl.GroupUid != uid)
             .Select(gl => new
             {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_return_unknown_when_urn_doesnt_have_predecessor; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed

[Killed] Linq method mutation (Except() to Concat())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:49:27
 
         // If any missing then this could be a school that has recently changed URN
         // try to get ofsted rating using predecessor URN
-        var missingUrns = urns.Except(allOfstedRatings.Keys).ToArray();
+        var missingUrns = urns.Concat(allOfstedRatings.Keys).ToArray();
         if (missingUrns.Length > 0)
         {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_query_gias_establishment_link_when_urn_is_found_in_mis

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:50:13
         // If any missing then this could be a school that has recently changed URN
         // try to get ofsted rating using predecessor URN
         var missingUrns = urns.Except(allOfstedRatings.Keys).ToArray();
-        if (missingUrns.Length > 0)
+        if (missingUrns.Length < 0)
         {
             var previousUrnMapping = await GetPredecessorUrns(missingUrns);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:50:13
         // If any missing then this could be a school that has recently changed URN
         // try to get ofsted rating using predecessor URN
         var missingUrns = urns.Except(allOfstedRatings.Keys).ToArray();
-        if (missingUrns.Length > 0)
+        if (missingUrns.Length >= 0)
         {
             var previousUrnMapping = await GetPredecessorUrns(missingUrns);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_query_gias_establishment_link_when_urn_is_found_in_mis

[Killed] Linq method mutation (Concat() to Except())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:55:32
             var previousUrnMapping = await GetPredecessorUrns(missingUrns);
             var oldOfstedRatings = await GetOfstedRatingsFromDb(previousUrnMapping);
 
-            allOfstedRatings = allOfstedRatings.Concat(oldOfstedRatings).ToDictionary();
+            allOfstedRatings = allOfstedRatings.Except(oldOfstedRatings).ToDictionary();
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_query_further_ed_for_urns_not_in_mis_establishments_when_urn

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:64:17
             allOfstedRatings.TryGetValue(urn, out var foundRating);
 
             // Log any URNs that couldn't be found and default to unknown
-            if (foundRating is null)
+            if (foundRating is not null)
             {
                 logger.LogError(
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_return_unknown_when_urn_doesnt_have_predecessor; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:66:17
             // Log any URNs that couldn't be found and default to unknown
             if (foundRating is null)
             {
-                logger.LogError(
-                    "URN {Urn} was not found in Mis.Establishments or Mis.FurtherEducationEstablishments. This indicates a data integrity issue with the Ofsted data in Academies Db.",
-                    urn);
+                ;
                 allOfstedRatings.Add(urn, new AcademyOfstedRatings(int.Parse(urn), OfstedRating.Unknown, OfstedRating.Unknown, "none"));
                 continue;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_log_error_and_return_ofsted_unknown_when_urn_not_found_in_mis

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:67:21
             if (foundRating is null)
             {
                 logger.LogError(
-                    "URN {Urn} was not found in Mis.Establishments or Mis.FurtherEducationEstablishments. This indicates a data integrity issue with the Ofsted data in Academies Db.",
+                    "",
                     urn);
                 allOfstedRatings.Add(urn, new AcademyOfstedRatings(int.Parse(urn), OfstedRating.Unknown, OfstedRating.Unknown, "none"));
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_log_error_and_return_ofsted_unknown_when_urn_not_found_in_mis

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:69:17
                 logger.LogError(
                     "URN {Urn} was not found in Mis.Establishments or Mis.FurtherEducationEstablishments. This indicates a data integrity issue with the Ofsted data in Academies Db.",
                     urn);
-                allOfstedRatings.Add(urn, new AcademyOfstedRatings(int.Parse(urn), OfstedRating.Unknown, OfstedRating.Unknown, "none"));
+                ;
                 continue;
             }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_return_unknown_when_urn_doesnt_have_predecessor; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_return_academies_linked_to_trust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_EstablishmentName_from_giasGroupLink

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:70:17
                     "URN {Urn} was not found in Mis.Establishments or Mis.FurtherEducationEstablishments. This indicates a data integrity issue with the Ofsted data in Academies Db.",
                     urn);
                 allOfstedRatings.Add(urn, new AcademyOfstedRatings(int.Parse(urn), OfstedRating.Unknown, OfstedRating.Unknown, "none"));
-                continue;
+                ;
             }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_return_unknown_when_urn_doesnt_have_predecessor; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_return_academies_linked_to_trust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_EstablishmentName_from_giasGroupLink

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:74:17
             }
 
             //Log any errors that occured during parsing
-            if (foundRating.Current.HasAnyUnknownRating || foundRating.Previous.HasAnyUnknownRating)
+            if (!(foundRating.Current.HasAnyUnknownRating || foundRating.Previous.HasAnyUnknownRating))
             {
                 logger.LogError(
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_log_error_for_each_urn_with_unknown_judgement; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_remove_single_headline_grades_for_further_ed_issued_after_2nd

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:74:17
             }
 
             //Log any errors that occured during parsing
-            if (foundRating.Current.HasAnyUnknownRating || foundRating.Previous.HasAnyUnknownRating)
+            if (foundRating.Current.HasAnyUnknownRating && foundRating.Previous.HasAnyUnknownRating)
             {
                 logger.LogError(
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_log_error_for_each_urn_with_unknown_judgement

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:76:17
             //Log any errors that occured during parsing
             if (foundRating.Current.HasAnyUnknownRating || foundRating.Previous.HasAnyUnknownRating)
             {
-                logger.LogError(
-                    "URN {Urn} has some unrecognised ofsted ratings. This could be a data integrity issue with the Ofsted data in Academies Db.",
-                    urn);
+                ;
             }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_log_error_for_each_urn_with_unknown_judgement

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:82:17
             }
 
             // Ensure that there are no current single headline grades after policy change on 2nd September 2024 - only applies to non-further ed establishments
-            if (foundRating.FromTable == nameof(academiesDbContext.MisMstrEstablishmentsFiat) &&
-                HasShgIssuedAfterPolicyChange(foundRating.Current))
+            if (foundRating.FromTable == nameof(academiesDbContext.MisMstrEstablishmentsFiat) ||
+                HasShgIssuedAfterPolicyChange(foundRating.Current))
             {
                 logger.LogError(
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_handle_not_inspected_when_not_further_ed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_remove_single_headline_grades_for_further_ed_issued_after_2nd

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:82:17
             }
 
             // Ensure that there are no current single headline grades after policy change on 2nd September 2024 - only applies to non-further ed establishments
-            if (foundRating.FromTable == nameof(academiesDbContext.MisMstrEstablishmentsFiat) &&
+            if (foundRating.FromTable != nameof(academiesDbContext.MisMstrEstablishmentsFiat) &&
                 HasShgIssuedAfterPolicyChange(foundRating.Current))
             {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_remove_single_headline_grades_for_further_ed_issued_after_2nd

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:99:17
             }
 
             // Ensure that there are no previous single headline grades after policy change on 2nd September 2024 - only applies to non-further ed establishments
-            if (foundRating.FromTable == nameof(academiesDbContext.MisMstrEstablishmentsFiat) &&
+            if (foundRating.FromTable != nameof(academiesDbContext.MisMstrEstablishmentsFiat) &&
                 HasShgIssuedAfterPolicyChange(foundRating.Previous))
             {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd

[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:99:17
             }
 
             // Ensure that there are no previous single headline grades after policy change on 2nd September 2024 - only applies to non-further ed establishments
-            if (foundRating.FromTable == nameof(academiesDbContext.MisMstrEstablishmentsFiat) &&
-                HasShgIssuedAfterPolicyChange(foundRating.Previous))
+            if (!(foundRating.FromTable == nameof(academiesDbContext.MisMstrEstablishmentsFiat) &&
+                HasShgIssuedAfterPolicyChange(foundRating.Previous)))
             {
                 logger.LogError(
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:128:27
     private async Task<Dictionary<int, int>> GetPredecessorUrns(string[] currentUrns)
     {
         var allPredecessorsForUrns = academiesDbContext.GiasEstablishmentLink
-            .Where(gel => gel.LinkType == "Predecessor" && currentUrns.Contains(gel.Urn));
+            .Where(gel => gel.LinkType == "Predecessor" || currentUrns.Contains(gel.Urn));
 
         var currentUrnsWithOneClearPredecessor = await allPredecessorsForUrns
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_return_unknown_when_urn_doesnt_have_predecessor

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:128:27
     private async Task<Dictionary<int, int>> GetPredecessorUrns(string[] currentUrns)
     {
         var allPredecessorsForUrns = academiesDbContext.GiasEstablishmentLink
-            .Where(gel => gel.LinkType == "Predecessor" && currentUrns.Contains(gel.Urn));
+            .Where(gel => gel.LinkType != "Predecessor" && currentUrns.Contains(gel.Urn));
 
         var currentUrnsWithOneClearPredecessor = await allPredecessorsForUrns
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_return_unknown_when_urn_doesnt_have_predecessor; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_query_further_ed_for_urns_not_in_mis_establishments_when_urn

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:132:29
 
         var currentUrnsWithOneClearPredecessor = await allPredecessorsForUrns
             .GroupBy(gel => Convert.ToInt32(gel.Urn))
-            .Where(group => group.Count() == 1)
+            .Where(group => group.Count() != 1)
             .Select(group => new { PreviousUrn = Convert.ToInt32(group.Single().LinkUrn), CurrentUrn = group.Key })
             .ToDictionaryAsync(u => u.PreviousUrn, u => u.CurrentUrn);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_return_unknown_when_urn_has_multiple_predecessors; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_query_further_ed_for_urns_not_in_mis_establishments_when_urn

[Survived] Linq method mutation (Single() to SingleOrDefault())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:133:66
         var currentUrnsWithOneClearPredecessor = await allPredecessorsForUrns
             .GroupBy(gel => Convert.ToInt32(gel.Urn))
             .Where(group => group.Count() == 1)
-            .Select(group => new { PreviousUrn = Convert.ToInt32(group.Single().LinkUrn), CurrentUrn = group.Key })
+            .Select(group => new { PreviousUrn = Convert.ToInt32(group.SingleOrDefault().LinkUrn), CurrentUrn = group.Key })
             .ToDictionaryAsync(u => u.PreviousUrn, u => u.CurrentUrn);
 

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:140:5
     }
 
     private async Task<Dictionary<string, AcademyOfstedRatings>> GetOfstedRatingsFromDb(IEnumerable<string> urns)
-    {
-        // URN to search by and URN to return are the same
-        var urnMapping = urns.ToDictionary(int.Parse, int.Parse);
-        return await GetOfstedRatingsFromDb(urnMapping);
-    }
+    {}
 
     /// <param name="urnMapping">Key: URN to search by, Value: URN to return</param>
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_return_unknown_when_urn_doesnt_have_predecessor; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_all_ofsted_judgements_for_previous_urn_when_urn_has_changed

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:182:74
 
         // Check to see if all ratings have been found in MisEstablishments, if not search in MisFurtherEducationEstablishments
         // Note: if an entry is in MisEstablishments then it will not be in MisFurtherEducationEstablishments, even if it has no ofsted data
-        var missingUrns = urnMapping.Where(kvp => ofstedRatings.All(o => o.Urn != kvp.Key)).ToDictionary();
+        var missingUrns = urnMapping.Where(kvp => ofstedRatings.All(o => o.Urn == kvp.Key)).ToDictionary();
         if (missingUrns.Count != 0)
         {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_query_further_ed_for_urns_not_in_mis_establishments_when_urn; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_only_query_further_ed_for_urns_not_in_mis_establishments; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_log_error_for_each_urn_with_unknown_judgement

[Killed] Linq method mutation (All() to Any())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:182:51
 
         // Check to see if all ratings have been found in MisEstablishments, if not search in MisFurtherEducationEstablishments
         // Note: if an entry is in MisEstablishments then it will not be in MisFurtherEducationEstablishments, even if it has no ofsted data
-        var missingUrns = urnMapping.Where(kvp => ofstedRatings.All(o => o.Urn != kvp.Key)).ToDictionary();
+        var missingUrns = urnMapping.Where(kvp => ofstedRatings.Any(o => o.Urn != kvp.Key)).ToDictionary();
         if (missingUrns.Count != 0)
         {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_set_ofsted_judgements_when_further_ed

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:222:16
 
     private static bool HasShgIssuedAfterPolicyChange(OfstedRating rating)
     {
-        return rating.InspectionDate >= SingleHeadlineGradesPolicyChangeDate &&
+        return rating.InspectionDate < SingleHeadlineGradesPolicyChangeDate &&
                rating.OverallEffectiveness != OfstedRatingScore.SingleHeadlineGradeNotAvailable;
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_log_error_for_valid_overall_effectiveness; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_log_error_when_all_establishments_exist_and_are_valid

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:222:16
 
     private static bool HasShgIssuedAfterPolicyChange(OfstedRating rating)
     {
-        return rating.InspectionDate >= SingleHeadlineGradesPolicyChangeDate &&
-               rating.OverallEffectiveness != OfstedRatingScore.SingleHeadlineGradeNotAvailable;
+        return rating.InspectionDate >= SingleHeadlineGradesPolicyChangeDate ||
+               rating.OverallEffectiveness != OfstedRatingScore.SingleHeadlineGradeNotAvailable;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_handle_not_inspected_when_not_further_ed; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_log_error_for_valid_overall_effectiveness

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/OfstedRepository.cs:223:16
     private static bool HasShgIssuedAfterPolicyChange(OfstedRating rating)
     {
         return rating.InspectionDate >= SingleHeadlineGradesPolicyChangeDate &&
-               rating.OverallEffectiveness != OfstedRatingScore.SingleHeadlineGradeNotAvailable;
+               rating.OverallEffectiveness == OfstedRatingScore.SingleHeadlineGradeNotAvailable;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_remove_single_headline_grades_for_non_further_ed_issued_after_2nd; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_not_log_error_for_valid_overall_effectiveness
