[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:38:29
     public async Task<PipelineEstablishment[]> GetPipelineFreeSchoolProjectsAsync(string trustReferenceNumber)
     {
         var freeSchoolProjects = await academiesDbContext.MstrFreeSchoolProjects
-            .Where(trust => trust.TrustID == trustReferenceNumber)
+            .Where(trust => trust.TrustID != trustReferenceNumber)
             .Where(trust => trust.Stage == PipelineStatuses.FreeSchoolPipeline)
             .Select(m => new PipelineEstablishment(
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_HappyPath_ReturnsCorr; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_WithNoLowAndHighAgeRa; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_WithNoLowAndHighAgeRa

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:39:29
     {
         var freeSchoolProjects = await academiesDbContext.MstrFreeSchoolProjects
             .Where(trust => trust.TrustID == trustReferenceNumber)
-            .Where(trust => trust.Stage == PipelineStatuses.FreeSchoolPipeline)
+            .Where(trust => trust.Stage != PipelineStatuses.FreeSchoolPipeline)
             .Select(m => new PipelineEstablishment(
                 m.NewURN.ToString(),
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_HappyPath_ReturnsCorr; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_WithNoLowAndHighAgeRa; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_WithNoLowAndHighAgeRa

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:43:17
             .Select(m => new PipelineEstablishment(
                 m.NewURN.ToString(),
                 m.ProjectName,
-                m.StatutoryLowestAge.HasValue && m.StatutoryHighestAge.HasValue
-                    ? new AgeRange(m.StatutoryLowestAge.Value, m.StatutoryHighestAge.Value)
-                    : null,
+                (false?new AgeRange(m.StatutoryLowestAge.Value, m.StatutoryHighestAge.Value)
+:null),
                 m.LocalAuthority,
                 m.ProjectApplicationType,
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_HappyPath_ReturnsCorr; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_WithNoLowAndHighAgeRa

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:43:17
             .Select(m => new PipelineEstablishment(
                 m.NewURN.ToString(),
                 m.ProjectName,
-                m.StatutoryLowestAge.HasValue && m.StatutoryHighestAge.HasValue
+                m.StatutoryLowestAge.HasValue || m.StatutoryHighestAge.HasValue
                     ? new AgeRange(m.StatutoryLowestAge.Value, m.StatutoryHighestAge.Value)
                     : null,
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_WithNoLowAndHighAgeRa; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetPipelineFreeSchoolProjectsAsync_WithNoLowAndHighAgeRa

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:66:17
         var query = ConversionsBaseQuery(trustReferenceNumber);
 
         // Advisory filter
-        query = advisoryType == AdvisoryType.PreAdvisory
-            ? ApplyPreAdvisoryFilter(query)
-            : ApplyPostAdvisoryFilter(query);
+        query = (true?ApplyPreAdvisoryFilter(query)
+:ApplyPostAdvisoryFilter(query));
 
         var establishments = await query
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryConversionEstablishmentsAsync_FiltersOnStatus; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryConversionEstablishmentsAsync_ShouldNotInclud

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:66:17
         var query = ConversionsBaseQuery(trustReferenceNumber);
 
         // Advisory filter
-        query = advisoryType == AdvisoryType.PreAdvisory
+        query = advisoryType != AdvisoryType.PreAdvisory
             ? ApplyPreAdvisoryFilter(query)
             : ApplyPostAdvisoryFilter(query);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryConversionEstablishmentsAsync_FiltersOnStatus; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryConversionEstablishmentsAsync_FiltersOnStatus; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryConversionEstablishmentsAsync_ShouldNotInclud

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:94:25
         AdvisoryType advisoryType)
     {
         var query = academiesDbContext.MstrAcademyTransfers
-            .Where(t => t.NewProvisionalTrustID == trustReferenceNumber)
+            .Where(t => t.NewProvisionalTrustID != trustReferenceNumber)
             .Where(t => TransferStatuses.Contains(t.AcademyTransferStatus));
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:98:17
             .Where(t => TransferStatuses.Contains(t.AcademyTransferStatus));
 
         // Advisory filter
-        query = advisoryType == AdvisoryType.PreAdvisory
-            ? ApplyPreAdvisoryFilter(query)
-            : ApplyPostAdvisoryFilter(query);
+        query = (false?ApplyPreAdvisoryFilter(query)
+:ApplyPostAdvisoryFilter(query));
 
         var establishments = await query
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:106:17
             .Select(t => new PipelineEstablishment(
                 t.AcademyURN.ToString(),
                 t.AcademyName,
-                t.StatutoryLowestAge.HasValue && t.StatutoryHighestAge.HasValue
-                    ? new AgeRange(t.StatutoryLowestAge.Value, t.StatutoryHighestAge.Value)
-                    : null,
+                (true?new AgeRange(t.StatutoryLowestAge.Value, t.StatutoryHighestAge.Value)
+:null),
                 t.LocalAuthority,
                 ProjectType.Transfer,
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:106:17
             .Select(t => new PipelineEstablishment(
                 t.AcademyURN.ToString(),
                 t.AcademyName,
-                t.StatutoryLowestAge.HasValue && t.StatutoryHighestAge.HasValue
+                t.StatutoryLowestAge.HasValue || t.StatutoryHighestAge.HasValue
                     ? new AgeRange(t.StatutoryLowestAge.Value, t.StatutoryHighestAge.Value)
                     : null,
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_WithNoLowAndHighA

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:125:93
     public async Task<PipelineSummary> GetAcademiesPipelineSummaryAsync(string trustReferenceNumber)
     {
         // Count pre- and post-advisory conversions
-        var preAdvisoryConversionsCount = await CountConversionsAsync(trustReferenceNumber, true);
+        var preAdvisoryConversionsCount = await CountConversionsAsync(trustReferenceNumber, false);
         var postAdvisoryConversionsCount = await CountConversionsAsync(trustReferenceNumber, false);
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:126:94
     {
         // Count pre- and post-advisory conversions
         var preAdvisoryConversionsCount = await CountConversionsAsync(trustReferenceNumber, true);
-        var postAdvisoryConversionsCount = await CountConversionsAsync(trustReferenceNumber, false);
+        var postAdvisoryConversionsCount = await CountConversionsAsync(trustReferenceNumber, true);
 
         // Count pre- and post-advisory transfers
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:129:89
         var postAdvisoryConversionsCount = await CountConversionsAsync(trustReferenceNumber, false);
 
         // Count pre- and post-advisory transfers
-        var preAdvisoryTransfersCount = await CountTransfersAsync(trustReferenceNumber, true);
+        var preAdvisoryTransfersCount = await CountTransfersAsync(trustReferenceNumber, false);
         var postAdvisoryTransfersCount = await CountTransfersAsync(trustReferenceNumber, false);
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:130:90
 
         // Count pre- and post-advisory transfers
         var preAdvisoryTransfersCount = await CountTransfersAsync(trustReferenceNumber, true);
-        var postAdvisoryTransfersCount = await CountTransfersAsync(trustReferenceNumber, false);
+        var postAdvisoryTransfersCount = await CountTransfersAsync(trustReferenceNumber, true);
 
         // Free schools
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:134:26
 
         // Free schools
         var freeSchoolsCount = await academiesDbContext.MstrFreeSchoolProjects
-            .Where(fs => fs.TrustID == trustReferenceNumber)
+            .Where(fs => fs.TrustID != trustReferenceNumber)
             .Where(fs => fs.Stage == PipelineStatuses.FreeSchoolPipeline)
             .CountAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForFreeSchoolsCount_ShouldOnlyReturnCountOfFreeSchoolsI; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.IfTrustDoesNotHaveFreeSchools_ShouldReturnCountOf0

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:135:26
         // Free schools
         var freeSchoolsCount = await academiesDbContext.MstrFreeSchoolProjects
             .Where(fs => fs.TrustID == trustReferenceNumber)
-            .Where(fs => fs.Stage == PipelineStatuses.FreeSchoolPipeline)
+            .Where(fs => fs.Stage != PipelineStatuses.FreeSchoolPipeline)
             .CountAsync();
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForFreeSchoolsCount_ShouldOnlyReturnCountOfFreeSchoolsI

[Killed] Arithmetic mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:139:32
             .CountAsync();
 
         // Sum up totals
-        var preAdvisoryCount = preAdvisoryConversionsCount + preAdvisoryTransfersCount;
+        var preAdvisoryCount = preAdvisoryConversionsCount - preAdvisoryTransfersCount;
         var postAdvisoryCount = postAdvisoryConversionsCount + postAdvisoryTransfersCount;
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Arithmetic mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:140:33
 
         // Sum up totals
         var preAdvisoryCount = preAdvisoryConversionsCount + preAdvisoryTransfersCount;
-        var postAdvisoryCount = postAdvisoryConversionsCount + postAdvisoryTransfersCount;
+        var postAdvisoryCount = postAdvisoryConversionsCount - postAdvisoryTransfersCount;
 
         // Return aggregated result
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:153:28
     private IQueryable<MstrAcademyConversion> ConversionsBaseQuery(string trustReferenceNumber)
     {
         return academiesDbContext.MstrAcademyConversions
-            .Where(conv => conv.TrustID == trustReferenceNumber)
+            .Where(conv => conv.TrustID != trustReferenceNumber)
             .Where(conv => ConversionStatuses.Contains(conv.ProjectStatus))
             .Where(conv => conv.DaoProgress != "dAO revoked");
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForConversions_ShouldNotIncludeDaoRevoked

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:155:28
         return academiesDbContext.MstrAcademyConversions
             .Where(conv => conv.TrustID == trustReferenceNumber)
             .Where(conv => ConversionStatuses.Contains(conv.ProjectStatus))
-            .Where(conv => conv.DaoProgress != "dAO revoked");
+            .Where(conv => conv.DaoProgress == "dAO revoked");
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForConversions_ShouldNotIncludeDaoRevoked

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:155:48
         return academiesDbContext.MstrAcademyConversions
             .Where(conv => conv.TrustID == trustReferenceNumber)
             .Where(conv => ConversionStatuses.Contains(conv.ProjectStatus))
-            .Where(conv => conv.DaoProgress != "dAO revoked");
+            .Where(conv => conv.DaoProgress != "");
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForConversions_ShouldNotIncludeDaoRevoked; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryConversionEstablishmentsAsync_ShouldNotInclud; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryConversionEstablishmentsAsync_ShouldNotInclud

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:161:25
     private IQueryable<MstrAcademyTransfer> TransfersBaseQuery(string trustReferenceNumber)
     {
         return academiesDbContext.MstrAcademyTransfers
-            .Where(t => t.NewProvisionalTrustID == trustReferenceNumber)
+            .Where(t => t.NewProvisionalTrustID != trustReferenceNumber)
             .Where(t => TransferStatuses.Contains(t.AcademyTransferStatus));
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:171:33
     private static IQueryable<T> ApplyPreAdvisoryFilter<T>(IQueryable<T> query)
         where T : class, IInComplete, IInPrepare
     {
-        return query.Where(x => x.InComplete.HasValue && x.InPrepare.HasValue)
+        return query.Where(x => x.InComplete.HasValue || x.InPrepare.HasValue)
             .Where(x => !x.InComplete!.Value && x.InPrepare!.Value);
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:172:25
         where T : class, IInComplete, IInPrepare
     {
         return query.Where(x => x.InComplete.HasValue && x.InPrepare.HasValue)
-            .Where(x => !x.InComplete!.Value && x.InPrepare!.Value);
+            .Where(x => x.InComplete!.Value && x.InPrepare!.Value);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForConversions_ShouldNotIncludeDaoRevoked; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryConversionEstablishmentsAsync_FiltersOnStatus

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:172:25
         where T : class, IInComplete, IInPrepare
     {
         return query.Where(x => x.InComplete.HasValue && x.InPrepare.HasValue)
-            .Where(x => !x.InComplete!.Value && x.InPrepare!.Value);
+            .Where(x => !x.InComplete!.Value || x.InPrepare!.Value);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.PipelineEstablishmentRepositoryTests.GetAdvisoryTransferEstablishmentsAsync_PreAdvisory_Retur

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:180:5
     /// </summary>
     private static IQueryable<T> ApplyPostAdvisoryFilter<T>(IQueryable<T> query)
         where T : class, IInComplete
-    {
-        return query.Where(x => x.InComplete.HasValue)
-            .Where(x => x.InComplete!.Value);
-    }
+    {}
 
     /// <summary>
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:191:17
     private async Task<int> CountConversionsAsync(string trustReferenceNumber, bool isPreAdvisory)
     {
         var query = ConversionsBaseQuery(trustReferenceNumber);
-        query = isPreAdvisory
-            ? ApplyPreAdvisoryFilter(query)
-            : ApplyPostAdvisoryFilter(query);
+        query = (false?ApplyPreAdvisoryFilter(query)
+:ApplyPostAdvisoryFilter(query));
         return await query.CountAsync();
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:191:17
     private async Task<int> CountConversionsAsync(string trustReferenceNumber, bool isPreAdvisory)
     {
         var query = ConversionsBaseQuery(trustReferenceNumber);
-        query = isPreAdvisory
-            ? ApplyPreAdvisoryFilter(query)
-            : ApplyPostAdvisoryFilter(query);
+        query = (true?ApplyPreAdvisoryFilter(query)
+:ApplyPostAdvisoryFilter(query));
         return await query.CountAsync();
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:203:17
     private async Task<int> CountTransfersAsync(string trustReferenceNumber, bool isPreAdvisory)
     {
         var query = TransfersBaseQuery(trustReferenceNumber);
-        query = isPreAdvisory
-            ? ApplyPreAdvisoryFilter(query)
-            : ApplyPostAdvisoryFilter(query);
+        query = (true?ApplyPreAdvisoryFilter(query)
+:ApplyPostAdvisoryFilter(query));
         return await query.CountAsync();
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPostAdvisoryConversion_ShouldCalculateCorrectCount
