[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/PipelineEstablishmentRepository.cs:203:17
     private async Task<int> CountTransfersAsync(string trustReferenceNumber, bool isPreAdvisory)
     {
         var query = TransfersBaseQuery(trustReferenceNumber);
-        query = isPreAdvisory
-            ? ApplyPreAdvisoryFilter(query)
-            : ApplyPostAdvisoryFilter(query);
+        query = (false?ApplyPreAdvisoryFilter(query)
+:ApplyPostAdvisoryFilter(query));
         return await query.CountAsync();
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.PipelineEstablishmentRepository.GetAcademiesPipelineSummaryAsyncTests.ForPreAdvisoryConversion_ShouldCalculateCorrectCount
