[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/SchoolRepository.cs:16:25
     public async Task<SchoolSummary?> GetSchoolSummaryAsync(int urn)
     {
         return await academiesDbContext.GiasEstablishments
-            .Where(e => e.Urn == urn)
+            .Where(e => e.Urn != urn)
             .Select(e => new SchoolSummary(
                 e.EstablishmentName!,
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/SchoolRepository.cs:20:17
             .Select(e => new SchoolSummary(
                 e.EstablishmentName!,
                 e.TypeOfEstablishmentName!,
-                e.EstablishmentTypeGroupName == "Academies"
+                e.EstablishmentTypeGroupName != "Academies"
                     ? SchoolCategory.Academy
                     : SchoolCategory.LaMaintainedSchool))
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/SchoolRepository.cs:20:17
             .Select(e => new SchoolSummary(
                 e.EstablishmentName!,
                 e.TypeOfEstablishmentName!,
-                e.EstablishmentTypeGroupName == "Academies"
-                    ? SchoolCategory.Academy
-                    : SchoolCategory.LaMaintainedSchool))
+                (false?SchoolCategory.Academy
+:SchoolCategory.LaMaintainedSchool)))
             .SingleOrDefaultAsync();
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolSummaryAsync_should_return_schoolSummary_if_found

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/SchoolRepository.cs:47:68
 
     public async Task<DateOnly> GetDateJoinedTrustAsync(int urn)
     {
-        return await academiesDbContext.GiasGroupLinks.Where(gl => gl.Urn == urn.ToString())
+        return await academiesDbContext.GiasGroupLinks.Where(gl => gl.Urn != urn.ToString())
             .Select(gl =>
                 DateOnly.ParseExact(gl.JoinedDate!, "dd/MM/yyyy", CultureInfo.InvariantCulture, DateTimeStyles.None))
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetDateJoinedTrust_should_return_correct_date

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/SchoolRepository.cs:49:53
     {
         return await academiesDbContext.GiasGroupLinks.Where(gl => gl.Urn == urn.ToString())
             .Select(gl =>
-                DateOnly.ParseExact(gl.JoinedDate!, "dd/MM/yyyy", CultureInfo.InvariantCulture, DateTimeStyles.None))
+                DateOnly.ParseExact(gl.JoinedDate!, "", CultureInfo.InvariantCulture, DateTimeStyles.None))
             .FirstAsync();
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetDateJoinedTrust_should_return_correct_date

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/SchoolRepository.cs:56:25
     public async Task<SchoolContact> GetSchoolContactsAsync(int urn)
     {
         var headteacher = await academiesDbContext.TadHeadTeacherContacts
-            .Where(c => c.Urn == urn)
+            .Where(c => c.Urn != urn)
             .Select(contact => new { contact.HeadFirstName, contact.HeadLastName, contact.HeadEmail })
             .SingleAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolContactsAsync_should_return_headteacher_from_tad

[Killed] Conditional (true) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/SchoolRepository.cs:61:21
             .SingleAsync();
 
         var fullName = stringFormattingUtilities.GetFullName(headteacher.HeadFirstName, headteacher.HeadLastName);
-        var email = string.IsNullOrWhiteSpace(headteacher.HeadEmail) ? null : headteacher.HeadEmail;
+        var email = (true?null :headteacher.HeadEmail);
 
         return new SchoolContact(fullName, email);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolContactsAsync_should_return_headteacher_from_tad

[Survived] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/SchoolRepository.cs:61:21
             .SingleAsync();
 
         var fullName = stringFormattingUtilities.GetFullName(headteacher.HeadFirstName, headteacher.HeadLastName);
-        var email = string.IsNullOrWhiteSpace(headteacher.HeadEmail) ? null : headteacher.HeadEmail;
+        var email = (false?null :headteacher.HeadEmail);
 
         return new SchoolContact(fullName, email);
