[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:28:27
         var (trustOpenDate, trustReferenceNumber) = await GetTrustInfoFromGias(uid);
 
         var allSharepointTrustDocLinksForFinancialDocType = await academiesDbContext.SharepointTrustDocLinks
-            .Where(doc => doc.TrustRefNumber == trustReferenceNumber
-                          && FolderPrefixes[financialDocumentType].Contains(doc.FolderPrefix))
+            .Where(doc => doc.TrustRefNumber == trustReferenceNumber
+                          || FolderPrefixes[financialDocumentType].Contains(doc.FolderPrefix))
             .Select(doc => new { doc.FolderYear, DocumentLink = doc.DocumentLink!, doc.CreatedDateTime })
             .ToArrayAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:28:27
         var (trustOpenDate, trustReferenceNumber) = await GetTrustInfoFromGias(uid);
 
         var allSharepointTrustDocLinksForFinancialDocType = await academiesDbContext.SharepointTrustDocLinks
-            .Where(doc => doc.TrustRefNumber == trustReferenceNumber
+            .Where(doc => doc.TrustRefNumber != trustReferenceNumber
                           && FolderPrefixes[financialDocumentType].Contains(doc.FolderPrefix))
             .Select(doc => new { doc.FolderYear, DocumentLink = doc.DocumentLink!, doc.CreatedDateTime })
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_newest_doc_when_more_than_one_in_year; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD

[Killed] Linq method mutation (OrderByDescending() to OrderBy())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:35:26
 
         var yearDuplicationsRemoved = allSharepointTrustDocLinksForFinancialDocType
             .GroupBy(doc => doc.FolderYear)
-            .Select(g => g.OrderByDescending(d => d.CreatedDateTime).First());
+            .Select(g => g.OrderBy(d => d.CreatedDateTime).First());
 
         var trustDocuments = yearDuplicationsRemoved
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_newest_doc_when_more_than_one_in_year

[Survived] Linq method mutation (First() to FirstOrDefault())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:35:26
 
         var yearDuplicationsRemoved = allSharepointTrustDocLinksForFinancialDocType
             .GroupBy(doc => doc.FolderYear)
-            .Select(g => g.OrderByDescending(d => d.CreatedDateTime).First());
+            .Select(g => g.OrderByDescending(d => d.CreatedDateTime).FirstOrDefault());
 
         var trustDocuments = yearDuplicationsRemoved

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:40:40
         var trustDocuments = yearDuplicationsRemoved
             .Select(doc =>
             {
-                var financialYearEnd = financialDocumentType == FinancialDocumentType.SelfAssessmentChecklist
-                    ? doc.FolderYear - 1
-                    : doc.FolderYear;
+                var financialYearEnd = (false?doc.FolderYear - 1
+:doc.FolderYear);
                 return new TrustDocument(financialYearEnd, doc.DocumentLink);
             })
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_set_financial_year_end_to_year_before_folder_year_for_SelfAsse; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_set_financial_year_end_to_year_before_folder_year_for_SelfAsse

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:40:40
         var trustDocuments = yearDuplicationsRemoved
             .Select(doc =>
             {
-                var financialYearEnd = financialDocumentType == FinancialDocumentType.SelfAssessmentChecklist
+                var financialYearEnd = financialDocumentType != FinancialDocumentType.SelfAssessmentChecklist
                     ? doc.FolderYear - 1
                     : doc.FolderYear;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_set_financial_year_end_to_folder_year_for_most_doc_types; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_set_financial_year_end_to_folder_year_for_most_doc_types; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_set_financial_year_end_to_folder_year_for_most_doc_types

[Killed] Arithmetic mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:41:23
             .Select(doc =>
             {
                 var financialYearEnd = financialDocumentType == FinancialDocumentType.SelfAssessmentChecklist
-                    ? doc.FolderYear - 1
+                    ? doc.FolderYear + 1
                     : doc.FolderYear;
                 return new TrustDocument(financialYearEnd, doc.DocumentLink);
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_set_financial_year_end_to_year_before_folder_year_for_SelfAsse; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_set_financial_year_end_to_year_before_folder_year_for_SelfAsse

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:53:25
     private async Task<(DateOnly trustOpenDate, string trustReferenceNumber)> GetTrustInfoFromGias(string uid)
     {
         var giasGroup = await academiesDbContext.Groups.Trusts()
-            .Where(g => g.GroupUid == uid)
+            .Where(g => g.GroupUid != uid)
             .Select(g => new { GroupId = g.GroupId!, g.IncorporatedOnOpenDate }) // GroupId cannot be null for a trust
             .SingleAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_newest_doc_when_more_than_one_in_year; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_only_return_financial_documents_for_given_trust_and_FinancialD

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:57:13
             .Select(g => new { GroupId = g.GroupId!, g.IncorporatedOnOpenDate }) // GroupId cannot be null for a trust
             .SingleAsync();
 
-        if (giasGroup.IncorporatedOnOpenDate is null)
+        if (giasGroup.IncorporatedOnOpenDate is not null)
             logger.LogError(
                 "Open date was not found for trust {uid}. This should never happen and indicates a data integrity issue with the GIAS data in Academies Db",
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_log_error_when_no_trust_open_date

[Killed] Statement mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:58:13
             .SingleAsync();
 
         if (giasGroup.IncorporatedOnOpenDate is null)
-            logger.LogError(
-                "Open date was not found for trust {uid}. This should never happen and indicates a data integrity issue with the GIAS data in Academies Db",
-                uid);
+            ;
 
         var trustOpenDate = giasGroup.IncorporatedOnOpenDate is not null
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_log_error_when_no_trust_open_date

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:62:29
                 "Open date was not found for trust {uid}. This should never happen and indicates a data integrity issue with the GIAS data in Academies Db",
                 uid);
 
-        var trustOpenDate = giasGroup.IncorporatedOnOpenDate is not null
-            ? DateOnly.ParseExact(giasGroup.IncorporatedOnOpenDate, "dd/MM/yyyy", DateTimeFormatInfo.InvariantInfo)
-            : DateOnly.MinValue;
+        var trustOpenDate = (false?DateOnly.ParseExact(giasGroup.IncorporatedOnOpenDate, "dd/MM/yyyy", DateTimeFormatInfo.InvariantInfo)
+:DateOnly.MinValue);
         var trustReferenceNumber = giasGroup.GroupId;
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_trust_open_date_when_docs_exist; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_trust_open_date_when_no_docs_exist

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustDocumentRepository.cs:62:29
                 "Open date was not found for trust {uid}. This should never happen and indicates a data integrity issue with the GIAS data in Academies Db",
                 uid);
 
-        var trustOpenDate = giasGroup.IncorporatedOnOpenDate is not null
+        var trustOpenDate = giasGroup.IncorporatedOnOpenDate is null
             ? DateOnly.ParseExact(giasGroup.IncorporatedOnOpenDate, "dd/MM/yyyy", DateTimeFormatInfo.InvariantInfo)
             : DateOnly.MinValue;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_trust_open_date_when_docs_exist; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_log_error_when_no_trust_open_date; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustDocumentRepositoryTests.GetFinancialDocumentsAsync_should_return_trust_open_date_when_no_docs_exist
