[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:18:25
     public async Task<TrustSummary?> GetTrustSummaryAsync(string uid)
     {
         var details = await Trusts
-            .Where(g => g.GroupUid == uid)
+            .Where(g => g.GroupUid != uid)
             .Select(g => new
                 {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_null_if_not_sat_or_mat; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:27:16
             ) //GroupName and GroupType will never be null due to EF query filters
             .SingleOrDefaultAsync();
 
-        return details is null ? null : new TrustSummary(details.Name, details.Type);
+        return details is not null ? null : new TrustSummary(details.Name, details.Type);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_null_if_not_sat_or_mat; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_trustSummary_if_found

[Killed] Conditional (false) mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:27:16
             ) //GroupName and GroupType will never be null due to EF query filters
             .SingleOrDefaultAsync();
 
-        return details is null ? null : new TrustSummary(details.Name, details.Type);
+        return (false?null :new TrustSummary(details.Name, details.Type));
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustSummaryAsync_should_return_null_if_not_sat_or_mat

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:33:25
     public async Task<TrustOverview> GetTrustOverviewAsync(string uid)
     {
         var giasGroup = await Trusts
-            .Where(g => g.GroupUid == uid)
+            .Where(g => g.GroupUid != uid)
             .Select(giasGroup => new
             {
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_set_properties_from_giasGroup; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_set_regionAndTerritory_to_empty_string_when_GORregion_in_mstrTrust_null; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_get_regionAndTerritory_from_mstrTrusts

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:87:34
             .ToArrayAsync();
 
         var governersDto = new TrustGovernance(
-            governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleLeadership).ToArray(),
+            governors.Where(g => g.IsCurrentOrFutureGovernor || g.HasRoleLeadership).ToArray(),
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleMember).ToArray(),
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleTrustee).ToArray(),
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:88:34
 
         var governersDto = new TrustGovernance(
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleLeadership).ToArray(),
-            governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleMember).ToArray(),
+            governors.Where(g => g.IsCurrentOrFutureGovernor || g.HasRoleMember).ToArray(),
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleTrustee).ToArray(),
             governors.Where(g => !g.IsCurrentOrFutureGovernor).ToArray()
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:89:34
         var governersDto = new TrustGovernance(
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleLeadership).ToArray(),
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleMember).ToArray(),
-            governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleTrustee).ToArray(),
+            governors.Where(g => g.IsCurrentOrFutureGovernor || g.HasRoleTrustee).ToArray(),
             governors.Where(g => !g.IsCurrentOrFutureGovernor).ToArray()
         );
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:90:34
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleLeadership).ToArray(),
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleMember).ToArray(),
             governors.Where(g => g.IsCurrentOrFutureGovernor && g.HasRoleTrustee).ToArray(),
-            governors.Where(g => !g.IsCurrentOrFutureGovernor).ToArray()
+            governors.Where(g => g.IsCurrentOrFutureGovernor).ToArray()
         );
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:98:13
 
     public static IQueryable<GiasGovernance> FilterBySatOrMat(string uid, string? urn, IQueryable<GiasGovernance> query)
     {
-        if (!string.IsNullOrEmpty(urn))
+        if (string.IsNullOrEmpty(urn))
         {
             // Use urn if it's provided as that means this is a Single Academy Trust (SAT)
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_null_WhenOtherGovernorsArePresent

[Survived] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:98:14
 
     public static IQueryable<GiasGovernance> FilterBySatOrMat(string uid, string? urn, IQueryable<GiasGovernance> query)
     {
-        if (!string.IsNullOrEmpty(urn))
+        if (!(urn!=""))
         {
             // Use urn if it's provided as that means this is a Single Academy Trust (SAT)

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:101:37
         if (!string.IsNullOrEmpty(urn))
         {
             // Use urn if it's provided as that means this is a Single Academy Trust (SAT)
-            return query.Where(g => g.Urn == urn);
+            return query.Where(g => g.Urn != urn);
         }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.FilterBySatOrMat_WithUrn_FiltersByUrn

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:104:33
             return query.Where(g => g.Urn == urn);
         }
 
-        return query.Where(g => g.Uid == uid);
+        return query.Where(g => g.Uid != uid);
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] Null coalescing mutation (remove left)
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:120:16
 
     private async Task<string> GetRegionAndTerritoryAsync(string uid)
     {
-        return await academiesDbContext.MstrTrusts
-            .Where(m => m.GroupUid == uid)
-            .Select(m => m.GORregion)
-            .SingleOrDefaultAsync() ?? string.Empty;
+        return string.Empty;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_get_regionAndTerritory_from_mstrTrusts

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:121:25
     private async Task<string> GetRegionAndTerritoryAsync(string uid)
     {
         return await academiesDbContext.MstrTrusts
-            .Where(m => m.GroupUid == uid)
+            .Where(m => m.GroupUid != uid)
             .Select(m => m.GORregion)
             .SingleOrDefaultAsync() ?? string.Empty;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_set_properties_from_giasGroup; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_set_regionAndTerritory_to_empty_string_when_GORregion_in_mstrTrust_null; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustOverviewAsync_should_get_regionAndTerritory_from_mstrTrusts

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:130:13
     {
         var fullName = forename1; //Forename1 is always populated
 
-        if (!string.IsNullOrWhiteSpace(forename2))
+        if (string.IsNullOrWhiteSpace(forename2))
             fullName += $" {forename2}";
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:130:14
     {
         var fullName = forename1; //Forename1 is always populated
 
-        if (!string.IsNullOrWhiteSpace(forename2))
+        if (!(forename2!=""))
             fullName += $" {forename2}";
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:133:13
         if (!string.IsNullOrWhiteSpace(forename2))
             fullName += $" {forename2}";
 
-        if (!string.IsNullOrWhiteSpace(surname))
+        if (string.IsNullOrWhiteSpace(surname))
             fullName += $" {surname}";
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:134:25
             fullName += $" {forename2}";
 
         if (!string.IsNullOrWhiteSpace(surname))
-            fullName += $" {surname}";
+            fullName += $"";
 
         return fullName;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnHistoricGovernors_WhenTheyExist_IrrespectiveOfRole

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:141:49
 
     private async Task<Dictionary<string, Person>> GetGovernanceContactsAsync(string uid, string? urn = null)
     {
-        string[] roles = { "Chair of Trustees", "Accounting Officer", "Chief Financial Officer" };
+        string[] roles = { "Chair of Trustees", "", "Chief Financial Officer" };
 
         IQueryable<GiasGovernance> query = academiesDbContext.GiasGovernances;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_ShouldOnlyReturnCurrentGovernors; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_AccountingOfficer_WhenOneIsPresentForTheTrust

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:141:28
 
     private async Task<Dictionary<string, Person>> GetGovernanceContactsAsync(string uid, string? urn = null)
     {
-        string[] roles = { "Chair of Trustees", "Accounting Officer", "Chief Financial Officer" };
+        string[] roles = { "", "Accounting Officer", "Chief Financial Officer" };
 
         IQueryable<GiasGovernance> query = academiesDbContext.GiasGovernances;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_CorrectDetails_EvenWithoutMatch_in_TadTrustGovernance_table; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_ChairOfTrustees_WhenOneIsPresentForTheTrust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_ShouldOnlyReturnCurrentChairOfTrusteesWhenOneStartsInFuture

[Killed] Null coalescing mutation (remove right)
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:154:33
                     governance.Gid,
                     FullName = GetFullName(governance.Forename1!, governance.Forename2!, governance.Surname!),
                     EndDate = governance.DateTermOfOfficeEndsEnded.ParseAsNullableDate(),
-                    StartDate = governance.DateOfAppointment.ParseAsNullableDate() ?? DateTime.MinValue,
+                    StartDate = governance.DateOfAppointment.ParseAsNullableDate(),
                     Role = governance.Role!
                 })
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_ChairOfTrustees_WhenOneIsPresentForTheTrust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_ChiefFinancialOfficer_WhenOneIsPresentForTheTrust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_ShouldOnlyReturnCurrentChairOfTrusteesWhenOneStartsInFuture

[Killed] Null coalescing mutation (remove left)
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:154:33
                     governance.Gid,
                     FullName = GetFullName(governance.Forename1!, governance.Forename2!, governance.Surname!),
                     EndDate = governance.DateTermOfOfficeEndsEnded.ParseAsNullableDate(),
-                    StartDate = governance.DateOfAppointment.ParseAsNullableDate() ?? DateTime.MinValue,
+                    StartDate = DateTime.MinValue,
                     Role = governance.Role!
                 })
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_ShouldOnlyReturnCurrentChairOfTrusteesWhenOneStartsInFuture

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:158:47
                     Role = governance.Role!
                 })
                 .ToArrayAsync())
-            .Where(g => (g.EndDate == null || g.EndDate >= DateTime.Today) && g.StartDate <= DateTime.Today).ToArray();
+            .Where(g => (g.EndDate == null || g.EndDate > DateTime.Today) && g.StartDate <= DateTime.Today).ToArray();
 
         var gids = governors.Select(g => g.Gid).ToArray();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_ShouldOnlyReturnCurrentGovernors

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:158:79
                     Role = governance.Role!
                 })
                 .ToArrayAsync())
-            .Where(g => (g.EndDate == null || g.EndDate >= DateTime.Today) && g.StartDate <= DateTime.Today).ToArray();
+            .Where(g => (g.EndDate == null || g.EndDate >= DateTime.Today) && g.StartDate > DateTime.Today).ToArray();
 
         var gids = governors.Select(g => g.Gid).ToArray();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_CorrectDetails_EvenWithoutMatch_in_TadTrustGovernance_table; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_ChairOfTrustees_WhenOneIsPresentForTheTrust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_ChiefFinancialOfficer_WhenOneIsPresentForTheTrust

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:170:65
             governor => governor.Role,
             governor => new Person(
                 governor.FullName,
-                governorEmails.SingleOrDefault(governorEmail => governorEmail.Gid == governor.Gid)?.Email)
+                governorEmails.SingleOrDefault(governorEmail => governorEmail.Gid != governor.Gid)?.Email)
         );
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_ChairOfTrustees_WhenOneIsPresentForTheTrust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_ChiefFinancialOfficer_WhenOneIsPresentForTheTrust; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_Valid_AccountingOfficer_WhenOneIsPresentForTheTrust

[Killed] Linq method mutation (SingleOrDefault() to Single())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:170:17
             governor => governor.Role,
             governor => new Person(
                 governor.FullName,
-                governorEmails.SingleOrDefault(governorEmail => governorEmail.Gid == governor.Gid)?.Email)
+                governorEmails.Single(governorEmail => governorEmail.Gid == governor.Gid)?.Email)
         );
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustContactsAsync_Should_Return_CorrectDetails_EvenWithoutMatch_in_TadTrustGovernance_table

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustRepository.cs:177:26
     public async Task<string> GetTrustReferenceNumberAsync(string uid)
     {
         var trustReferenceNumber = await Trusts
-            .Where(gl => gl.GroupUid == uid)
+            .Where(gl => gl.GroupUid != uid)
             .Select(gl => gl.GroupId!) // GroupId cannot be null for a trust
             .SingleAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustReferenceNumberAsync_should_return_trustReferenceNumber_for_uid
