[Killed] Negate expression
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:16:13
     public async Task<(SearchResult[] Results, SearchResultCount NumberOfResults)> GetSearchResultsAsync(string? text,
         int pageSize, int page = 1)
     {
-        if (string.IsNullOrWhiteSpace(text))
+        if (!(string.IsNullOrWhiteSpace(text)))
         {
             return ([], new SearchResultCount(0, 0, 0));
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAsync_should_not_call_database_if_empty_search_term; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAsync_should_not_call_database_if_empty_search_term; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAsync_should_not_call_database_if_empty_search_term

[Killed] String mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:16:13
     public async Task<(SearchResult[] Results, SearchResultCount NumberOfResults)> GetSearchResultsAsync(string? text,
         int pageSize, int page = 1)
     {
-        if (string.IsNullOrWhiteSpace(text))
+        if ((text!=null))
         {
             return ([], new SearchResultCount(0, 0, 0));
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAsync_should_not_call_database_if_empty_search_term; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_Should_Return_Trusts_When_SearchTerm_Matches_Both_TrustId_And_TrustNam; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_map_properties_for_trusts

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:17:9
         int pageSize, int page = 1)
     {
         if (string.IsNullOrWhiteSpace(text))
-        {
-            return ([], new SearchResultCount(0, 0, 0));
-        }
+        {}
 
         //Count is done without the select for speed efficiency
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAsync_should_not_call_database_if_empty_search_term; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAsync_should_not_call_database_if_empty_search_term; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAsync_should_not_call_database_if_empty_search_term

[Killed] Arithmetic mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:24:26
         //Count is done without the select for speed efficiency
         var numberOfTrusts = await CreateTrustSearchQuery(text).CountAsync();
         var numberOfSchools = await CreateSchoolSearchQuery(text).CountAsync();
-        var totalCount = numberOfTrusts + numberOfSchools;
+        var totalCount = numberOfTrusts - numberOfSchools;
 
         //If there's no results then don't go back to the db
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_return_first_20_trusts_or_schools_after_sorting_alphabetically_; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_only_return_20_results_when_there_are_more_than_20_matches; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_only_return_20_results_when_there_are_more_than_20_matches

[Killed] Equality mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:27:13
         var totalCount = numberOfTrusts + numberOfSchools;
 
         //If there's no results then don't go back to the db
-        if (totalCount == 0)
+        if (totalCount != 0)
             return ([], new SearchResultCount(0, 0, 0));
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_Should_Return_Trusts_When_SearchTerm_Matches_Both_TrustId_And_TrustNam; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_map_properties_for_trusts; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_return_first_20_trusts_or_schools_after_sorting_alphabetically_

[Killed] Linq method mutation (Take() to Skip())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:31:29
             return ([], new SearchResultCount(0, 0, 0));
 
         //Now get all the results
-        var results = await BuildOrderedSearchResultQuery(text)
-            .Skip((page - 1) * pageSize)
-            .Take(pageSize)
+        var results = await BuildOrderedSearchResultQuery(text)
+            .Skip((page - 1) * pageSize)
+            .Skip(pageSize)
             .ToArrayAsync();
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_Should_Return_Trusts_When_SearchTerm_Matches_Both_TrustId_And_TrustNam; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_map_properties_for_trusts; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_return_first_20_trusts_or_schools_after_sorting_alphabetically_

[Killed] Linq method mutation (Skip() to Take())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:31:29
             return ([], new SearchResultCount(0, 0, 0));
 
         //Now get all the results
-        var results = await BuildOrderedSearchResultQuery(text)
-            .Skip((page - 1) * pageSize)
+        var results = await BuildOrderedSearchResultQuery(text)
+            .Take((page - 1) * pageSize)
             .Take(pageSize)
             .ToArrayAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_Should_Return_Trusts_When_SearchTerm_Matches_Both_TrustId_And_TrustNam; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_map_properties_for_trusts; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_return_first_20_trusts_or_schools_after_sorting_alphabetically_

[Killed] Arithmetic mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:32:19
 
         //Now get all the results
         var results = await BuildOrderedSearchResultQuery(text)
-            .Skip((page - 1) * pageSize)
+            .Skip((page - 1) / pageSize)
             .Take(pageSize)
             .ToArrayAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_return_the_correct_results_page_when_there_are_more_than_20_mat

[Killed] Arithmetic mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:32:20
 
         //Now get all the results
         var results = await BuildOrderedSearchResultQuery(text)
-            .Skip((page - 1) * pageSize)
+            .Skip((page + 1) * pageSize)
             .Take(pageSize)
             .ToArrayAsync();
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_Should_Return_Trusts_When_SearchTerm_Matches_Both_TrustId_And_TrustNam; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_map_properties_for_trusts; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_return_first_20_trusts_or_schools_after_sorting_alphabetically_

[Killed] Block removal mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:42:9
     public async Task<SearchResult[]> GetAutoCompleteSearchResultsAsync(string? text)
     {
         if (string.IsNullOrWhiteSpace(text))
-        {
-            return [];
-        }
+        {}
 
         var results = await BuildOrderedSearchResultQuery(text)
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAutocompleteAsync_should_not_call_database_if_empty_search_term; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAutocompleteAsync_should_not_call_database_if_empty_search_term; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.SearchAutocompleteAsync_should_not_call_database_if_empty_search_term

[Killed] Linq method mutation (Take() to Skip())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:46:29
             return [];
         }
 
-        var results = await BuildOrderedSearchResultQuery(text)
-            .Take(5)
+        var results = await BuildOrderedSearchResultQuery(text)
+            .Skip(5)
             .ToArrayAsync();
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_Should_Return_Trusts_When_SearchTerm_Matches_Both_TrustId_; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:57:21
     {
         return academiesDbContext.Groups.Trusts()
             .Where(g =>
-                    g.GroupId!.Contains(searchTerm) // GroupId cannot be null for a trust
-                    || g.GroupName!.Contains(searchTerm) // Enforced by global EF query filter
+                    g.GroupId!.Contains(searchTerm) 
+                    && g.GroupName!.Contains(searchTerm) // Enforced by global EF query filter
             );
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_Should_Return_Trusts_When_SearchTerm_Matches_Both_TrustId_; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma

[Killed] Logical mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:66:17
     {
         return academiesDbContext.GiasEstablishments
             .Where(x =>
-                x.EstablishmentName!.Contains(searchTerm) // Enforced by global EF query filter
-                || x.Urn.ToString().Contains(searchTerm));
+                x.EstablishmentName!.Contains(searchTerm) 
+                && x.Urn.ToString().Contains(searchTerm));
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_not_return_schools_which_are_not_supported_types

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:72:16
 
     private IQueryable<SearchResult> BuildOrderedSearchResultQuery(string text)
     {
-        return SelectTrusts(CreateTrustSearchQuery(text))
-            .Union(SelectSchools(CreateSchoolSearchQuery(text)))
-            //Two entities could have the same (case-insensitive) name (e.g. a single academy trust or a school with a
-            //common name like "St. Mary's") so ensure that we order by another property too for consistent returns
-            .OrderBy(g => g.Name)
+        return SelectTrusts(CreateTrustSearchQuery(text))
+            .Union(SelectSchools(CreateSchoolSearchQuery(text)))
+            //Two entities could have the same (case-insensitive) name (e.g. a single academy trust or a school with a
+            //common name like "St. Mary's") so ensure that we order by another property too for consistent returns
+            .OrderByDescending(g => g.Name)
             .ThenBy(g => g.Id)
             .Select(x => new SearchResult(x.Id, x.Name, x.Type, stringFormattingUtilities.BuildAddressString(
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_return_first_20_trusts_or_schools_after_sorting_alphabetically_

[Killed] Linq method mutation (Union() to Intersect())
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:72:16
 
     private IQueryable<SearchResult> BuildOrderedSearchResultQuery(string text)
     {
-        return SelectTrusts(CreateTrustSearchQuery(text))
-            .Union(SelectSchools(CreateSchoolSearchQuery(text)))
+        return SelectTrusts(CreateTrustSearchQuery(text))
+            .Intersect(SelectSchools(CreateSchoolSearchQuery(text)))
             //Two entities could have the same (case-insensitive) name (e.g. a single academy trust or a school with a
             //common name like "St. Mary's") so ensure that we order by another property too for consistent returns
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_Should_Return_Trusts_When_SearchTerm_Matches_Both_TrustId_; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_only_return_5_results_when_there_are_more_than_5_ma

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:98:27
                 Id = g.GroupUid!.ToString(),
                 TrustGroupId = g.GroupId!.ToString(),
                 Type = g.GroupType!,
-                IsTrust = true
+                IsTrust = false
             });
         return query;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_map_properties_for_trusts; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetSearchResultsAsync_should_map_properties_for_trusts

[Killed] Boolean mutation
find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/Repositories/TrustSchoolSearchRepository.cs:116:27
                 Name = e.EstablishmentName!,
                 Id = e.Urn.ToString(),
                 Type = e.TypeOfEstablishmentName!,
-                IsTrust = false
+                IsTrust = true
             });
         return query;
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustSchoolSearchRepositoryTests.GetAutoCompleteSearchResultsAsync_should_map_properties_for_schools
