[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/StringFormattingUtilities.cs:19:22
             locality,
             town,
             postcode
-        }.Where(s => !string.IsNullOrWhiteSpace(s)));
+        }.Where(s => string.IsNullOrWhiteSpace(s)));
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolDetailsAsync_should_return_school_details

[Killed] String mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/StringFormattingUtilities.cs:19:23
             locality,
             town,
             postcode
-        }.Where(s => !string.IsNullOrWhiteSpace(s)));
+        }.Where(s => !(s!=null)));
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolDetailsAsync_should_return_school_details

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/StringFormattingUtilities.cs:24:28
 
     public string? GetFullName(string? firstName, string? lastName)
     {
-        var hasFirstName = !string.IsNullOrWhiteSpace(firstName);
+        var hasFirstName = string.IsNullOrWhiteSpace(firstName);
         var hasLastName = !string.IsNullOrWhiteSpace(lastName);
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolContactsAsync_should_return_headteacher_from_tad

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/StringFormattingUtilities.cs:25:27
     public string? GetFullName(string? firstName, string? lastName)
     {
         var hasFirstName = !string.IsNullOrWhiteSpace(firstName);
-        var hasLastName = !string.IsNullOrWhiteSpace(lastName);
+        var hasLastName = string.IsNullOrWhiteSpace(lastName);
 
         var fullName = (hasFirstName, hasLastName) switch
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolContactsAsync_should_return_headteacher_from_tad; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.StringFormattingUtilitiesTests.GetFullName_should_build_name_correctly_from_different_combinations_of_values; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.StringFormattingUtilitiesTests.GetFullName_should_build_name_correctly_from_different_combinations_of_values

[Killed] String mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/StringFormattingUtilities.cs:29:56
 
         var fullName = (hasFirstName, hasLastName) switch
         {
-            (hasFirstName: true, hasLastName: true) => $"{firstName} {lastName}",
+            (hasFirstName: true, hasLastName: true) => $"",
             (hasFirstName: true, hasLastName: false) => $"{firstName}",
             (hasFirstName: false, hasLastName: true) => $"{lastName}",
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.SchoolRepositoryTests.GetSchoolContactsAsync_should_return_headteacher_from_tad; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.StringFormattingUtilitiesTests.GetFullName_should_build_name_correctly_from_different_combinations_of_values

[Killed] String mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.AcademiesDb/StringFormattingUtilities.cs:30:57
         var fullName = (hasFirstName, hasLastName) switch
         {
             (hasFirstName: true, hasLastName: true) => $"{firstName} {lastName}",
-            (hasFirstName: true, hasLastName: false) => $"{firstName}",
+            (hasFirstName: true, hasLastName: false) => $"",
             (hasFirstName: false, hasLastName: true) => $"{lastName}",
             (hasFirstName: false, hasLastName: false) => null
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.StringFormattingUtilitiesTests.GetFullName_should_build_name_correctly_from_different_combinations_of_values; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.StringFormattingUtilitiesTests.GetFullName_should_build_name_correctly_from_different_combinations_of_values; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.StringFormattingUtilitiesTests.GetFullName_should_build_name_correctly_from_different_combinations_of_values
