[Killed] Block removal mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data.Hardcoded/FreeSchoolMealsAverage.cs:12:5
     public Dictionary<ExploreEducationStatisticsPhaseType, double> PercentOfPupilsByPhase { get; } = new();
 
     public FreeSchoolMealsAverage(int oldLaCode, string laName, string? newLaCode = null)
-    {
-        OldLaCode = oldLaCode;
-        LaName = laName;
-        NewLaCode = newLaCode;
-    }
+    {}
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.Hardcoded.UnitTests.FreeSchoolMealsAverageTests.LaName_should_be_initialised_with_constructor; DfE.FindInformationAcademiesTrusts.Data.Hardcoded.UnitTests.FreeSchoolMealsAverageTests.OldLaCode_should_be_initialised_with_constructor; DfE.FindInformationAcademiesTrusts.Data.Hardcoded.UnitTests.FreeSchoolMealsAverageTests.NewLaCode_should_be_initialised_with_constructor
