[Killed] Arithmetic mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/FinancialYear.cs:7:30
 {
     public FinancialYear(int year)
     {
-        Start = new DateOnly(year - 1, 09, 01);
+        Start = new DateOnly(year + 1, 09, 01);
         End = new DateOnly(year, 08, 31);
     }
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.FinancialYearTests.Start_should_be_1st_september_year_before_given_year; DfE.FindInformationAcademiesTrusts.Data.UnitTests.FinancialYearTests.Start_should_be_1st_september_year_before_given_year; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_submitted_when_no_link_for_year_with_closed_submission_window
