[Killed] Null coalescing mutation (remove left)
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:26:13
 
     public OfstedRating(int? overallEffectiveness, DateTime? inspectionDate)
         : this(
-            (OfstedRatingScore?)overallEffectiveness ?? OfstedRatingScore.NotInspected,
+            OfstedRatingScore.NotInspected,
             OfstedRatingScore.NotInspected,
             OfstedRatingScore.NotInspected,
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.ExportServices.AcademiesExportServiceTests.ExportAcademiesToSpreadsheet_ShouldCorrectlyExtractAcademyDataAsync

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:40:40
     {
     }
 
-    public bool HasAnyUnknownRating => OverallEffectiveness == OfstedRatingScore.Unknown
+    public bool HasAnyUnknownRating => OverallEffectiveness != OfstedRatingScore.Unknown
                                        || QualityOfEducation == OfstedRatingScore.Unknown
                                        || BehaviourAndAttitudes == OfstedRatingScore.Unknown
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set

[Killed] Logical mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:40:40
     {
     }
 
-    public bool HasAnyUnknownRating => OverallEffectiveness == OfstedRatingScore.Unknown
-                                       || QualityOfEducation == OfstedRatingScore.Unknown
-                                       || BehaviourAndAttitudes == OfstedRatingScore.Unknown
-                                       || PersonalDevelopment == OfstedRatingScore.Unknown
-                                       || EffectivenessOfLeadershipAndManagement == OfstedRatingScore.Unknown
+    public bool HasAnyUnknownRating => OverallEffectiveness == OfstedRatingScore.Unknown
+                                       || QualityOfEducation == OfstedRatingScore.Unknown
+                                       || BehaviourAndAttitudes == OfstedRatingScore.Unknown
+                                       || PersonalDevelopment == OfstedRatingScore.Unknown
+                                       && EffectivenessOfLeadershipAndManagement == OfstedRatingScore.Unknown
                                        || EarlyYearsProvision == OfstedRatingScore.Unknown
                                        || SixthFormProvision == OfstedRatingScore.Unknown
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.OfstedRepositoryTests.GetAcademiesInTrustOfstedAsync_should_log_error_for_each_urn_with_unknown_judgement

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:41:43
     }
 
     public bool HasAnyUnknownRating => OverallEffectiveness == OfstedRatingScore.Unknown
-                                       || QualityOfEducation == OfstedRatingScore.Unknown
+                                       || QualityOfEducation != OfstedRatingScore.Unknown
                                        || BehaviourAndAttitudes == OfstedRatingScore.Unknown
                                        || PersonalDevelopment == OfstedRatingScore.Unknown
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:42:43
 
     public bool HasAnyUnknownRating => OverallEffectiveness == OfstedRatingScore.Unknown
                                        || QualityOfEducation == OfstedRatingScore.Unknown
-                                       || BehaviourAndAttitudes == OfstedRatingScore.Unknown
+                                       || BehaviourAndAttitudes != OfstedRatingScore.Unknown
                                        || PersonalDevelopment == OfstedRatingScore.Unknown
                                        || EffectivenessOfLeadershipAndManagement == OfstedRatingScore.Unknown
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:43:43
     public bool HasAnyUnknownRating => OverallEffectiveness == OfstedRatingScore.Unknown
                                        || QualityOfEducation == OfstedRatingScore.Unknown
                                        || BehaviourAndAttitudes == OfstedRatingScore.Unknown
-                                       || PersonalDevelopment == OfstedRatingScore.Unknown
+                                       || PersonalDevelopment != OfstedRatingScore.Unknown
                                        || EffectivenessOfLeadershipAndManagement == OfstedRatingScore.Unknown
                                        || EarlyYearsProvision == OfstedRatingScore.Unknown
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:44:43
                                        || QualityOfEducation == OfstedRatingScore.Unknown
                                        || BehaviourAndAttitudes == OfstedRatingScore.Unknown
                                        || PersonalDevelopment == OfstedRatingScore.Unknown
-                                       || EffectivenessOfLeadershipAndManagement == OfstedRatingScore.Unknown
+                                       || EffectivenessOfLeadershipAndManagement != OfstedRatingScore.Unknown
                                        || EarlyYearsProvision == OfstedRatingScore.Unknown
                                        || SixthFormProvision == OfstedRatingScore.Unknown
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:45:43
                                        || BehaviourAndAttitudes == OfstedRatingScore.Unknown
                                        || PersonalDevelopment == OfstedRatingScore.Unknown
                                        || EffectivenessOfLeadershipAndManagement == OfstedRatingScore.Unknown
-                                       || EarlyYearsProvision == OfstedRatingScore.Unknown
+                                       || EarlyYearsProvision != OfstedRatingScore.Unknown
                                        || SixthFormProvision == OfstedRatingScore.Unknown
                                        || CategoryOfConcern == CategoriesOfConcern.Unknown
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:46:43
                                        || PersonalDevelopment == OfstedRatingScore.Unknown
                                        || EffectivenessOfLeadershipAndManagement == OfstedRatingScore.Unknown
                                        || EarlyYearsProvision == OfstedRatingScore.Unknown
-                                       || SixthFormProvision == OfstedRatingScore.Unknown
+                                       || SixthFormProvision != OfstedRatingScore.Unknown
                                        || CategoryOfConcern == CategoriesOfConcern.Unknown
                                        || SafeguardingIsEffective == SafeguardingScore.Unknown;
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:47:43
                                        || EffectivenessOfLeadershipAndManagement == OfstedRatingScore.Unknown
                                        || EarlyYearsProvision == OfstedRatingScore.Unknown
                                        || SixthFormProvision == OfstedRatingScore.Unknown
-                                       || CategoryOfConcern == CategoriesOfConcern.Unknown
+                                       || CategoryOfConcern != CategoriesOfConcern.Unknown
                                        || SafeguardingIsEffective == SafeguardingScore.Unknown;
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/OfstedRating.cs:48:43
                                        || EarlyYearsProvision == OfstedRatingScore.Unknown
                                        || SixthFormProvision == OfstedRatingScore.Unknown
                                        || CategoryOfConcern == CategoriesOfConcern.Unknown
-                                       || SafeguardingIsEffective == SafeguardingScore.Unknown;
+                                       || SafeguardingIsEffective != SafeguardingScore.Unknown;
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_true_when_any_rating_is_unknown; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_not_inspected; DfE.FindInformationAcademiesTrusts.Data.UnitTests.OfstedRatingTests.HasAnyUnknownRating_should_return_false_when_all_ratings_are_set
