[Killed] Block removal mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/PageStatus.cs:6:5
 public class PageStatus : IPageStatus
 {
     public PageStatus(int pageIndex, int totalPages, int totalResults)
-    {
-        PageIndex = pageIndex;
-        TotalPages = totalPages;
-        TotalResults = totalResults;
-    }
+    {}
 
     public int PageIndex { get; }
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.TotalResults_property_is_correct_when_setup; DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.HasPreviousPage_property_is_true_when_on_last_page; DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.TotalPages_property_is_correct_when_on_first_page

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/PageStatus.cs:15:36
     public int PageIndex { get; }
     public int TotalPages { get; }
     public int TotalResults { get; }
-    public bool HasPreviousPage => PageIndex > 1;
+    public bool HasPreviousPage => PageIndex < 1;
     public bool HasNextPage => PageIndex < TotalPages;
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.HasPreviousPage_property_is_true_when_on_last_page; DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.HasPreviousPage_property_is_false_by_default

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/PageStatus.cs:15:36
     public int PageIndex { get; }
     public int TotalPages { get; }
     public int TotalResults { get; }
-    public bool HasPreviousPage => PageIndex > 1;
+    public bool HasPreviousPage => PageIndex >= 1;
     public bool HasNextPage => PageIndex < TotalPages;
 }
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.HasPreviousPage_property_is_false_when_on_first_page

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/PageStatus.cs:16:32
     public int TotalPages { get; }
     public int TotalResults { get; }
     public bool HasPreviousPage => PageIndex > 1;
-    public bool HasNextPage => PageIndex < TotalPages;
+    public bool HasNextPage => PageIndex > TotalPages;
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.HasNextPage_property_is_true_when_on_first_page

[Killed] Equality mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/PageStatus.cs:16:32
     public int TotalPages { get; }
     public int TotalResults { get; }
     public bool HasPreviousPage => PageIndex > 1;
-    public bool HasNextPage => PageIndex < TotalPages;
+    public bool HasNextPage => PageIndex <= TotalPages;
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.HasNextPage_property_is_false_by_default; DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.HasNextPage_property_is_false_when_on_first_page
