[Killed] Arithmetic mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/PaginatedList.cs:9:44
 
     public PaginatedList(IEnumerable<T> items, int count, int pageIndex, int pageSize)
     {
-        var totalPages = (int)Math.Ceiling(count / (double)pageSize);
+        var totalPages = (int)Math.Ceiling(count * (double)pageSize);
         PageStatus = new PageStatus(pageIndex, totalPages, count);
         AddRange(items);
killedBy: DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.TotalPages_property_is_correct_when_on_first_page; DfE.FindInformationAcademiesTrusts.Data.UnitTests.PaginatedListTest.HasNextPage_property_is_false_when_on_first_page

[Killed] Statement mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/PaginatedList.cs:11:9
     {
         var totalPages = (int)Math.Ceiling(count / (double)pageSize);
         PageStatus = new PageStatus(pageIndex, totalPages, count);
-        AddRange(items);
+        ;
     }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForPageAsync_should_return_correct_mapped_models; DfE.FindInformationAcademiesTrusts.UnitTests.Pages.SearchModelTests.When_a_different_page_is_requested_return_a_different_page

[Killed] Block removal mutation
find-information-about-academies-and-trusts/find-information-about-academies-and-trusts/DfE.FindInformationAcademiesTrusts.Data/PaginatedList.cs:15:5
     }
 
     public static PaginatedList<T> Empty()
-    {
-        return new PaginatedList<T>(Array.Empty<T>(), 0, 0, 1);
-    }
+    {}
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForPageAsync_if_keywords_are_null_or_empty_should_return_empty_results; DfE.FindInformationAcademiesTrusts.UnitTests.Services.SearchServiceTest.GetSearchResultsForPageAsync_if_keywords_are_null_or_empty_should_return_empty_results
