[NoCoverage] Arithmetic mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/PipelineAcademy/PipelineSummary.cs:10:12
 )
     {
         public static int CalculateTotal(int preAdvisory, int postAdvisory, int freeSchools)
-        => preAdvisory + postAdvisory + freeSchools;
+        => preAdvisory + postAdvisory - freeSchools;
     }
 

[NoCoverage] Arithmetic mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/PipelineAcademy/PipelineSummary.cs:10:12
 )
     {
         public static int CalculateTotal(int preAdvisory, int postAdvisory, int freeSchools)
-        => preAdvisory + postAdvisory + freeSchools;
+        => preAdvisory - postAdvisory + freeSchools;
     }
 
