[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:13:71
     DateTime? DateOfTermEnd,
     string? Email) : Person(FullName, Email)
 {
-    public bool IsCurrentOrFutureGovernor => DateOfTermEnd == null || DateOfTermEnd >= DateTime.Today;
+    public bool IsCurrentOrFutureGovernor => DateOfTermEnd == null || DateOfTermEnd > DateTime.Today;
 
     public bool HasRoleLeadership =>
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldSortHistoricAndCurrentGovernors

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:13:46
     DateTime? DateOfTermEnd,
     string? Email) : Person(FullName, Email)
 {
-    public bool IsCurrentOrFutureGovernor => DateOfTermEnd == null || DateOfTermEnd >= DateTime.Today;
+    public bool IsCurrentOrFutureGovernor => DateOfTermEnd == null && DateOfTermEnd >= DateTime.Today;
 
     public bool HasRoleLeadership =>
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:16:9
     public bool IsCurrentOrFutureGovernor => DateOfTermEnd == null || DateOfTermEnd >= DateTime.Today;
 
     public bool HasRoleLeadership =>
-        HasRoleAccountingOfficer || HasRoleChiefFinancialOfficer ||
+        HasRoleAccountingOfficer && HasRoleChiefFinancialOfficer ||
         HasRoleChairOfTrustees;
 
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] Logical mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:16:9
     public bool IsCurrentOrFutureGovernor => DateOfTermEnd == null || DateOfTermEnd >= DateTime.Today;
 
     public bool HasRoleLeadership =>
-        HasRoleAccountingOfficer || HasRoleChiefFinancialOfficer ||
-        HasRoleChairOfTrustees;
+        HasRoleAccountingOfficer || HasRoleChiefFinancialOfficer &&
+        HasRoleChairOfTrustees;
 
     public bool HasRoleMember => Role == "Member";
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:19:34
         HasRoleAccountingOfficer || HasRoleChiefFinancialOfficer ||
         HasRoleChairOfTrustees;
 
-    public bool HasRoleMember => Role == "Member";
+    public bool HasRoleMember => Role != "Member";
 
     public bool HasRoleTrustee => Role == "Trustee";
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] String mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:19:42
         HasRoleAccountingOfficer || HasRoleChiefFinancialOfficer ||
         HasRoleChairOfTrustees;
 
-    public bool HasRoleMember => Role == "Member";
+    public bool HasRoleMember => Role == "";
 
     public bool HasRoleTrustee => Role == "Trustee";
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldSortHistoricAndCurrentGovernors

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:21:35
 
     public bool HasRoleMember => Role == "Member";
 
-    public bool HasRoleTrustee => Role == "Trustee";
+    public bool HasRoleTrustee => Role != "Trustee";
 
     private bool HasRoleAccountingOfficer => Role == "Accounting Officer";
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:23:46
 
     public bool HasRoleTrustee => Role == "Trustee";
 
-    private bool HasRoleAccountingOfficer => Role == "Accounting Officer";
+    private bool HasRoleAccountingOfficer => Role != "Accounting Officer";
 
     private bool HasRoleChiefFinancialOfficer => Role == "Chief Financial Officer";
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:25:50
 
     private bool HasRoleAccountingOfficer => Role == "Accounting Officer";
 
-    private bool HasRoleChiefFinancialOfficer => Role == "Chief Financial Officer";
+    private bool HasRoleChiefFinancialOfficer => Role != "Chief Financial Officer";
 
     private bool HasRoleChairOfTrustees => Role == "Chair of Trustees";
killedBy: DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole; DfE.FindInformationAcademiesTrusts.Data.AcademiesDb.UnitTests.Repositories.TrustRepositoryTests.GetTrustGovernanceAsync_ShouldReturnValidGovernors_WithTheCorrectRole

[Killed] Equality mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/Trust/Governor.cs:27:44
 
     private bool HasRoleChiefFinancialOfficer => Role == "Chief Financial Officer";
 
-    private bool HasRoleChairOfTrustees => Role == "Chair of Trustees";
+    private bool HasRoleChairOfTrustees => Role != "Chair of Trustees";
 }
 
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernorsExcludingLeadership_Excludes_LeadershipRoles; DfE.FindInformationAcademiesTrusts.UnitTests.Services.TrustServiceGovernanceTurnoverTests.GetGovernanceTurnoverRate_Calculates_CorrectTurnover
