[Killed] Block removal mutation
DfE.FindInformationAcademiesTrusts.Data/Repositories/TrustDocument/TrustDocument.cs:6:5
 public record TrustDocument
 {
     public TrustDocument(int financialYearEndYear, string link)
-    {
-        FinancialYear = new FinancialYear(financialYearEndYear);
-        Link = link;
-    }
+    {}
 
     public FinancialYear FinancialYear { get; }
killedBy: DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_submitted_when_no_link_for_year_with_closed_submission_window; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_submitted_when_link_exists_even_though_trust_opened_after_financial_year_en; DfE.FindInformationAcademiesTrusts.UnitTests.Services.FinancialDocumentServiceTests.GetFinancialDocumentsAsync_should_return_not_expected_when_no_link_and_trust_opened_after_financial_year_ended
